# -*- coding: utf-8 -*-
import scrapy

import json

from cansoCrawler.items import InpinHomeItem


class InpinSpider(scrapy.Spider):
    name = 'inpin'
    allowed_domains = ['api.inpinapp.com']
    _pages = 2

    def start_requests(self):
        for city in self.city_list:
            for category in self.category_list:
                for sub_category in category.get('sub', []):
                    for deal_type in self.deal_type_list:
                        for page in range(1, self._pages):
                            body = json.dumps(
                                self.create_body(deal_type['id'], float(city['0']), float(city['1']), category['id'],
                                                 sub_category['id']))
                            self.logger.info("mostafa: " + body)
                            yield scrapy.Request(
                                url=f"https://api.inpinapp.com/api/advertisement/map-filter?order=our_suggestion&direction=desc&page={page}&with_banner=1",
                                headers=self.header, method='post',
                                body=body,
                                cb_kwargs={"city": city['city'], "province": city['province'],
                                           "deal_type": deal_type['title'], "category": category['title'],
                                           "sub_category": sub_category['title']})

    def parse(self, response, city, province, deal_type, category, sub_category):
        json_response = json.loads(response.body.decode('UTF-8'))
        data_list = json_response['advertisements']['data']
        self.logger.info(f"data length: {len(data_list)}")
        for ad in data_list:
            yield response.follow(url=f"https://api.inpinapp.com/api/advertisement/{ad['id']}", headers=self.header,
                                  callback=self.parse_ad,
                                  cb_kwargs={"city": city, "province": province,
                                             "deal_type": deal_type, "category": category,
                                             "sub_category": sub_category}
                                  )

    def parse_ad(self, response, city, province, deal_type, category, sub_category):
        json_response = json.loads(response.body.decode('UTF-8'))
        item = InpinHomeItem()
        try:
            item['city'] = city
            item['province'] = province
            item['category'] = deal_type + " " + category
            item['sub_category'] = sub_category
            item.extract(json_response)
        except Exception as e:
            self.logger.critical(f"extract error: {e} for => {response.body}")
        return item

    def create_body(self, deal_type, one: float, two: float, category, sub_category):

        return {
            "advertisement_filter": {
                "_isChangedState": True,
                "advertisement_type_ids": [deal_type],
                "estate_type_ids": [sub_category],
                "application_ids": [category],
                "shape": {
                    "type": "polygon",
                    "coordinates": [
                        [
                            [
                                (two + 0.00965503122693),
                                (one + 0.01011466295472)
                            ],
                            [
                                (two + 0.00965503122693),
                                (one - 0.01012662713333)
                            ],
                            [
                                (two - 0.009656873680294),
                                (one - 0.01012662713333)
                            ],
                            [
                                (two - 0.009656873680294),
                                (one + 0.01011466295472)
                            ],
                            [
                                (two + 0.00965503122693),
                                (one + 0.01011466295472)
                            ]
                        ]
                    ]
                }
            },
            "agent_filter": {
                "shape": {
                    "type": "polygon",
                    "coordinates": [
                        [
                            [
                                (two + 0.00965503122693),
                                (one + 0.01011466295472)
                            ],
                            [
                                (two + 0.00965503122693),
                                (one - 0.01012662713333)
                            ],
                            [
                                (two - 0.009656873680294),
                                (one - 0.01012662713333)
                            ],
                            [
                                (two - 0.009656873680294),
                                (one + 0.01011466295472)
                            ],
                            [
                                (two + 0.00965503122693),
                                (one + 0.01011466295472)
                            ]
                        ]
                    ]
                }
            },
            "region_filter": {
                "shape": {
                    "type": "point",
                    "coordinates": [
                        (two),
                        (one)
                    ]
                }
            }
        }

    header = {
        "Authorization": "Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImp0aSI6ImUzN2E4NjM0MzNmMjFmNzdlNzJkYzVjYmFiNjdlY2YxNTMwNmNhNmQ4NzYyYTI2MjM3ZmZlMDU1ZTJmNWVmYjY2YjlmMzExZDVkOWNkMjk3In0.eyJhdWQiOiIyIiwianRpIjoiZTM3YTg2MzQzM2YyMWY3N2U3MmRjNWNiYWI2N2VjZjE1MzA2Y2E2ZDg3NjJhMjYyMzdmZmUwNTVlMmY1ZWZiNjZiOWYzMTFkNWQ5Y2QyOTciLCJpYXQiOjE1MTQzNjExODgsIm5iZiI6MTUxNDM2MTE4OCwiZXhwIjoxNTQ1ODk3MTg4LCJzdWIiOiIyIiwic2NvcGVzIjpbXX0.C78r4gQnoSC-RKoIFk1Y7hni8UWCJk1I3yNB-6Mfh9xtxdC4MQHQ2CMzIppw_zea1tHZdw5QdgQBcV7TcyG9o35gkCpCFX_WoDSaWtLn8osy58oNsp83hddYqVSO8Ki4t23KKOKg6f6A3QIlD6ifkWnhcPHACKvXyFHzONagpsKvOuYjrJ6VgY84R2xAb-E08vceyWndDjouqHqAY_LD0Uw7rXd_mD1h3LCsCDSLTGWg3M7FLKPe91Pcg8XUHmFT5x5ZElkcalNuijKDCcw-S7BbFLba9pqA_5dWKVHRAd7PABOf7kCU1qqIcWP2u8KZndw1EWQhaiNMnPDu06V0pE2OBKsiFAtxWz-AsFEtdkdQzCdOuXZU9jzU4QHkSh0IgQE0e_23rVidxU0vtpANAcmUwYrX0i2fbjVif9IhaZr2n5viz2pKFo944YfsPJJBBGQy4JlU42sfoofX8_QILeD5fll_M0qcIfGA__XR-t0mxvl2wiRY88DJDw84HfVw1ZYWxKOmYIKE03GDCKvnOIJpSZHGpL4D8z2wVKfEuuMt5fFq8mdBfkEqjTgJMcpen91WvlIBaj6rQfMayQN_38j6Gkvsr_-3xLrqYjbGswYNVnF_PD6_PBKpVAP1l2vN-fxI_ru0AQ4jgA5sFHfiTum56d64HzpgHoRCq4rgGJA",
        "Content-Type": "application/json"
    }

    city_list = [
        {
            "0": "37.868206846002998",
            "1": "45.866718676854397",
            "city": "اسکو",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.620143735814302",
            "1": "47.213684563100301",
            "city": "اهر",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.948429",
            "1": "45.984283",
            "city": "ایلخچی",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.043640",
            "1": "46.363930",
            "city": "باسمنج",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "35.773293",
            "1": "47.654613",
            "city": "آقکند",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.0651720158152",
            "1": "46.289841518480799",
            "city": "تبریز",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.727929035453499",
            "1": "45.898248291359501",
            "city": "آذرشهر",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "39.047432",
            "1": "47.317764",
            "city": "آبش احمد",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.803203308495299",
            "1": "46.813094973560801",
            "city": "بستان آباد",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.325653243349599",
            "1": "45.9954672681015",
            "city": "بناب",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "35.628357",
            "1": "51.372337",
            "city": "بخشایش",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "35.752319",
            "1": "51.400967",
            "city": "بناب جدید",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.582153",
            "1": "47.391228",
            "city": "ترکمانچای",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "35.797622926761299",
            "1": "50.990793764508098",
            "city": "ترک",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.745193",
            "1": "46.930984",
            "city": "تیکمه داش",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.314545",
            "1": "45.366592",
            "city": "تسوج",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.831413",
            "1": "46.218567",
            "city": "خاروانا",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.311787",
            "1": "46.529259",
            "city": "خراجو",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "32.635404204999602",
            "1": "51.656084588378299",
            "city": "جلفا",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "39.157722",
            "1": "47.033699",
            "city": "خمارلو",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "36.286011125297698",
            "1": "59.607527122463502",
            "city": "خامنه",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.949039",
            "1": "46.055145",
            "city": "خسروشهر",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "36.342956937291198",
            "1": "59.635315852130702",
            "city": "خواجه",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.948471",
            "1": "47.118767",
            "city": "دوزدوزان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.985561",
            "1": "46.431812",
            "city": "زرنق",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.586185",
            "1": "45.830288",
            "city": "زنوز",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.023966991172401",
            "1": "46.153019721237897",
            "city": "سردرود",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "36.336476407183497",
            "1": "59.653951750704998",
            "city": "سیس",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "35.741512",
            "1": "51.289787",
            "city": "شربیان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.241792582939397",
            "1": "45.746394032726698",
            "city": "شبستر",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "36.294332061214803",
            "1": "59.6042823748205",
            "city": "سراب",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.175526",
            "1": "45.490078",
            "city": "شرفخانه",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.868874",
            "1": "46.002968",
            "city": "سیه رود",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.142662",
            "1": "45.623928",
            "city": "شندآباد",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "35.582264",
            "1": "51.453079",
            "city": "شهرجدیدسهند",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "34.075909",
            "1": "49.669930",
            "city": "صوفیان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.547770355693203",
            "1": "46.025646750912003",
            "city": "عجب شیر",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.457733",
            "1": "45.568016",
            "city": "کشکسرای",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.081158",
            "1": "46.267830",
            "city": "قره آغاج",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.102547",
            "1": "46.991222",
            "city": "کلوانق",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "35.701202",
            "1": "51.458149",
            "city": "کوزه کنان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.937591803823501",
            "1": "47.138108595950797",
            "city": "کلیبر",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.013344",
            "1": "46.204754",
            "city": "لیلان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.3610269272775",
            "1": "46.4211561198304",
            "city": "مراغه",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.779453",
            "1": "45.902534",
            "city": "گوگان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.5578299346177",
            "1": "45.659079785653901",
            "city": "مرند",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.821331",
            "1": "45.972668",
            "city": "ممقان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.127159946308097",
            "1": "46.202758168407698",
            "city": "ملکان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.129211",
            "1": "45.713150",
            "city": "وایقان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.466516778055201",
            "1": "47.723731220472601",
            "city": "میانه",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.347775",
            "1": "46.762825",
            "city": "نظرکهریزی",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.082001",
            "1": "47.131378",
            "city": "مهربان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.600535756514397",
            "1": "46.452456302897602",
            "city": "ورزقان",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.838139",
            "1": "45.663807",
            "city": "هادیشهر",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.227694815489201",
            "1": "46.823401591984997",
            "city": "هریس",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "37.4241905484513",
            "1": "46.904764668147997",
            "city": "هشترود",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.523193",
            "1": "45.639389",
            "city": "یامچی",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "38.809135",
            "1": "47.384281",
            "city": "هوراند",
            "province": "آذربایجان شرقی"
        },
        {
            "0": "39.331772",
            "1": "44.156258",
            "city": "آواجیق",
            "province": "آذربایجان غربی"
        },
        {
            "0": "37.069007880897203",
            "1": "45.0588687068146",
            "city": "اشنویه",
            "province": "آذربایجان غربی"
        },
        {
            "0": "38.716801",
            "1": "45.210644",
            "city": "ایواوغلی",
            "province": "آذربایجان غربی"
        },
        {
            "0": "37.617095864462598",
            "1": "44.927999617726897",
            "city": "ارومیه",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.952908",
            "1": "46.322491",
            "city": "باروق",
            "province": "آذربایجان غربی"
        },
        {
            "0": "39.1999620472792",
            "1": "45.091304615656803",
            "city": "پلدشت",
            "province": "آذربایجان غربی"
        },
        {
            "0": "35.654457",
            "1": "51.339443",
            "city": "بازرگان",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.5566706597142",
            "1": "46.141461604489201",
            "city": "بوکان",
            "province": "آذربایجان غربی"
        },
        {
            "0": "38.258732",
            "1": "48.295738",
            "city": "تازه شهر",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.681302208623997",
            "1": "45.225220127853198",
            "city": "پیرانشهر",
            "province": "آذربایجان غربی"
        },
        {
            "0": "37.124310",
            "1": "45.974701",
            "city": "چهاربرج",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.505685749248798",
            "1": "47.124048250151503",
            "city": "تکاب",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.507385",
            "1": "45.796844",
            "city": "خلیفان",
            "province": "آذربایجان غربی"
        },
        {
            "0": "38.461414",
            "1": "45.023605",
            "city": "دیزج دیز",
            "province": "آذربایجان غربی"
        },
        {
            "0": "37.423981",
            "1": "44.851948",
            "city": "سیلوانه",
            "province": "آذربایجان غربی"
        },
        {
            "0": "38.604780865370699",
            "1": "44.761679566682801",
            "city": "خوی",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.211445",
            "1": "45.552654",
            "city": "ربط",
            "province": "آذربایجان غربی"
        },
        {
            "0": "38.1391244651861",
            "1": "44.6550261384767",
            "city": "سلماس",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.730263",
            "1": "46.153431",
            "city": "سیمینه",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.230435545706399",
            "1": "45.460908031167499",
            "city": "سردشت",
            "province": "آذربایجان غربی"
        },
        {
            "0": "39.064468",
            "1": "44.384953",
            "city": "سیه چشمه",
            "province": "آذربایجان غربی"
        },
        {
            "0": "39.138037998997497",
            "1": "44.837953723881803",
            "city": "شوط",
            "province": "آذربایجان غربی"
        },
        {
            "0": "35.7783833279505",
            "1": "51.352753568178201",
            "city": "سرو",
            "province": "آذربایجان غربی"
        },
        {
            "0": "38.580044",
            "1": "44.834942",
            "city": "فیرورق",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.677431203746899",
            "1": "46.644376640256603",
            "city": "شاهین دژ",
            "province": "آذربایجان غربی"
        },
        {
            "0": "38.469322",
            "1": "44.405640",
            "city": "قطور",
            "province": "آذربایجان غربی"
        },
        {
            "0": "38.889660",
            "1": "45.025387",
            "city": "قره ضیاءالدین",
            "province": "آذربایجان غربی"
        },
        {
            "0": "37.967228",
            "1": "45.006084",
            "city": "قوشچی",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.811859",
            "1": "45.274441",
            "city": "گردکشانه",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.247371770159099",
            "1": "59.690770936804803",
            "city": "کشاورز",
            "province": "آذربایجان غربی"
        },
        {
            "0": "39.444196433896799",
            "1": "44.589334584843797",
            "city": "ماکو",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.605561838686597",
            "1": "52.334672930174897",
            "city": "محمودآباد",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.661737000872797",
            "1": "45.736529809146901",
            "city": "مهاباد",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.984192",
            "1": "45.143391",
            "city": "نالوس",
            "province": "آذربایجان غربی"
        },
        {
            "0": "37.011326011647299",
            "1": "46.1957519189301",
            "city": "میاندوآب",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.405964",
            "1": "45.372963",
            "city": "میرآباد",
            "province": "آذربایجان غربی"
        },
        {
            "0": "36.9776088804648",
            "1": "45.446706646584197",
            "city": "نقده",
            "province": "آذربایجان غربی"
        },
        {
            "0": "37.733421",
            "1": "45.052456",
            "city": "نوشین",
            "province": "آذربایجان غربی"
        },
        {
            "0": "35.645325",
            "1": "51.423447",
            "city": "محمدیار",
            "province": "آذربایجان غربی"
        },
        {
            "0": "39.442333",
            "1": "47.410145",
            "city": "اصلاندوز",
            "province": "اردبیل"
        },
        {
            "0": "38.262754492568298",
            "1": "48.271164550641402",
            "city": "اردبیل",
            "province": "اردبیل"
        },
        {
            "0": "38.283718",
            "1": "48.552330",
            "city": "آبی بیگلو",
            "province": "اردبیل"
        },
        {
            "0": "37.293390600301798",
            "1": "49.708818013141098",
            "city": "جعفرآباد",
            "province": "اردبیل"
        },
        {
            "0": "38.193239443767503",
            "1": "48.009060268367399",
            "city": "سرعین",
            "province": "اردبیل"
        },
        {
            "0": "34.382638354015398",
            "1": "47.119000842985002",
            "city": "تازه کندانگوت",
            "province": "اردبیل"
        },
        {
            "0": "39.340009561713998",
            "1": "47.972991986007401",
            "city": "بیله سوار",
            "province": "اردبیل"
        },
        {
            "0": "37.426862092314501",
            "1": "48.541842556187298",
            "city": "خلخال",
            "province": "اردبیل"
        },
        {
            "0": "35.742238918409697",
            "1": "51.466601953609803",
            "city": "کلور",
            "province": "اردبیل"
        },
        {
            "0": "29.611000701162499",
            "1": "52.524353988997099",
            "city": "فخرآباد",
            "province": "اردبیل"
        },
        {
            "0": "39.474634762111101",
            "1": "47.736211643833997",
            "city": "پارس آباد",
            "province": "اردبیل"
        },
        {
            "0": "37.6676681",
            "1": "45.025371",
            "city": "تازه کند",
            "province": "اردبیل"
        },
        {
            "0": "35.637825424750297",
            "1": "51.409343487818902",
            "city": "گیوی",
            "province": "اردبیل"
        },
        {
            "0": "35.6882970648428",
            "1": "51.342129477149498",
            "city": "رضی",
            "province": "اردبیل"
        },
        {
            "0": "37.545987090432298",
            "1": "48.436601760872797",
            "city": "هشتجین",
            "province": "اردبیل"
        },
        {
            "0": "38.390404086296599",
            "1": "48.467106504346702",
            "city": "نمین",
            "province": "اردبیل"
        },
        {
            "0": "39.032294155278898",
            "1": "47.8789947121832",
            "city": "گرمی",
            "province": "اردبیل"
        },
        {
            "0": "32.367576281867002",
            "1": "52.246980945470597",
            "city": "اژیه",
            "province": "اصفهان"
        },
        {
            "0": "36.594868499999997",
            "1": "50.252273099999996",
            "city": "هیر",
            "province": "اردبیل"
        },
        {
            "0": "37.991017645728803",
            "1": "48.106707062500902",
            "city": "نیر",
            "province": "اردبیل"
        },
        {
            "0": "35.728009020391603",
            "1": "51.4555702156553",
            "city": "انارک",
            "province": "اصفهان"
        },
        {
            "0": "33.862501111884399",
            "1": "51.688113854080903",
            "city": "بادرود",
            "province": "اصفهان"
        },
        {
            "0": "32.245853541835302",
            "1": "52.442471460304603",
            "city": "اصفهان",
            "province": "اصفهان"
        },
        {
            "0": "34.385154582345599",
            "1": "47.1159265194349",
            "city": "ابریشم",
            "province": "اصفهان"
        },
        {
            "0": "33.5889821214504",
            "1": "52.612799657163599",
            "city": "اردستان",
            "province": "اصفهان"
        },
        {
            "0": "38.558067065603701",
            "1": "47.765259022815599",
            "city": "مشگین شهر",
            "province": "اردبیل"
        },
        {
            "0": "34.171535409024003",
            "1": "51.872504746664603",
            "city": "آران وبیدگل",
            "province": "اصفهان"
        },
        {
            "0": "32.368906306892697",
            "1": "51.235187660667798",
            "city": "باغ بهادران",
            "province": "اصفهان"
        },
        {
            "0": "35.500554215093601",
            "1": "54.4523137738041",
            "city": "جندق",
            "province": "اصفهان"
        },
        {
            "0": "33.156538510010101",
            "1": "50.089558958258003",
            "city": "بوئین ومیاندشت",
            "province": "اصفهان"
        },
        {
            "0": "32.660619475936599",
            "1": "51.648197128644298",
            "city": "جوزدان",
            "province": "اصفهان"
        },
        {
            "0": "34.228772954173003",
            "1": "50.904070155701604",
            "city": "برف انبار",
            "province": "اصفهان"
        },
        {
            "0": "32.650754592705098",
            "1": "51.727530862228797",
            "city": "بهاران شهر",
            "province": "اصفهان"
        },
        {
            "0": "35.530142049660398",
            "1": "51.170719628268301",
            "city": "بهارستان",
            "province": "اصفهان"
        },
        {
            "0": "32.783228945745897",
            "1": "50.959171098910801",
            "city": "تیران",
            "province": "اصفهان"
        },
        {
            "0": "32.341684869500597",
            "1": "51.233576678813897",
            "city": "چرمهین",
            "province": "اصفهان"
        },
        {
            "0": "32.748860405240997",
            "1": "50.533093524766699",
            "city": "چادگان",
            "province": "اصفهان"
        },
        {
            "0": "32.390799967283897",
            "1": "51.349696188931198",
            "city": "چمگردان",
            "province": "اصفهان"
        },
        {
            "0": "32.648809514734999",
            "1": "51.751842978929297",
            "city": "خوراسگان",
            "province": "اصفهان"
        },
        {
            "0": "31.881332843910499",
            "1": "54.360235793944",
            "city": "حنا",
            "province": "اصفهان"
        },
        {
            "0": "32.475623411189297",
            "1": "51.770532741448797",
            "city": "دامنه",
            "province": "اصفهان"
        },
        {
            "0": "32.827293747659503",
            "1": "51.859988305714303",
            "city": "حبیب آباد",
            "province": "اصفهان"
        },
        {
            "0": "34.841004777188601",
            "1": "48.5541718965736",
            "city": "حسن آباد",
            "province": "اصفهان"
        },
        {
            "0": "33.249765377630901",
            "1": "50.381405013707599",
            "city": "خوانسار",
            "province": "اصفهان"
        },
        {
            "0": "32.682338195372402",
            "1": "51.5109296469385",
            "city": "خمینی شهر",
            "province": "اصفهان"
        },
        {
            "0": "33.794565191224699",
            "1": "54.915801560344804",
            "city": "خور",
            "province": "اصفهان"
        },
        {
            "0": "32.814499751716603",
            "1": "50.974365407140297",
            "city": "داران",
            "province": "اصفهان"
        },
        {
            "0": "32.622285322954298",
            "1": "51.604711592177601",
            "city": "دستگرد",
            "province": "اصفهان"
        },
        {
            "0": "32.391989970238797",
            "1": "51.455096926516497",
            "city": "دیزیچه",
            "province": "اصفهان"
        },
        {
            "0": "31.979446699433101",
            "1": "51.615193227458498",
            "city": "دهاقان",
            "province": "اصفهان"
        },
        {
            "0": "32.617625694227698",
            "1": "51.567384448705901",
            "city": "درچه پیاز",
            "province": "اصفهان"
        },
        {
            "0": "38.112830575338201",
            "1": "46.290116641387399",
            "city": "رضوانشهر",
            "province": "اصفهان"
        },
        {
            "0": "35.423114655682397",
            "1": "51.584966893639603",
            "city": "زیباشهر",
            "province": "اصفهان"
        },
        {
            "0": "35.850738900000003",
            "1": "50.919419699999999",
            "city": "دهق",
            "province": "اصفهان"
        },
        {
            "0": "32.6086576580512",
            "1": "51.768308529176302",
            "city": "زاینده رود",
            "province": "اصفهان"
        },
        {
            "0": "35.8091290713676",
            "1": "50.970203309174202",
            "city": "دولت آباد",
            "province": "اصفهان"
        },
        {
            "0": "35.7420023404934",
            "1": "51.4548643226167",
            "city": "زواره",
            "province": "اصفهان"
        },
        {
            "0": "32.376856844368803",
            "1": "51.302289223913697",
            "city": "سده لنجان",
            "province": "اصفهان"
        },
        {
            "0": "32.373013002429701",
            "1": "51.366737670497699",
            "city": "زرین شهر",
            "province": "اصفهان"
        },
        {
            "0": "32.6861798856552",
            "1": "51.669579722870402",
            "city": "عسگران",
            "province": "اصفهان"
        },
        {
            "0": "31.281193318735301",
            "1": "51.600143610843297",
            "city": "سمیرم",
            "province": "اصفهان"
        },
        {
            "0": "31.864236690253499",
            "1": "51.880253307095799",
            "city": "شهرضا",
            "province": "اصفهان"
        },
        {
            "0": "32.852278098668002",
            "1": "50.002045918578403",
            "city": "فریدونشهر",
            "province": "اصفهان"
        },
        {
            "0": "32.514583492853603",
            "1": "51.536890419094398",
            "city": "فلاورجان",
            "province": "اصفهان"
        },
        {
            "0": "32.539961981343701",
            "1": "51.428419902351898",
            "city": "قهدریجان",
            "province": "اصفهان"
        },
        {
            "0": "32.594362258112298",
            "1": "51.363788036974903",
            "city": "فولادشهر",
            "province": "اصفهان"
        },
        {
            "0": "32.7040176532591",
            "1": "51.791217234147197",
            "city": "قهجاورستان",
            "province": "اصفهان"
        },
        {
            "0": "32.860647186106803",
            "1": "51.553004714741903",
            "city": "شاهین شهر",
            "province": "اصفهان"
        },
        {
            "0": "33.842526566118799",
            "1": "51.482693808626699",
            "city": "قمصر",
            "province": "اصفهان"
        },
        {
            "0": "32.685121150000001",
            "1": "51.683133300000001",
            "city": "گرگاب",
            "province": "اصفهان"
        },
        {
            "0": "32.702926374775402",
            "1": "51.633094474237303",
            "city": "فرخی",
            "province": "اصفهان"
        },
        {
            "0": "33.920791125878999",
            "1": "51.2783012639322",
            "city": "کاشان",
            "province": "اصفهان"
        },
        {
            "0": "33.493297261398801",
            "1": "50.352832192014098",
            "city": "گوگد",
            "province": "اصفهان"
        },
        {
            "0": "32.661556850046601",
            "1": "51.665231440401698",
            "city": "کوشک",
            "province": "اصفهان"
        },
        {
            "0": "33.447081253186703",
            "1": "50.386485034047098",
            "city": "گلپایگان",
            "province": "اصفهان"
        },
        {
            "0": "35.767320550533299",
            "1": "51.314045469221803",
            "city": "کوهپایه",
            "province": "اصفهان"
        },
        {
            "0": "35.819603206589598",
            "1": "50.936461655256899",
            "city": "گلشهر",
            "province": "اصفهان"
        },
        {
            "0": "35.870431220998299",
            "1": "50.904021753165203",
            "city": "گلدشت",
            "province": "اصفهان"
        },
        {
            "0": "35.7430339387383",
            "1": "51.562995838176498",
            "city": "گلشن",
            "province": "اصفهان"
        },
        {
            "0": "32.276749688704797",
            "1": "51.510262350781197",
            "city": "مبارکه",
            "province": "اصفهان"
        },
        {
            "0": "38.0764779",
            "1": "46.292029700000001",
            "city": "مشکات",
            "province": "اصفهان"
        },
        {
            "0": "34.098976415139802",
            "1": "51.381030971233599",
            "city": "محمدآباد",
            "province": "اصفهان"
        },
        {
            "0": "37.266938746229997",
            "1": "56.5177771489059",
            "city": "لای بید",
            "province": "اصفهان"
        },
        {
            "0": "33.208070388982598",
            "1": "46.922181479903699",
            "city": "میمه",
            "province": "اصفهان"
        },
        {
            "0": "33.402169237942402",
            "1": "53.690845682321502",
            "city": "نائین",
            "province": "اصفهان"
        },
        {
            "0": "32.649626762924797",
            "1": "51.610958784733803",
            "city": "نصرآباد",
            "province": "اصفهان"
        },
        {
            "0": "33.547779608511703",
            "1": "51.8767112546645",
            "city": "نطنز",
            "province": "اصفهان"
        },
        {
            "0": "32.240053570917702",
            "1": "52.652201221237299",
            "city": "ورزنه",
            "province": "اصفهان"
        },
        {
            "0": "34.007121859386203",
            "1": "51.199300039930499",
            "city": "نیاسر",
            "province": "اصفهان"
        },
        {
            "0": "38.051896389124202",
            "1": "46.274942242381002",
            "city": "منظریه",
            "province": "اصفهان"
        },
        {
            "0": "32.264800981284701",
            "1": "51.3272453324604",
            "city": "ورنامخواست",
            "province": "اصفهان"
        },
        {
            "0": "32.960074735137603",
            "1": "51.054819701180698",
            "city": "نجف آباد",
            "province": "اصفهان"
        },
        {
            "0": "35.676329799999998",
            "1": "51.370851350000002",
            "city": "وزوان",
            "province": "اصفهان"
        },
        {
            "0": "34.0092983283851",
            "1": "51.436580848171097",
            "city": "نوش آباد",
            "province": "اصفهان"
        },
        {
            "0": "32.525873993659403",
            "1": "52.508614440583102",
            "city": "هرند",
            "province": "اصفهان"
        },
        {
            "0": "35.7643093874984",
            "1": "51.391913977109297",
            "city": "ونک",
            "province": "اصفهان"
        },
        {
            "0": "35.708510894737799",
            "1": "50.421491386851002",
            "city": "اشتهارد",
            "province": "البرز"
        },
        {
            "0": "32.367576281867002",
            "1": "52.246980945470597",
            "city": "نیک آباد",
            "province": "اصفهان"
        },
        {
            "0": "35.956953799581797",
            "1": "51.148765663114197",
            "city": "کرج",
            "province": "البرز"
        },
        {
            "0": "35.753326452506997",
            "1": "51.065796140219298",
            "city": "گرمدره",
            "province": "البرز"
        },
        {
            "0": "35.721604419970802",
            "1": "50.799357634546404",
            "city": "ماهدشت",
            "province": "البرز"
        },
        {
            "0": "35.752253226597503",
            "1": "50.900523913992302",
            "city": "محمدشهر",
            "province": "البرز"
        },
        {
            "0": "36.289146706301302",
            "1": "59.611199876753602",
            "city": "چهارباغ",
            "province": "البرز"
        },
        {
            "0": "32.693474440589704",
            "1": "51.699129585005601",
            "city": "سیف آباد",
            "province": "البرز"
        },
        {
            "0": "35.894043486907201",
            "1": "50.514063991288602",
            "city": "نظرآباد",
            "province": "البرز"
        },
        {
            "0": "36.211676826520304",
            "1": "50.771017212619",
            "city": "طالقان",
            "province": "البرز"
        },
        {
            "0": "35.7310975623842",
            "1": "51.358217963004897",
            "city": "کمال شهر",
            "province": "البرز"
        },
        {
            "0": "33.376517183926502",
            "1": "46.735478350229002",
            "city": "ارکواز",
            "province": "ایلام"
        },
        {
            "0": "35.794713962749",
            "1": "51.381390751479401",
            "city": "کوهسار",
            "province": "البرز"
        },
        {
            "0": "37.955726599999998",
            "1": "46.122817737346097",
            "city": "هشتگرد",
            "province": "البرز"
        },
        {
            "0": "35.736586663516",
            "1": "50.927738264864999",
            "city": "مشکین دشت",
            "province": "البرز"
        },
        {
            "0": "33.208070388982598",
            "1": "46.922181479903699",
            "city": "پهله",
            "province": "ایلام"
        },
        {
            "0": "32.8463530812435",
            "1": "47.544894912103899",
            "city": "آبدانان",
            "province": "ایلام"
        },
        {
            "0": "33.312724457928297",
            "1": "47.027354423318002",
            "city": "بدره",
            "province": "ایلام"
        },
        {
            "0": "33.884385569833398",
            "1": "46.166001941890599",
            "city": "ایوان",
            "province": "ایلام"
        },
        {
            "0": "33.120932964951699",
            "1": "46.919897726810099",
            "city": "ایلام",
            "province": "ایلام"
        },
        {
            "0": "32.659172524462903",
            "1": "47.282628753848698",
            "city": "دهلران",
            "province": "ایلام"
        },
        {
            "0": "33.803081991854697",
            "1": "46.509857894129297",
            "city": "آسمان آباد",
            "province": "ایلام"
        },
        {
            "0": "38.033232202946202",
            "1": "46.163885637802402",
            "city": "توحید",
            "province": "ایلام"
        },
        {
            "0": "33.643472467529499",
            "1": "46.672704802908903",
            "city": "سرابله",
            "province": "ایلام"
        },
        {
            "0": "33.573498281913302",
            "1": "46.7341896656581",
            "city": "لومار",
            "province": "ایلام"
        },
        {
            "0": "29.604890516086801",
            "1": "52.590071011969997",
            "city": "دلگشا",
            "province": "ایلام"
        },
        {
            "0": "32.7139547196088",
            "1": "47.760290376601297",
            "city": "مورموری",
            "province": "ایلام"
        },
        {
            "0": "33.196792391110201",
            "1": "47.323121630155399",
            "city": "دره شهر",
            "province": "ایلام"
        },
        {
            "0": "35.865934539925902",
            "1": "47.605699578747",
            "city": "سراب باغ",
            "province": "ایلام"
        },
        {
            "0": "32.529245307919098",
            "1": "47.369469719938998",
            "city": "موسیان",
            "province": "ایلام"
        },
        {
            "0": "28.884470294451098",
            "1": "51.220851201511998",
            "city": "اهرم",
            "province": "بوشهر"
        },
        {
            "0": "38.077508384883402",
            "1": "46.351578848389103",
            "city": "صالح آباد",
            "province": "ایلام"
        },
        {
            "0": "34.673041508645298",
            "1": "50.851364269793699",
            "city": "انارستان",
            "province": "بوشهر"
        },
        {
            "0": "32.929095780620798",
            "1": "47.487123261462699",
            "city": "آبدان",
            "province": "بوشهر"
        },
        {
            "0": "28.8249915574197",
            "1": "51.392994160418603",
            "city": "بوشهر",
            "province": "بوشهر"
        },
        {
            "0": "28.968782340408701",
            "1": "51.007055634633502",
            "city": "برازجان",
            "province": "بوشهر"
        },
        {
            "0": "33.245720239337999",
            "1": "46.275936856390203",
            "city": "مهران",
            "province": "ایلام"
        },
        {
            "0": "31.9373293122907",
            "1": "54.366676851216901",
            "city": "امام حسن",
            "province": "بوشهر"
        },
        {
            "0": "32.688654526767003",
            "1": "51.637190385277798",
            "city": "بنک",
            "province": "بوشهر"
        },
        {
            "0": "28.884470294451098",
            "1": "51.220851201511998",
            "city": "چغادک",
            "province": "بوشهر"
        },
        {
            "0": "36.743429718644599",
            "1": "53.879697762101998",
            "city": "بندر دیر",
            "province": "بوشهر"
        },
        {
            "0": "35.739428099999998",
            "1": "51.0083731",
            "city": "تنگ ارم",
            "province": "بوشهر"
        },
        {
            "0": "36.743429718644599",
            "1": "53.879697762101998",
            "city": "بندر گناوه",
            "province": "بوشهر"
        },
        {
            "0": "36.743429718644599",
            "1": "53.879697762101998",
            "city": "بندر دیلم",
            "province": "بوشهر"
        },
        {
            "0": "36.743429718644599",
            "1": "53.879697762101998",
            "city": "بندر ریگ",
            "province": "بوشهر"
        },
        {
            "0": "36.743429718644599",
            "1": "53.879697762101998",
            "city": "بندر کنگان",
            "province": "بوشهر"
        },
        {
            "0": "29.240495733327101",
            "1": "50.311499126757198",
            "city": "خارک",
            "province": "بوشهر"
        },
        {
            "0": "35.719330281555699",
            "1": "51.358939502008802",
            "city": "سیراف",
            "province": "بوشهر"
        },
        {
            "0": "27.439339654134901",
            "1": "52.7017617976609",
            "city": "عسلویه",
            "province": "بوشهر"
        },
        {
            "0": "28.8664251955284",
            "1": "51.041314738170399",
            "city": "دلوار",
            "province": "بوشهر"
        },
        {
            "0": "27.937497456417901",
            "1": "52.237176416938397",
            "city": "جم",
            "province": "بوشهر"
        },
        {
            "0": "37.230355439439698",
            "1": "49.303592847134802",
            "city": "شنبه",
            "province": "بوشهر"
        },
        {
            "0": "29.336844316291302",
            "1": "54.4303075024403",
            "city": "ریز",
            "province": "بوشهر"
        },
        {
            "0": "32.62356506615",
            "1": "51.744256294798198",
            "city": "کلمه",
            "province": "بوشهر"
        },
        {
            "0": "35.760690817209998",
            "1": "52.038729460496903",
            "city": "آبعلی",
            "province": "تهران"
        },
        {
            "0": "35.637366937662001",
            "1": "52.160562818677001",
            "city": "آبسرد",
            "province": "تهران"
        },
        {
            "0": "35.579806137070101",
            "1": "51.2489892635082",
            "city": "اسلامشهر",
            "province": "تهران"
        },
        {
            "0": "35.724702965638897",
            "1": "51.8464437704299",
            "city": "بومهن",
            "province": "تهران"
        },
        {
            "0": "35.720393543994703",
            "1": "51.160848445520799",
            "city": "نخل تقی",
            "province": "بوشهر"
        },
        {
            "0": "35.701346919302097",
            "1": "51.024073744096697",
            "city": "اندیشه",
            "province": "تهران"
        },
        {
            "0": "37.188110247313702",
            "1": "50.138908374707299",
            "city": "ارجمند",
            "province": "تهران"
        },
        {
            "0": "35.551904527595802",
            "1": "51.7252345512848",
            "city": "تهران",
            "province": "تهران"
        },
        {
            "0": "35.694426007256503",
            "1": "51.788043747405098",
            "city": "پردیس",
            "province": "تهران"
        },
        {
            "0": "35.450804198552198",
            "1": "51.779827285413397",
            "city": "پاکدشت",
            "province": "تهران"
        },
        {
            "0": "35.323173718952603",
            "1": "51.750812661909499",
            "city": "پیشوا",
            "province": "تهران"
        },
        {
            "0": "35.217860244702202",
            "1": "51.659439389966401",
            "city": "جوادآباد",
            "province": "تهران"
        },
        {
            "0": "35.877813820701597",
            "1": "50.955927264255301",
            "city": "باغستان",
            "province": "تهران"
        },
        {
            "0": "35.792274305947203",
            "1": "51.430505552310798",
            "city": "تجریش",
            "province": "تهران"
        },
        {
            "0": "35.605644783849002",
            "1": "51.309034258578301",
            "city": "چهاردانگه",
            "province": "تهران"
        },
        {
            "0": "35.805582100000002",
            "1": "51.825662199999996",
            "city": "رودهن",
            "province": "تهران"
        },
        {
            "0": "35.676088930201701",
            "1": "50.841891153959097",
            "city": "صفادشت",
            "province": "تهران"
        },
        {
            "0": "35.496103483906502",
            "1": "51.0523681639446",
            "city": "رباط کریم",
            "province": "تهران"
        },
        {
            "0": "35.598695112159398",
            "1": "51.050768307750502",
            "city": "فردوسیه",
            "province": "تهران"
        },
        {
            "0": "35.623303618478801",
            "1": "52.171697502060297",
            "city": "دماوند",
            "province": "تهران"
        },
        {
            "0": "35.340559873537998",
            "1": "51.271330475803701",
            "city": "ری",
            "province": "تهران"
        },
        {
            "0": "35.603928924202101",
            "1": "52.1964163507322",
            "city": "کهریزک",
            "province": "تهران"
        },
        {
            "0": "35.416716870328202",
            "1": "51.570559752533299",
            "city": "قرچک",
            "province": "تهران"
        },
        {
            "0": "29.578080966218799",
            "1": "52.610255937558698",
            "city": "شریف آباد",
            "province": "تهران"
        },
        {
            "0": "35.845871500000001",
            "1": "51.556548999999997",
            "city": "فشم",
            "province": "تهران"
        },
        {
            "0": "35.476667300000003",
            "1": "52.162448599999998",
            "city": "کیلان",
            "province": "تهران"
        },
        {
            "0": "35.608861357848198",
            "1": "51.0309475784792",
            "city": "شهریار",
            "province": "تهران"
        },
        {
            "0": "35.700701426783198",
            "1": "52.663967844726301",
            "city": "فیروزکوه",
            "province": "تهران"
        },
        {
            "0": "35.518874332230801",
            "1": "51.621235019019501",
            "city": "فرون آباد",
            "province": "تهران"
        },
        {
            "0": "36.607628373620301",
            "1": "49.233626458714603",
            "city": "نصیرآباد",
            "province": "تهران"
        },
        {
            "0": "35.611875433279401",
            "1": "50.694477157165799",
            "city": "ملارد",
            "province": "تهران"
        },
        {
            "0": "35.713837699999999",
            "1": "51.475301199999997",
            "city": "وحیدیه",
            "province": "تهران"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "قدس",
            "province": "تهران"
        },
        {
            "0": "35.854555900000001",
            "1": "51.683687999999997",
            "city": "لواسان",
            "province": "تهران"
        },
        {
            "0": "31.895813734514501",
            "1": "51.179828102718702",
            "city": "آلونی",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "37.318828503073",
            "1": "55.090715716345002",
            "city": "گلستان",
            "province": "تهران"
        },
        {
            "0": "35.132762109249697",
            "1": "51.756833399441803",
            "city": "ورامین",
            "province": "تهران"
        },
        {
            "0": "31.871838473529898",
            "1": "54.3079696888665",
            "city": "نسیم شهر",
            "province": "تهران"
        },
        {
            "0": "32.362825962180203",
            "1": "50.389253760819201",
            "city": "چلگرد",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "32.305174815057498",
            "1": "50.799623275635199",
            "city": "شهرکرد",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "31.865516570898599",
            "1": "51.152129143407798",
            "city": "بروجن",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "36.024437035755099",
            "1": "50.644409952787399",
            "city": "شلمزار",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "32.241103163644901",
            "1": "50.838858224181699",
            "city": "طاقانک",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "32.227116119773498",
            "1": "50.563075223719601",
            "city": "فارسان",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "31.909204777380399",
            "1": "50.457780007202501",
            "city": "اردل",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "31.9710546517111",
            "1": "51.284931463680302",
            "city": "گندمان",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "32.581970255932902",
            "1": "50.648227358864503",
            "city": "بن",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "32.5483546070937",
            "1": "50.8892466867254",
            "city": "سامان",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "31.461044685006499",
            "1": "50.887381099187202",
            "city": "لردگان",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "31.971246141294699",
            "1": "51.287784658597097",
            "city": "ناغان",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "32.2576694243484",
            "1": "50.817056349170002",
            "city": "هفشجان",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "31.367790240880499",
            "1": "48.644437163016597",
            "city": "کیان",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "33.0558009629233",
            "1": "59.2687583916248",
            "city": "بیرجند",
            "province": "خراسان جنوبی"
        },
        {
            "0": "32.119934810818698",
            "1": "50.9827420014417",
            "city": "فرخ شهر",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "32.637987063028099",
            "1": "51.644097739405701",
            "city": "مال خلیفه",
            "province": "چهارمحال بختیاری"
        },
        {
            "0": "34.023402680239101",
            "1": "57.427295824087302",
            "city": "بشرویه",
            "province": "خراسان جنوبی"
        },
        {
            "0": "32.303969684006397",
            "1": "58.684125506032601",
            "city": "خوسف",
            "province": "خراسان جنوبی"
        },
        {
            "0": "34.344384148663501",
            "1": "47.038806309246802",
            "city": "اسلامیه",
            "province": "خراسان جنوبی"
        },
        {
            "0": "33.365383774543901",
            "1": "58.242378016329297",
            "city": "سرایان",
            "province": "خراسان جنوبی"
        },
        {
            "0": "32.441198443441799",
            "1": "60.067697571687297",
            "city": "سربیشه",
            "province": "خراسان جنوبی"
        },
        {
            "0": "29.7153659635268",
            "1": "52.457779913057898",
            "city": "آرین شهر",
            "province": "خراسان جنوبی"
        },
        {
            "0": "32.9060931512522",
            "1": "59.256995820023597",
            "city": "قائن",
            "province": "خراسان جنوبی"
        },
        {
            "0": "32.577387267472801",
            "1": "51.787234606870904",
            "city": "خضری دشت بیاض",
            "province": "خراسان جنوبی"
        },
        {
            "0": "28.2402347564901",
            "1": "56.007751265381899",
            "city": "حاجی آباد",
            "province": "خراسان جنوبی"
        },
        {
            "0": "33.994085377097598",
            "1": "58.016230974412899",
            "city": "فردوس",
            "province": "خراسان جنوبی"
        },
        {
            "0": "33.306436604321497",
            "1": "56.820601035511601",
            "city": "طبس مسینا",
            "province": "خراسان جنوبی"
        },
        {
            "0": "34.1028500238181",
            "1": "49.657684274428199",
            "city": "مود",
            "province": "خراسان جنوبی"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "سه قلعه",
            "province": "خراسان جنوبی"
        },
        {
            "0": "31.4966454065286",
            "1": "59.746179159421402",
            "city": "نهبندان",
            "province": "خراسان جنوبی"
        },
        {
            "0": "35.037761668299801",
            "1": "60.296704751537199",
            "city": "باخرز",
            "province": "خراسان رضوی"
        },
        {
            "0": "37.131475093543202",
            "1": "58.511647908476199",
            "city": "باجگیران",
            "province": "خراسان رضوی"
        },
        {
            "0": "34.603074783054197",
            "1": "58.090700697721402",
            "city": "بجستان",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.309925333150296",
            "1": "59.150208032718801",
            "city": "بایگ",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.698193549999999",
            "1": "51.460556150000002",
            "city": "بیدخت",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.682459051098903",
            "1": "56.989143355948599",
            "city": "جغتای",
            "province": "خراسان رضوی"
        },
        {
            "0": "34.762479213629099",
            "1": "60.699498788014097",
            "city": "تایباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.1737909133264",
            "1": "57.362987051179303",
            "city": "بردسکن",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.250003270393499",
            "1": "59.814294542264399",
            "city": "مشهد",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.251459263630103",
            "1": "59.211609557010902",
            "city": "بار",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.469812119810797",
            "1": "59.119102166119802",
            "city": "تربت حیدریه",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.475826531673",
            "1": "60.739891259293302",
            "city": "تربت جام",
            "province": "خراسان رضوی"
        },
        {
            "0": "34.412030362579699",
            "1": "60.033074675210401",
            "city": "خواف",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.791815235810098",
            "1": "54.113351273995299",
            "city": "جنگل",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.288335544574402",
            "1": "57.070741233743",
            "city": "داورزن",
            "province": "خراسان رضوی"
        },
        {
            "0": "34.829884418383699",
            "1": "59.396246600741797",
            "city": "رشتخوار",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.688997835075",
            "1": "59.051455644396398",
            "city": "چناران",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.944972047203997",
            "1": "50.775024500340798",
            "city": "خرو",
            "province": "خراسان رضوی"
        },
        {
            "0": "37.354871044257898",
            "1": "59.021611854607201",
            "city": "درگز",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.609602808357501",
            "1": "51.500521252075103",
            "city": "رضویه",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.321786267648001",
            "1": "58.467193874299802",
            "city": "ریوش",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.168304465116599",
            "1": "58.187898390801898",
            "city": "خلیل آباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "32.6395852118169",
            "1": "51.703032851325197",
            "city": "روداب",
            "province": "خراسان رضوی"
        },
        {
            "0": "33.4810547919474",
            "1": "48.392154162898102",
            "city": "درود",
            "province": "خراسان رضوی"
        },
        {
            "0": "33.986913968136598",
            "1": "51.451308890440998",
            "city": "رباط سنگ",
            "province": "خراسان رضوی"
        },
        {
            "0": "37.035389407100404",
            "1": "45.084720794253798",
            "city": "سنگان",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.908464862079803",
            "1": "57.5585122773021",
            "city": "سبزوار",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.365517466769901",
            "1": "59.418354357579801",
            "city": "شاندیز",
            "province": "خراسان رضوی"
        },
        {
            "0": "37.795536344128898",
            "1": "48.900842361348097",
            "city": "سلامی",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.7091225784282",
            "1": "51.363494324295502",
            "city": "شادمهر",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.291366780659502",
            "1": "60.781043901638",
            "city": "سرخس",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.317203494487501",
            "1": "59.384997994722802",
            "city": "طرقبه",
            "province": "خراسان رضوی"
        },
        {
            "0": "32.6538016350883",
            "1": "51.743199667824101",
            "city": "سلطان آباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.694132166614096",
            "1": "59.881092649965701",
            "city": "فریمان",
            "province": "خراسان رضوی"
        },
        {
            "0": "29.608918558282301",
            "1": "52.514824258375498",
            "city": "قدمگاه",
            "province": "خراسان رضوی"
        },
        {
            "0": "26.556706708954",
            "1": "53.969480348426799",
            "city": "کاریز",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.587815923847003",
            "1": "59.130749170726702",
            "city": "کدکن",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.315712979364498",
            "1": "58.423232035305503",
            "city": "فیروزه",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.557800153200297",
            "1": "52.326342096790697",
            "city": "عشق آباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.417569857721602",
            "1": "58.493625559066601",
            "city": "کاشمر",
            "province": "خراسان رضوی"
        },
        {
            "0": "31.8574056032394",
            "1": "54.345213677470397",
            "city": "قاسم آباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "37.117722784637003",
            "1": "58.588017862266597",
            "city": "قوچان",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.326217115268499",
            "1": "47.004439355037597",
            "city": "فیض آباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.536709413884701",
            "1": "59.236309374346497",
            "city": "گلمکان",
            "province": "خراسان رضوی"
        },
        {
            "0": "34.730552992652399",
            "1": "60.727159684761297",
            "city": "مشهدریزه",
            "province": "خراسان رضوی"
        },
        {
            "0": "34.376083260899797",
            "1": "58.855232349121799",
            "city": "گناباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.838960304455",
            "1": "51.097340902520401",
            "city": "کندر",
            "province": "خراسان رضوی"
        },
        {
            "0": "35.729638401000997",
            "1": "51.461491647103699",
            "city": "نقاب",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.830447133298598",
            "1": "59.917753393247096",
            "city": "کلات",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.9548006060338",
            "1": "57.554586947895601",
            "city": "اسفراین",
            "province": "خراسان شمالی"
        },
        {
            "0": "34.323631381640901",
            "1": "47.090422641715598",
            "city": "لطف آباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.301400461959901",
            "1": "59.561502985047497",
            "city": "ملک آباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "38.2639433133278",
            "1": "48.3085047141793",
            "city": "یونسی",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.967582299999997",
            "1": "56.230811500000002",
            "city": "ایور",
            "province": "خراسان شمالی"
        },
        {
            "0": "32.625898096185502",
            "1": "51.7006706711893",
            "city": "همت آباد",
            "province": "خراسان رضوی"
        },
        {
            "0": "36.1676948249427",
            "1": "58.676098797692902",
            "city": "نیشابور",
            "province": "خراسان رضوی"
        },
        {
            "0": "37.555706056036399",
            "1": "57.342857082282499",
            "city": "بجنورد",
            "province": "خراسان شمالی"
        },
        {
            "0": "37.006113361527198",
            "1": "56.539433712955898",
            "city": "سنخواست",
            "province": "خراسان شمالی"
        },
        {
            "0": "35.762453100000002",
            "1": "51.370012600000003",
            "city": "نیل شهر",
            "province": "خراسان رضوی"
        },
        {
            "0": "37.192559134094701",
            "1": "58.1678600981325",
            "city": "فاروج",
            "province": "خراسان شمالی"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "پیش قلعه",
            "province": "خراسان شمالی"
        },
        {
            "0": "37.029112844875499",
            "1": "56.666729676972402",
            "city": "جاجرم",
            "province": "خراسان شمالی"
        },
        {
            "0": "29.575146799999999",
            "1": "52.515826099999998",
            "city": "راز",
            "province": "خراسان شمالی"
        },
        {
            "0": "37.544249241038401",
            "1": "57.891903153633002",
            "city": "شیروان",
            "province": "خراسان شمالی"
        },
        {
            "0": "36.969321322526703",
            "1": "56.220070399768098",
            "city": "درق",
            "province": "خراسان شمالی"
        },
        {
            "0": "32.2925191",
            "1": "48.434215500000001",
            "city": "صفی آباد",
            "province": "خراسان شمالی"
        },
        {
            "0": "38.026577904370498",
            "1": "46.157691081207197",
            "city": "قاضی",
            "province": "خراسان شمالی"
        },
        {
            "0": "30.2274179410283",
            "1": "48.418256106685703",
            "city": "اروندکنار",
            "province": "خوزستان"
        },
        {
            "0": "37.151735757543797",
            "1": "56.235998575189797",
            "city": "گرمه",
            "province": "خراسان شمالی"
        },
        {
            "0": "36.265823621638397",
            "1": "50.001960640415497",
            "city": "الوان",
            "province": "خوزستان"
        },
        {
            "0": "31.873249540387",
            "1": "49.971573376317401",
            "city": "ایذه",
            "province": "خوزستان"
        },
        {
            "0": "30.7936959831002",
            "1": "49.924732670904802",
            "city": "آغاجاری",
            "province": "خوزستان"
        },
        {
            "0": "30.769336541793699",
            "1": "49.708318375315997",
            "city": "امیدیه",
            "province": "خوزستان"
        },
        {
            "0": "31.218830406250301",
            "1": "48.685893292158603",
            "city": "اهواز",
            "province": "خوزستان"
        },
        {
            "0": "30.181592919101799",
            "1": "48.611484755674198",
            "city": "آبادان",
            "province": "خوزستان"
        },
        {
            "0": "32.696074031726603",
            "1": "48.3289613387009",
            "city": "اندیمشک",
            "province": "خوزستان"
        },
        {
            "0": "31.484101523894001",
            "1": "49.904433591057703",
            "city": "باغ ملک",
            "province": "خوزستان"
        },
        {
            "0": "37.803203308495299",
            "1": "46.813094973560801",
            "city": "بستان",
            "province": "خوزستان"
        },
        {
            "0": "30.5275438951406",
            "1": "50.209192496603997",
            "city": "بهبهان",
            "province": "خوزستان"
        },
        {
            "0": "30.807575845728",
            "1": "49.058850127081797",
            "city": "بندر امام خمینی",
            "province": "خوزستان"
        },
        {
            "0": "30.512611759626999",
            "1": "49.211629552821201",
            "city": "بندر ماهشهر",
            "province": "خوزستان"
        },
        {
            "0": "30.040266042135801",
            "1": "48.533126533828899",
            "city": "چوئبده",
            "province": "خوزستان"
        },
        {
            "0": "36.274644250533001",
            "1": "59.600549769568303",
            "city": "دارخوین",
            "province": "خوزستان"
        },
        {
            "0": "31.4906820382256",
            "1": "48.4492396925395",
            "city": "حمیدیه",
            "province": "خوزستان"
        },
        {
            "0": "35.700562529212299",
            "1": "51.260704070418299",
            "city": "جنت مکان",
            "province": "خوزستان"
        },
        {
            "0": "36.946565662633297",
            "1": "56.375273892208398",
            "city": "چمران",
            "province": "خوزستان"
        },
        {
            "0": "36.457816423767397",
            "1": "52.341008384825201",
            "city": "حر",
            "province": "خوزستان"
        },
        {
            "0": "35.750359394494403",
            "1": "51.470631415878401",
            "city": "حمزه",
            "province": "خوزستان"
        },
        {
            "0": "36.2683797427892",
            "1": "59.589347491843498",
            "city": "حسینیه",
            "province": "خوزستان"
        },
        {
            "0": "31.215329091919902",
            "1": "49.662139243905798",
            "city": "رامهرمز",
            "province": "خوزستان"
        },
        {
            "0": "30.943820473427699",
            "1": "49.394276410060201",
            "city": "رامشیر",
            "province": "خوزستان"
        },
        {
            "0": "30.685274512205002",
            "1": "48.2139464205097",
            "city": "خرمشهر",
            "province": "خوزستان"
        },
        {
            "0": "32.428117186540099",
            "1": "48.529927600055601",
            "city": "سالند",
            "province": "خوزستان"
        },
        {
            "0": "35.566680442769098",
            "1": "51.255339730570498",
            "city": "سوسنگرد",
            "province": "خوزستان"
        },
        {
            "0": "30.643021567326201",
            "1": "48.681160262900697",
            "city": "شادگان",
            "province": "خوزستان"
        },
        {
            "0": "32.572739632257097",
            "1": "48.840230290512302",
            "city": "دزفول",
            "province": "خوزستان"
        },
        {
            "0": "36.826196000000003",
            "1": "54.4396597",
            "city": "رفیع",
            "province": "خوزستان"
        },
        {
            "0": "32.476528614429903",
            "1": "51.764637132993599",
            "city": "زهره",
            "province": "خوزستان"
        },
        {
            "0": "31.884207497460299",
            "1": "48.877717281119203",
            "city": "شوشتر",
            "province": "خوزستان"
        },
        {
            "0": "32.909665403130397",
            "1": "59.233361567004302",
            "city": "شرافت",
            "province": "خوزستان"
        },
        {
            "0": "29.617642413846198",
            "1": "52.541395267628403",
            "city": "شیبان",
            "province": "خوزستان"
        },
        {
            "0": "32.030760093532798",
            "1": "48.222735819274",
            "city": "شوش",
            "province": "خوزستان"
        },
        {
            "0": "32.236280847900801",
            "1": "48.818556048970201",
            "city": "گتوند",
            "province": "خوزستان"
        },
        {
            "0": "34.578916016292403",
            "1": "50.823113159008798",
            "city": "صالح شهر",
            "province": "خوزستان"
        },
        {
            "0": "29.579676200000002",
            "1": "52.489138099999998",
            "city": "صالح مشطط",
            "province": "خوزستان"
        },
        {
            "0": "32.425089078599598",
            "1": "49.172400552039001",
            "city": "لالی",
            "province": "خوزستان"
        },
        {
            "0": "35.806134911596999",
            "1": "51.507382991323901",
            "city": "مسجدسلیمان",
            "province": "خوزستان"
        },
        {
            "0": "31.628367594157201",
            "1": "48.923724292267899",
            "city": "ملاثانی",
            "province": "خوزستان"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "قلعه تل",
            "province": "خوزستان"
        },
        {
            "0": "36.5434579",
            "1": "53.054702300000002",
            "city": "میانرود",
            "province": "خوزستان"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "قلعه خواجه",
            "province": "خوزستان"
        },
        {
            "0": "31.535380017619001",
            "1": "49.403813412668804",
            "city": "هفتگل",
            "province": "خوزستان"
        },
        {
            "0": "30.311199006151401",
            "1": "49.735430008286599",
            "city": "هندیجان",
            "province": "خوزستان"
        },
        {
            "0": "36.813190669951403",
            "1": "48.590766080660302",
            "city": "چورزق",
            "province": "زنجان"
        },
        {
            "0": "32.687742707226597",
            "1": "51.685818555159003",
            "city": "ویس",
            "province": "خوزستان"
        },
        {
            "0": "34.115072625379",
            "1": "49.7022031340694",
            "city": "مقاومت",
            "province": "خوزستان"
        },
        {
            "0": "37.1057982322315",
            "1": "58.510100798862503",
            "city": "حلب",
            "province": "زنجان"
        },
        {
            "0": "36.268915152789397",
            "1": "49.151321776987899",
            "city": "خرمدره",
            "province": "زنجان"
        },
        {
            "0": "36.634905549507302",
            "1": "48.406726873499899",
            "city": "دندی",
            "province": "زنجان"
        },
        {
            "0": "36.0990284759093",
            "1": "49.185497050396897",
            "city": "ابهر",
            "province": "زنجان"
        },
        {
            "0": "31.275860093020899",
            "1": "47.913290590593803",
            "city": "هویزه",
            "province": "خوزستان"
        },
        {
            "0": "36.440894073296199",
            "1": "48.8916250874883",
            "city": "سلطانیه",
            "province": "زنجان"
        },
        {
            "0": "36.846427917326302",
            "1": "48.219714104043902",
            "city": "زنجان",
            "province": "زنجان"
        },
        {
            "0": "37.183178992109497",
            "1": "49.530579021265403",
            "city": "آب بر",
            "province": "زنجان"
        },
        {
            "0": "35.956930219724299",
            "1": "47.847773192467002",
            "city": "قیدار",
            "province": "زنجان"
        },
        {
            "0": "36.142228274333803",
            "1": "49.226668987093298",
            "city": "هیدج",
            "province": "زنجان"
        },
        {
            "0": "32.373013002429701",
            "1": "51.366737670497699",
            "city": "زرین رود",
            "province": "زنجان"
        },
        {
            "0": "33.208070388982598",
            "1": "46.922181479903699",
            "city": "زرین آباد",
            "province": "زنجان"
        },
        {
            "0": "35.887578209375697",
            "1": "48.162420141332902",
            "city": "گرماب",
            "province": "زنجان"
        },
        {
            "0": "35.721110711804897",
            "1": "51.434569222222798",
            "city": "سهرورد",
            "province": "زنجان"
        },
        {
            "0": "35.476667300000003",
            "1": "52.162448599999998",
            "city": "ایوانکی",
            "province": "سمنان"
        },
        {
            "0": "34.901161128949603",
            "1": "52.640757268024601",
            "city": "آرادان",
            "province": "سمنان"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "صائین قلعه",
            "province": "زنجان"
        },
        {
            "0": "35.424796420725798",
            "1": "54.672255062842297",
            "city": "سمنان",
            "province": "سمنان"
        },
        {
            "0": "36.646275299798802",
            "1": "47.582069968328597",
            "city": "ماه نشان",
            "province": "زنجان"
        },
        {
            "0": "37.069616302193701",
            "1": "54.879637686965602",
            "city": "بسطام",
            "province": "سمنان"
        },
        {
            "0": "35.560273683141602",
            "1": "54.349847443680702",
            "city": "دامغان",
            "province": "سمنان"
        },
        {
            "0": "32.610649432731201",
            "1": "51.605041755924901",
            "city": "امیریه",
            "province": "سمنان"
        },
        {
            "0": "35.753058063871997",
            "1": "51.447205244844803",
            "city": "دیباج",
            "province": "سمنان"
        },
        {
            "0": "35.945468667962103",
            "1": "53.425921046571098",
            "city": "شهمیرزاد",
            "province": "سمنان"
        },
        {
            "0": "34.912600480939098",
            "1": "53.1577600544842",
            "city": "سرخه",
            "province": "سمنان"
        },
        {
            "0": "34.945266266288598",
            "1": "52.174272718629403",
            "city": "گرمسار",
            "province": "سمنان"
        },
        {
            "0": "35.6652620690502",
            "1": "51.230234019899498",
            "city": "مجن",
            "province": "سمنان"
        },
        {
            "0": "36.988003314422599",
            "1": "56.396696946682702",
            "city": "کلاته خیج",
            "province": "سمنان"
        },
        {
            "0": "29.634617973889199",
            "1": "60.191154579029501",
            "city": "زاهدان",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "35.439028519146802",
            "1": "55.6094937665194",
            "city": "شاهرود",
            "province": "سمنان"
        },
        {
            "0": "36.6223419733697",
            "1": "56.055874817112098",
            "city": "میامی",
            "province": "سمنان"
        },
        {
            "0": "27.7347454246441",
            "1": "60.1381478349509",
            "city": "ایرانشهر",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "35.738835727378003",
            "1": "53.325290036694497",
            "city": "مهدی شهر",
            "province": "سمنان"
        },
        {
            "0": "34.325616400000001",
            "1": "47.080248599999997",
            "city": "بنت",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "25.2969510216628",
            "1": "60.660778441577001",
            "city": "راسک",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "28.184775032892301",
            "1": "61.252649587318501",
            "city": "خاش",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "30.8189628088615",
            "1": "61.640587842208298",
            "city": "زهک",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "36.474704199999998",
            "1": "50.417501399999999",
            "city": "زرآباد",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "35.680911620705302",
            "1": "51.359452232651499",
            "city": "زابلی",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "27.352164229296299",
            "1": "62.560721551672302",
            "city": "سراوان",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "30.8361667810819",
            "1": "60.920794110369201",
            "city": "زابل",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "27.316869117876202",
            "1": "61.871376508073403",
            "city": "سوران",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "26.075804984808499",
            "1": "60.831160830915699",
            "city": "قصرقند",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "26.712299667088601",
            "1": "59.542230487156097",
            "city": "فنوج",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "25.665164530294401",
            "1": "59.902319682662402",
            "city": "کنارک",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "27.1892920617139",
            "1": "56.2453899582584",
            "city": "دوست محمد",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "26.449638885826499",
            "1": "61.409259703883102",
            "city": "سرباز",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "28.846667771706901",
            "1": "61.327855018478402",
            "city": "میرجاوه",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "31.3878327274833",
            "1": "48.692647762219401",
            "city": "علی اکبر",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "35.780031149999999",
            "1": "51.424803850000004",
            "city": "گشت",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "29.832754663131698",
            "1": "53.387496865527503",
            "city": "ارسنجان",
            "province": "فارس"
        },
        {
            "0": "35.644198668688901",
            "1": "51.347852759072197",
            "city": "محمدی",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "31.8867573868664",
            "1": "54.342955888259702",
            "city": "چاه بهار",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "29.482304659049401",
            "1": "60.8143801571821",
            "city": "نصرت آباد",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "35.633504090498803",
            "1": "51.311647921747898",
            "city": "نوک آباد",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "29.145083483199599",
            "1": "54.004161419409897",
            "city": "استهبان",
            "province": "فارس"
        },
        {
            "0": "26.393384605760399",
            "1": "59.913804992818797",
            "city": "نیک شهر",
            "province": "سیستان و بلوچستان"
        },
        {
            "0": "30.722268236512701",
            "1": "52.397899653701302",
            "city": "اقلید",
            "province": "فارس"
        },
        {
            "0": "29.600667074212399",
            "1": "52.433358300601398",
            "city": "شیراز",
            "province": "فارس"
        },
        {
            "0": "36.8387757536103",
            "1": "54.4803951260471",
            "city": "اوز",
            "province": "فارس"
        },
        {
            "0": "32.605173488115902",
            "1": "54.767440695799998",
            "city": "اردکان",
            "province": "فارس"
        },
        {
            "0": "31.2607128111047",
            "1": "52.510135867500999",
            "city": "آباده",
            "province": "فارس"
        },
        {
            "0": "29.776183169707199",
            "1": "52.548665115869198",
            "city": "اهل",
            "province": "فارس"
        },
        {
            "0": "36.344694377045101",
            "1": "48.198654893551897",
            "city": "ایج",
            "province": "فارس"
        },
        {
            "0": "29.750174302766698",
            "1": "54.250394552908602",
            "city": "آباده طشک",
            "province": "فارس"
        },
        {
            "0": "30.303325945181498",
            "1": "53.665996049646502",
            "city": "بوانات",
            "province": "فارس"
        },
        {
            "0": "30.270469447322402",
            "1": "57.122950361068298",
            "city": "بیرم",
            "province": "فارس"
        },
        {
            "0": "31.901496095034499",
            "1": "54.3236675590922",
            "city": "امام شهر",
            "province": "فارس"
        },
        {
            "0": "38.245569043412701",
            "1": "48.289116249917697",
            "city": "بیضا",
            "province": "فارس"
        },
        {
            "0": "35.701278926394899",
            "1": "51.364418501884103",
            "city": "حسامی",
            "province": "فارس"
        },
        {
            "0": "30.591671804320601",
            "1": "55.538817505722598",
            "city": "باب انار",
            "province": "فارس"
        },
        {
            "0": "29.501304059933801",
            "1": "53.263290242913897",
            "city": "خرامه",
            "province": "فارس"
        },
        {
            "0": "36.343956354339703",
            "1": "59.620645954681599",
            "city": "بهمن",
            "province": "فارس"
        },
        {
            "0": "27.968506727487998",
            "1": "53.064581037583402",
            "city": "خنج",
            "province": "فارس"
        },
        {
            "0": "35.665653676987603",
            "1": "51.453103948079097",
            "city": "خاوران",
            "province": "فارس"
        },
        {
            "0": "28.6968517734763",
            "1": "53.352628101086303",
            "city": "جهرم",
            "province": "فارس"
        },
        {
            "0": "35.786683199999999",
            "1": "51.3095997",
            "city": "خشت",
            "province": "فارس"
        },
        {
            "0": "35.773483255353",
            "1": "51.307307841873602",
            "city": "جنت شهر",
            "province": "فارس"
        },
        {
            "0": "32.644835479445398",
            "1": "51.674405806314198",
            "city": "خانه زنیان",
            "province": "فارس"
        },
        {
            "0": "34.663981438120302",
            "1": "50.896460941421203",
            "city": "دبیران",
            "province": "فارس"
        },
        {
            "0": "35.713016169500499",
            "1": "51.3593712347081",
            "city": "داریان",
            "province": "فارس"
        },
        {
            "0": "29.761555363991",
            "1": "52.719940117118803",
            "city": "زرقان",
            "province": "فارس"
        },
        {
            "0": "35.303513383105503",
            "1": "46.989465329998502",
            "city": "خومه زار",
            "province": "فارس"
        },
        {
            "0": "34.780760367153597",
            "1": "48.498413267572701",
            "city": "ششده",
            "province": "فارس"
        },
        {
            "0": "31.772304463240001",
            "1": "54.287243397056301",
            "city": "سورمق",
            "province": "فارس"
        },
        {
            "0": "34.635891290863",
            "1": "50.8895359332965",
            "city": "سیدان",
            "province": "فارس"
        },
        {
            "0": "28.529856308129499",
            "1": "54.897567619616602",
            "city": "داراب",
            "province": "فارس"
        },
        {
            "0": "30.339587314480202",
            "1": "48.310523917827403",
            "city": "سده",
            "province": "فارس"
        },
        {
            "0": "34.607352458276999",
            "1": "50.843905950998199",
            "city": "صفاشهر",
            "province": "فارس"
        },
        {
            "0": "28.623876301180999",
            "1": "52.208198801693001",
            "city": "فراشبند",
            "province": "فارس"
        },
        {
            "0": "29.233611194752701",
            "1": "53.114751947738299",
            "city": "سروستان",
            "province": "فارس"
        },
        {
            "0": "30.020303682928098",
            "1": "53.180723005217999",
            "city": "سعادت شهر",
            "province": "فارس"
        },
        {
            "0": "28.8981268690818",
            "1": "52.561470662992598",
            "city": "فیروزآباد",
            "province": "فارس"
        },
        {
            "0": "32.860647186106803",
            "1": "51.553004714741903",
            "city": "شهر جدید صدرا",
            "province": "فارس"
        },
        {
            "0": "32.716815328706303",
            "1": "47.313132008497497",
            "city": "قیر",
            "province": "فارس"
        },
        {
            "0": "32.6286062404264",
            "1": "51.589645360408397",
            "city": "قائمیه",
            "province": "فارس"
        },
        {
            "0": "28.948811000890998",
            "1": "53.785483467217503",
            "city": "فسا",
            "province": "فارس"
        },
        {
            "0": "29.521002690940399",
            "1": "51.713112446213302",
            "city": "کازرون",
            "province": "فارس"
        },
        {
            "0": "32.647334131743897",
            "1": "51.6412680911723",
            "city": "کوهنجان",
            "province": "فارس"
        },
        {
            "0": "27.650105169606402",
            "1": "53.702959055496898",
            "city": "گراش",
            "province": "فارس"
        },
        {
            "0": "29.220425525649699",
            "1": "52.7170327553848",
            "city": "کوار",
            "province": "فارس"
        },
        {
            "0": "28.6446998307756",
            "1": "53.643713188917303",
            "city": "قطب آباد",
            "province": "فارس"
        },
        {
            "0": "27.405362468950901",
            "1": "53.3469599478234",
            "city": "لامرد",
            "province": "فارس"
        },
        {
            "0": "35.636682359085498",
            "1": "51.493658502253901",
            "city": "مصیری",
            "province": "فارس"
        },
        {
            "0": "32.651667164189099",
            "1": "51.363129905315098",
            "city": "گله دار",
            "province": "فارس"
        },
        {
            "0": "29.674957214184399",
            "1": "54.3377442383755",
            "city": "مشکان",
            "province": "فارس"
        },
        {
            "0": "30.100719156821999",
            "1": "52.645749027939303",
            "city": "مرودشت",
            "province": "فارس"
        },
        {
            "0": "35.474537499999997",
            "1": "51.663169000000003",
            "city": "لار",
            "province": "فارس"
        },
        {
            "0": "36.2689385524518",
            "1": "50.0061006819531",
            "city": "کره ای",
            "province": "فارس"
        },
        {
            "0": "35.637175444319297",
            "1": "51.390115572709497",
            "city": "لطیفی",
            "province": "فارس"
        },
        {
            "0": "35.713657523802297",
            "1": "50.912211580676399",
            "city": "نوبندگان",
            "province": "فارس"
        },
        {
            "0": "35.768944922351899",
            "1": "51.483183717313104",
            "city": "مبارک آباد",
            "province": "فارس"
        },
        {
            "0": "34.043062200000001",
            "1": "48.3128782",
            "city": "نورآباد",
            "province": "فارس"
        },
        {
            "0": "35.722163183196201",
            "1": "51.4309677152836",
            "city": "وراوی",
            "province": "فارس"
        },
        {
            "0": "36.082663560539402",
            "1": "49.946934559231401",
            "city": "ارداق",
            "province": "قزوین"
        },
        {
            "0": "27.633588018384",
            "1": "52.7642227163443",
            "city": "مهر",
            "province": "فارس"
        },
        {
            "0": "36.137587762627199",
            "1": "49.786574072208197",
            "city": "اقبالیه",
            "province": "قزوین"
        },
        {
            "0": "35.9049092893747",
            "1": "52.208256352587497",
            "city": "آبگرم",
            "province": "قزوین"
        },
        {
            "0": "36.086655379696303",
            "1": "50.347274927700703",
            "city": "آبیک",
            "province": "قزوین"
        },
        {
            "0": "36.298272709606202",
            "1": "50.014020259513998",
            "city": "خاکعلی",
            "province": "قزوین"
        },
        {
            "0": "35.846949690925598",
            "1": "50.994184048017402",
            "city": "آوج",
            "province": "قزوین"
        },
        {
            "0": "35.586727946616698",
            "1": "51.258073019089302",
            "city": "بیدستان",
            "province": "قزوین"
        },
        {
            "0": "29.336844316291302",
            "1": "54.4303075024403",
            "city": "نی ریز",
            "province": "فارس"
        },
        {
            "0": "35.953535543018504",
            "1": "49.489567159050203",
            "city": "خرمدشت",
            "province": "قزوین"
        },
        {
            "0": "36.089875351724601",
            "1": "49.7665805921052",
            "city": "قزوین",
            "province": "قزوین"
        },
        {
            "0": "36.523377345071701",
            "1": "50.232187231240601",
            "city": "رازمیان",
            "province": "قزوین"
        },
        {
            "0": "34.820110570589698",
            "1": "48.475027021287403",
            "city": "الوند",
            "province": "قزوین"
        },
        {
            "0": "36.012772549747197",
            "1": "49.542880122893799",
            "city": "تاکستان",
            "province": "قزوین"
        },
        {
            "0": "35.734892058368303",
            "1": "49.6103195732491",
            "city": "بوئین زهرا",
            "province": "قزوین"
        },
        {
            "0": "35.953535543018504",
            "1": "49.489567159050203",
            "city": "ضیاءآباد",
            "province": "قزوین"
        },
        {
            "0": "35.677919205026903",
            "1": "51.405721603632102",
            "city": "کوهین",
            "province": "قزوین"
        },
        {
            "0": "36.666318050532801",
            "1": "49.2105392079078",
            "city": "سیردان",
            "province": "قزوین"
        },
        {
            "0": "34.952381953751697",
            "1": "50.423390118875702",
            "city": "سلفچگان",
            "province": "قم"
        },
        {
            "0": "32.240053570917702",
            "1": "52.652201221237299",
            "city": "دستجرد",
            "province": "قم"
        },
        {
            "0": "35.675868276543703",
            "1": "51.441048726816803",
            "city": "شال",
            "province": "قزوین"
        },
        {
            "0": "30.553922650000001",
            "1": "49.195151099999997",
            "city": "قنوات",
            "province": "قم"
        },
        {
            "0": "29.6129632796526",
            "1": "52.438938610611402",
            "city": "محمدیه",
            "province": "قزوین"
        },
        {
            "0": "35.6643348014222",
            "1": "50.997277034608203",
            "city": "جعفریه",
            "province": "قم"
        },
        {
            "0": "35.3015539797439",
            "1": "51.712925910735301",
            "city": "کهک",
            "province": "قم"
        },
        {
            "0": "36.523377345071701",
            "1": "50.232187231240601",
            "city": "معلم کلایه",
            "province": "قزوین"
        },
        {
            "0": "34.695388533144502",
            "1": "51.0264227073176",
            "city": "قم",
            "province": "قم"
        },
        {
            "0": "35.996036451755998",
            "1": "45.848957569773603",
            "city": "بانه",
            "province": "کردستان"
        },
        {
            "0": "35.336257474879197",
            "1": "47.357060309279298",
            "city": "دهگلان",
            "province": "کردستان"
        },
        {
            "0": "34.770511652458701",
            "1": "48.516055459466997",
            "city": "دلبران",
            "province": "کردستان"
        },
        {
            "0": "35.353373768704301",
            "1": "46.887422096136198",
            "city": "سنندج",
            "province": "کردستان"
        },
        {
            "0": "33.156538510010101",
            "1": "50.089558958258003",
            "city": "بوئین سفلی",
            "province": "کردستان"
        },
        {
            "0": "35.944518576422901",
            "1": "47.6468133181124",
            "city": "بیجار",
            "province": "کردستان"
        },
        {
            "0": "35.633504090498803",
            "1": "51.311647921747898",
            "city": "بلبان آباد",
            "province": "کردستان"
        },
        {
            "0": "35.230208013939802",
            "1": "46.400547405426003",
            "city": "سروآباد",
            "province": "کردستان"
        },
        {
            "0": "37.946923010716198",
            "1": "45.990194103301903",
            "city": "زرینه",
            "province": "کردستان"
        },
        {
            "0": "35.925915126408803",
            "1": "46.975725215880601",
            "city": "دیواندره",
            "province": "کردستان"
        },
        {
            "0": "36.156413938858996",
            "1": "46.3785628724318",
            "city": "سقز",
            "province": "کردستان"
        },
        {
            "0": "35.229385110257297",
            "1": "47.826159269743201",
            "city": "قروه",
            "province": "کردستان"
        },
        {
            "0": "34.955923791614303",
            "1": "46.914433938352502",
            "city": "کامیاران",
            "province": "کردستان"
        },
        {
            "0": "36.249262501947698",
            "1": "47.7865153522743",
            "city": "یاسوکند",
            "province": "کردستان"
        },
        {
            "0": "35.316011340392997",
            "1": "47.022143019875799",
            "city": "کانی دینار",
            "province": "کردستان"
        },
        {
            "0": "35.572223325966497",
            "1": "46.354618333465503",
            "city": "مریوان",
            "province": "کردستان"
        },
        {
            "0": "35.229181107977404",
            "1": "47.785456389842999",
            "city": "سریش آباد",
            "province": "کردستان"
        },
        {
            "0": "36.3069654822066",
            "1": "59.6513758510375",
            "city": "صاحب",
            "province": "کردستان"
        },
        {
            "0": "28.430591361301701",
            "1": "56.532237074259299",
            "city": "ارزوئیه",
            "province": "کرمان"
        },
        {
            "0": "35.316011340392997",
            "1": "47.022143019875799",
            "city": "کانی سور",
            "province": "کردستان"
        },
        {
            "0": "29.7737627255148",
            "1": "56.693154712397003",
            "city": "بردسیر",
            "province": "کرمان"
        },
        {
            "0": "30.305968496023201",
            "1": "56.291369408719397",
            "city": "باغین",
            "province": "کرمان"
        },
        {
            "0": "29.012717343721501",
            "1": "56.491276943010398",
            "city": "بافت",
            "province": "کرمان"
        },
        {
            "0": "38.075005500477701",
            "1": "46.295506170933102",
            "city": "بهرمان",
            "province": "کرمان"
        },
        {
            "0": "31.871838473529898",
            "1": "54.3079696888665",
            "city": "امین شهر",
            "province": "کرمان"
        },
        {
            "0": "30.094968016801602",
            "1": "57.02780791472",
            "city": "جوپار",
            "province": "کرمان"
        },
        {
            "0": "30.3025927710977",
            "1": "57.090513921558802",
            "city": "پاریز",
            "province": "کرمان"
        },
        {
            "0": "30.8339730903892",
            "1": "55.290924322653098",
            "city": "انار",
            "province": "کرمان"
        },
        {
            "0": "29.614529285139501",
            "1": "57.296329377407297",
            "city": "کرمان",
            "province": "کرمان"
        },
        {
            "0": "29.115836224659901",
            "1": "58.198511746674598",
            "city": "بم",
            "province": "کرمان"
        },
        {
            "0": "30.315261799999998",
            "1": "57.077160800000001",
            "city": "خانوک",
            "province": "کرمان"
        },
        {
            "0": "28.778532269532999",
            "1": "57.494950657940798",
            "city": "جیرفت",
            "province": "کرمان"
        },
        {
            "0": "29.234072364188201",
            "1": "56.988245975092802",
            "city": "رابر",
            "province": "کرمان"
        },
        {
            "0": "28.841740119234601",
            "1": "57.727114398532798",
            "city": "راین",
            "province": "کرمان"
        },
        {
            "0": "31.321673840179901",
            "1": "57.152348921574799",
            "city": "راور",
            "province": "کرمان"
        },
        {
            "0": "32.660302970964999",
            "1": "51.788080667679402",
            "city": "خاتون آباد",
            "province": "کرمان"
        },
        {
            "0": "33.9964609430832",
            "1": "51.426091720656999",
            "city": "زیدآباد",
            "province": "کرمان"
        },
        {
            "0": "33.908238619579699",
            "1": "48.732238522471803",
            "city": "درب بهشت",
            "province": "کرمان"
        },
        {
            "0": "36.798154810871701",
            "1": "49.6185652855143",
            "city": "رودبار",
            "province": "کرمان"
        },
        {
            "0": "30.941134402652299",
            "1": "56.288113304433999",
            "city": "زرند",
            "province": "کرمان"
        },
        {
            "0": "31.871838473529898",
            "1": "54.3079696888665",
            "city": "ریحان شهر",
            "province": "کرمان"
        },
        {
            "0": "35.826620599999998",
            "1": "50.988713250000004",
            "city": "شهداد",
            "province": "کرمان"
        },
        {
            "0": "30.541989616477299",
            "1": "55.895431815315497",
            "city": "رفسنجان",
            "province": "کرمان"
        },
        {
            "0": "30.317020838007799",
            "1": "57.028039990414797",
            "city": "زنگی آباد",
            "province": "کرمان"
        },
        {
            "0": "29.096302964498101",
            "1": "59.178671154865398",
            "city": "فهرج",
            "province": "کرمان"
        },
        {
            "0": "30.238324173740899",
            "1": "54.989345967021301",
            "city": "شهربابک",
            "province": "کرمان"
        },
        {
            "0": "28.404973434320802",
            "1": "58.144205887530703",
            "city": "عنبرآباد",
            "province": "کرمان"
        },
        {
            "0": "28.160982278608799",
            "1": "57.250666880699399",
            "city": "فاریاب",
            "province": "کرمان"
        },
        {
            "0": "32.675341373690799",
            "1": "51.680579484539201",
            "city": "سرچشمه",
            "province": "کرمان"
        },
        {
            "0": "31.8396991612458",
            "1": "54.378770860653603",
            "city": "صفائیه",
            "province": "کرمان"
        },
        {
            "0": "29.576343107401598",
            "1": "55.779267391929203",
            "city": "سیرجان",
            "province": "کرمان"
        },
        {
            "0": "27.8466964658774",
            "1": "57.636365591866401",
            "city": "کهنوج",
            "province": "کرمان"
        },
        {
            "0": "31.3822868168591",
            "1": "56.282772849725497",
            "city": "کوهبنان",
            "province": "کرمان"
        },
        {
            "0": "35.634858445551899",
            "1": "51.449581709247497",
            "city": "کیانشهر",
            "province": "کرمان"
        },
        {
            "0": "31.9343243759822",
            "1": "54.323657799025298",
            "city": "گلباف",
            "province": "کرمان"
        },
        {
            "0": "27.1696340355412",
            "1": "58.399100096913202",
            "city": "قلعه گنج",
            "province": "کرمان"
        },
        {
            "0": "32.658268740807799",
            "1": "51.697359083817098",
            "city": "گلزار",
            "province": "کرمان"
        },
        {
            "0": "27.3254126631548",
            "1": "57.671212436529203",
            "city": "منوجان",
            "province": "کرمان"
        },
        {
            "0": "35.7502371918157",
            "1": "51.468800045921697",
            "city": "کاظم آباد",
            "province": "کرمان"
        },
        {
            "0": "35.640197242952397",
            "1": "51.3684805461235",
            "city": "ماهان",
            "province": "کرمان"
        },
        {
            "0": "38.060698443878998",
            "1": "46.276789482266203",
            "city": "لاله زار",
            "province": "کرمان"
        },
        {
            "0": "29.260180234623199",
            "1": "58.754135652932298",
            "city": "نرماشیر",
            "province": "کرمان"
        },
        {
            "0": "35.633504090498803",
            "1": "51.311647921747898",
            "city": "محی آباد",
            "province": "کرمان"
        },
        {
            "0": "29.332666246619901",
            "1": "55.777389855827899",
            "city": "نجف شهر",
            "province": "کرمان"
        },
        {
            "0": "31.3516139438231",
            "1": "48.737507900392799",
            "city": "نظام شهر",
            "province": "کرمان"
        },
        {
            "0": "35.816240986813703",
            "1": "51.602308452469799",
            "city": "نگار",
            "province": "کرمان"
        },
        {
            "0": "34.852806587228599",
            "1": "46.283283658022199",
            "city": "جوانرود",
            "province": "کرمانشاه"
        },
        {
            "0": "35.0631679597954",
            "1": "46.258111610364601",
            "city": "پاوه",
            "province": "کرمانشاه"
        },
        {
            "0": "33.753134699999997",
            "1": "46.681912199999999",
            "city": "حمیل",
            "province": "کرمانشاه"
        },
        {
            "0": "34.297916224290198",
            "1": "47.013661502571601",
            "city": "کرمانشاه",
            "province": "کرمانشاه"
        },
        {
            "0": "32.698595203528299",
            "1": "51.494925771043",
            "city": "یزدان شهر",
            "province": "کرمان"
        },
        {
            "0": "32.698405865401703",
            "1": "51.533278131262101",
            "city": "سرمست",
            "province": "کرمانشاه"
        },
        {
            "0": "34.540009875880699",
            "1": "45.885861765595699",
            "city": "سرپل ذهاب",
            "province": "کرمانشاه"
        },
        {
            "0": "34.739704394947097",
            "1": "46.589685061366197",
            "city": "روانسر",
            "province": "کرمانشاه"
        },
        {
            "0": "35.731103593459999",
            "1": "51.404843774592401",
            "city": "بیستون",
            "province": "کرمانشاه"
        },
        {
            "0": "35.636763000000002",
            "1": "51.489845500000001",
            "city": "اسلام آبادغرب",
            "province": "کرمانشاه"
        },
        {
            "0": "34.862578206968401",
            "1": "47.543425758374902",
            "city": "سنقر",
            "province": "کرمانشاه"
        },
        {
            "0": "34.382638354015398",
            "1": "47.119000842985002",
            "city": "تازه آباد",
            "province": "کرمانشاه"
        },
        {
            "0": "34.5705225067681",
            "1": "47.505780950796698",
            "city": "صحنه",
            "province": "کرمانشاه"
        },
        {
            "0": "35.496103483906502",
            "1": "51.0523681639446",
            "city": "رباط",
            "province": "کرمانشاه"
        },
        {
            "0": "33.597972337197596",
            "1": "45.961488723109802",
            "city": "سومار",
            "province": "کرمانشاه"
        },
        {
            "0": "34.071398374980703",
            "1": "45.978162282768103",
            "city": "گیلانغرب",
            "province": "کرمانشاه"
        },
        {
            "0": "34.477169560784397",
            "1": "47.916085393931702",
            "city": "کنگاور",
            "province": "کرمانشاه"
        },
        {
            "0": "35.104144442496498",
            "1": "46.299602127797698",
            "city": "نودشه",
            "province": "کرمانشاه"
        },
        {
            "0": "32.548138546669499",
            "1": "51.674062015873602",
            "city": "نوسود",
            "province": "کرمانشاه"
        },
        {
            "0": "34.3473141692293",
            "1": "47.455634257154003",
            "city": "هرسین",
            "province": "کرمانشاه"
        },
        {
            "0": "30.460740910266399",
            "1": "51.069474148622398",
            "city": "باشت",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "35.3182471317497",
            "1": "47.026092214443999",
            "city": "شاهو",
            "province": "کرمانشاه"
        },
        {
            "0": "29.9410946445369",
            "1": "52.214500899069201",
            "city": "یاسوج",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "36.851046264723998",
            "1": "53.627477709027303",
            "city": "میان راهان",
            "province": "کرمانشاه"
        },
        {
            "0": "36.643103746274001",
            "1": "53.292457663421303",
            "city": "دوگنبدان",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "30.772448307715599",
            "1": "50.872866051038002",
            "city": "چرام",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "32.660763921900397",
            "1": "51.668083555534601",
            "city": "دهدشت",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "32.658445436257701",
            "1": "51.653039505558098",
            "city": "سوق",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "30.9880098166769",
            "1": "50.355385033077702",
            "city": "لنده",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "37.203134366716199",
            "1": "54.709168840919702",
            "city": "انبارآلوم",
            "province": "گلستان"
        },
        {
            "0": "36.690770626666101",
            "1": "49.306248148221599",
            "city": "گراب سفلی",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "31.910871012348299",
            "1": "54.3266107096781",
            "city": "سی سخت",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "قلعه رئیسی",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "0": "36.988663137956799",
            "1": "55.338714927770297",
            "city": "آزادشهر",
            "province": "گلستان"
        },
        {
            "0": "37.508212045681397",
            "1": "54.845005014041597",
            "city": "اینچه برون",
            "province": "گلستان"
        },
        {
            "0": "35.750472984520897",
            "1": "51.550203734193097",
            "city": "جلین",
            "province": "گلستان"
        },
        {
            "0": "37.163148924456102",
            "1": "54.527407318548498",
            "city": "آق قلا",
            "province": "گلستان"
        },
        {
            "0": "36.7510061904824",
            "1": "54.505414954301898",
            "city": "گرگان",
            "province": "گلستان"
        },
        {
            "0": "36.761889502802397",
            "1": "53.932869272451597",
            "city": "بندر گز",
            "province": "گلستان"
        },
        {
            "0": "36.865546608287097",
            "1": "54.574845237100298",
            "city": "سرخنکلاته",
            "province": "گلستان"
        },
        {
            "0": "36.921675436481998",
            "1": "54.159151570682802",
            "city": "ترکمن",
            "province": "گلستان"
        },
        {
            "0": "36.955554289970998",
            "1": "55.098331265853702",
            "city": "رامیان",
            "province": "گلستان"
        },
        {
            "0": "36.6817000023172",
            "1": "54.197997783606702",
            "city": "کردکوی",
            "province": "گلستان"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "خان ببین",
            "province": "گلستان"
        },
        {
            "0": "37.555023129127697",
            "1": "55.577328877450498",
            "city": "کلاله",
            "province": "گلستان"
        },
        {
            "0": "37.324040723095898",
            "1": "55.672765699921001",
            "city": "گالیکش",
            "province": "گلستان"
        },
        {
            "0": "36.985222652637901",
            "1": "54.2684432387613",
            "city": "سیمین شهر",
            "province": "گلستان"
        },
        {
            "0": "36.842879070673099",
            "1": "54.852863884225002",
            "city": "علی آباد",
            "province": "گلستان"
        },
        {
            "0": "37.079559400000001",
            "1": "55.196939299999997",
            "city": "فاضل آباد",
            "province": "گلستان"
        },
        {
            "0": "37.135544382734899",
            "1": "55.4614225721118",
            "city": "مینودشت",
            "province": "گلستان"
        },
        {
            "0": "37.004568333921199",
            "1": "54.696173963418801",
            "city": "گمیش تپه",
            "province": "گلستان"
        },
        {
            "0": "37.562120802923801",
            "1": "55.103035970077102",
            "city": "گنبد کاووس",
            "province": "گلستان"
        },
        {
            "0": "36.761889502802397",
            "1": "53.932869272451597",
            "city": "نوکنده",
            "province": "گلستان"
        },
        {
            "0": "37.853749182291402",
            "1": "55.917635367410703",
            "city": "مراوه تپه",
            "province": "گلستان"
        },
        {
            "0": "36.9134344",
            "1": "54.849711900000003",
            "city": "نوده خاندوز",
            "province": "گلستان"
        },
        {
            "0": "37.527371255959103",
            "1": "48.781736440281101",
            "city": "اسالم",
            "province": "گیلان"
        },
        {
            "0": "36.963525984721102",
            "1": "50.137627130238201",
            "city": "املش",
            "province": "گیلان"
        },
        {
            "0": "37.132440124092497",
            "1": "55.168588529245397",
            "city": "نگین شهر",
            "province": "گلستان"
        },
        {
            "0": "37.272569443150203",
            "1": "49.682052025426103",
            "city": "رشت",
            "province": "گیلان"
        },
        {
            "0": "38.351623377591302",
            "1": "48.742389465644699",
            "city": "آستارا",
            "province": "گیلان"
        },
        {
            "0": "36.705052030358402",
            "1": "49.920005607453497",
            "city": "جیرنده",
            "province": "گیلان"
        },
        {
            "0": "37.022285509017202",
            "1": "50.464850788589501",
            "city": "چابکسر",
            "province": "گیلان"
        },
        {
            "0": "37.3300557215005",
            "1": "49.986000080754799",
            "city": "آستانه اشرفیه",
            "province": "گیلان"
        },
        {
            "0": "37.461486909208702",
            "1": "49.410916984000899",
            "city": "بندر انزلی",
            "province": "گیلان"
        },
        {
            "0": "37.368693655887597",
            "1": "49.682267635313103",
            "city": "خشکبیجار",
            "province": "گیلان"
        },
        {
            "0": "37.359747960455202",
            "1": "49.5680855893158",
            "city": "خمام",
            "province": "گیلان"
        },
        {
            "0": "37.012271039043803",
            "1": "50.233614708047298",
            "city": "رانکوه",
            "province": "گیلان"
        },
        {
            "0": "36.773394828363799",
            "1": "49.755615884395603",
            "city": "بره سر",
            "province": "گیلان"
        },
        {
            "0": "37.266364048376701",
            "1": "50.006656650009603",
            "city": "رودبنه",
            "province": "گیلان"
        },
        {
            "0": "37.626892249999997",
            "1": "49.064601949999997",
            "city": "پره سر",
            "province": "گیلان"
        },
        {
            "0": "35.603320650186298",
            "1": "51.432577684013502",
            "city": "دیلمان",
            "province": "گیلان"
        },
        {
            "0": "32.719502650649602",
            "1": "51.675725954587598",
            "city": "رحیم آباد",
            "province": "گیلان"
        },
        {
            "0": "36.878251105273101",
            "1": "50.318761704041201",
            "city": "رودسر",
            "province": "گیلان"
        },
        {
            "0": "35.795954309504701",
            "1": "51.4716299151697",
            "city": "رستم آباد",
            "province": "گیلان"
        },
        {
            "0": "36.4666722020132",
            "1": "52.393558857919501",
            "city": "سنگر",
            "province": "گیلان"
        },
        {
            "0": "37.086766452457802",
            "1": "49.374199645450297",
            "city": "شفت",
            "province": "گیلان"
        },
        {
            "0": "37.329164124080002",
            "1": "49.7636168091271",
            "city": "کوچصفهان",
            "province": "گیلان"
        },
        {
            "0": "36.943135492463",
            "1": "49.900384158455402",
            "city": "سیاهکل",
            "province": "گیلان"
        },
        {
            "0": "37.150688",
            "1": "50.179974",
            "city": "کومله",
            "province": "گیلان"
        },
        {
            "0": "37.179258594550902",
            "1": "49.134484884003797",
            "city": "فومن",
            "province": "گیلان"
        },
        {
            "0": "36.631454",
            "1": "49.514496",
            "city": "لوشان",
            "province": "گیلان"
        },
        {
            "0": "37.353136432695699",
            "1": "49.296703303239603",
            "city": "صومعه سرا",
            "province": "گیلان"
        },
        {
            "0": "37.120764226171502",
            "1": "50.108928317161201",
            "city": "لنگرود",
            "province": "گیلان"
        },
        {
            "0": "37.421761",
            "1": "49.932884",
            "city": "کیاشهر",
            "province": "گیلان"
        },
        {
            "0": "37.951294",
            "1": "48.913368",
            "city": "لیسار",
            "province": "گیلان"
        },
        {
            "0": "37.279716",
            "1": "49.380527",
            "city": "مرجقل",
            "province": "گیلان"
        },
        {
            "0": "37.359669",
            "1": "49.861176",
            "city": "لشت نشاء",
            "province": "گیلان"
        },
        {
            "0": "35.543649900515298",
            "1": "51.060308117374902",
            "city": "منجیل",
            "province": "گیلان"
        },
        {
            "0": "37.045204",
            "1": "50.411091",
            "city": "واجارگاه",
            "province": "گیلان"
        },
        {
            "0": "38.309280",
            "1": "48.866001",
            "city": "لوندویل",
            "province": "گیلان"
        },
        {
            "0": "37.304077",
            "1": "49.217831",
            "city": "گوراب زرمیخ",
            "province": "گیلان"
        },
        {
            "0": "37.155052",
            "1": "48.989758",
            "city": "ماسوله",
            "province": "گیلان"
        },
        {
            "0": "37.220033768864397",
            "1": "50.036120777636498",
            "city": "لاهیجان",
            "province": "گیلان"
        },
        {
            "0": "33.384778548506603",
            "1": "48.570693352891197",
            "city": "خرم آباد",
            "province": "لرستان"
        },
        {
            "0": "37.796333",
            "1": "48.907986",
            "city": "هشتپر",
            "province": "گیلان"
        },
        {
            "0": "37.3993870967521",
            "1": "49.028091421330501",
            "city": "ماسال",
            "province": "گیلان"
        },
        {
            "0": "34.015678",
            "1": "48.641941",
            "city": "اشترینان",
            "province": "لرستان"
        },
        {
            "0": "37.259579",
            "1": "49.827061",
            "city": "لولمان",
            "province": "گیلان"
        },
        {
            "0": "33.865051",
            "1": "48.262753",
            "city": "الشتر",
            "province": "لرستان"
        },
        {
            "0": "33.889816859292303",
            "1": "48.756186084255603",
            "city": "بروجرد",
            "province": "لرستان"
        },
        {
            "0": "33.282188",
            "1": "47.507523",
            "city": "چقابل",
            "province": "لرستان"
        },
        {
            "0": "33.648647",
            "1": "48.561142",
            "city": "چغلوندی",
            "province": "لرستان"
        },
        {
            "0": "33.665894",
            "1": "48.906517",
            "city": "چالانچولان",
            "province": "لرستان"
        },
        {
            "0": "33.218487",
            "1": "48.884140",
            "city": "سپیددشت",
            "province": "لرستان"
        },
        {
            "0": "33.492184",
            "1": "48.688732",
            "city": "زاغه",
            "province": "لرستان"
        },
        {
            "0": "35.711605",
            "1": "51.373760",
            "city": "درب گنبد",
            "province": "لرستان"
        },
        {
            "0": "33.1220986559509",
            "1": "49.416101245998803",
            "city": "الیگودرز",
            "province": "لرستان"
        },
        {
            "0": "33.126447620754597",
            "1": "47.975576521345701",
            "city": "پلدختر",
            "province": "لرستان"
        },
        {
            "0": "33.520120614856801",
            "1": "49.071813987824399",
            "city": "دورود",
            "province": "لرستان"
        },
        {
            "0": "33.500845886997098",
            "1": "49.443276616366298",
            "city": "ازنا",
            "province": "لرستان"
        },
        {
            "0": "33.588943",
            "1": "49.519741",
            "city": "مؤمن آباد",
            "province": "لرستان"
        },
        {
            "0": "36.926571",
            "1": "45.380089",
            "city": "هفت چشمه",
            "province": "لرستان"
        },
        {
            "0": "33.486874",
            "1": "48.030537",
            "city": "ویسیان",
            "province": "لرستان"
        },
        {
            "0": "33.377865",
            "1": "47.961750",
            "city": "معمولان",
            "province": "لرستان"
        },
        {
            "0": "36.322725417462699",
            "1": "53.357268581317399",
            "city": "ساری",
            "province": "مازندران"
        },
        {
            "0": "35.664017",
            "1": "51.324074",
            "city": "آلاشت",
            "province": "مازندران"
        },
        {
            "0": "33.474236",
            "1": "47.236397",
            "city": "گراب",
            "province": "لرستان"
        },
        {
            "0": "36.113032848662499",
            "1": "52.244969013926003",
            "city": "آمل",
            "province": "مازندران"
        },
        {
            "0": "36.667313538083",
            "1": "52.700790864547898",
            "city": "بابلسر",
            "province": "مازندران"
        },
        {
            "0": "33.5442259418802",
            "1": "47.390153463891302",
            "city": "کوهدشت",
            "province": "لرستان"
        },
        {
            "0": "36.302073690759102",
            "1": "52.623489133774697",
            "city": "بابل",
            "province": "مازندران"
        },
        {
            "0": "36.592510",
            "1": "52.668846",
            "city": "امیرکلا",
            "province": "مازندران"
        },
        {
            "0": "36.199127",
            "1": "51.805748",
            "city": "بلده",
            "province": "مازندران"
        },
        {
            "0": "33.402039",
            "1": "47.323853",
            "city": "کونانی",
            "province": "لرستان"
        },
        {
            "0": "33.188641",
            "1": "49.187637",
            "city": "شول آباد",
            "province": "لرستان"
        },
        {
            "0": "36.600006",
            "1": "52.141945",
            "city": "ایزدشهر",
            "province": "مازندران"
        },
        {
            "0": "36.671680",
            "1": "52.762642",
            "city": "بهنمیر",
            "province": "مازندران"
        },
        {
            "0": "35.740387",
            "1": "51.563343",
            "city": "پل سفید",
            "province": "مازندران"
        },
        {
            "0": "36.4027680889929",
            "1": "51.258192179322897",
            "city": "چالوس",
            "province": "مازندران"
        },
        {
            "0": "36.399010",
            "1": "51.590740",
            "city": "پول",
            "province": "مازندران"
        },
        {
            "0": "36.674338567731503",
            "1": "52.914224870178302",
            "city": "جویبار",
            "province": "مازندران"
        },
        {
            "0": "36.601908192812303",
            "1": "50.832944799909598",
            "city": "تنکابن",
            "province": "مازندران"
        },
        {
            "0": "36.670716689834101",
            "1": "53.688620606002701",
            "city": "بهشهر",
            "province": "مازندران"
        },
        {
            "0": "36.492466",
            "1": "52.122169",
            "city": "چمستان",
            "province": "مازندران"
        },
        {
            "0": "36.700336",
            "1": "53.641689",
            "city": "خلیل شهر",
            "province": "مازندران"
        },
        {
            "0": "36.372749",
            "1": "52.566250",
            "city": "خوش رودپی",
            "province": "مازندران"
        },
        {
            "0": "36.481522",
            "1": "52.451649",
            "city": "دابودشت",
            "province": "مازندران"
        },
        {
            "0": "35.881107",
            "1": "52.168423",
            "city": "رینه",
            "province": "مازندران"
        },
        {
            "0": "36.778313295820503",
            "1": "50.554182054357597",
            "city": "رامسر",
            "province": "مازندران"
        },
        {
            "0": "36.178604",
            "1": "52.975273",
            "city": "زیرآب",
            "province": "مازندران"
        },
        {
            "0": "36.558792",
            "1": "51.960136",
            "city": "رویان",
            "province": "مازندران"
        },
        {
            "0": "36.518356",
            "1": "52.574677",
            "city": "زرگر محله",
            "province": "مازندران"
        },
        {
            "0": "36.674816",
            "1": "52.453411",
            "city": "سرخرود",
            "province": "مازندران"
        },
        {
            "0": "36.701431",
            "1": "51.199238",
            "city": "سلمان شهر",
            "province": "مازندران"
        },
        {
            "0": "35.035797",
            "1": "50.353554",
            "city": "سورک",
            "province": "مازندران"
        },
        {
            "0": "36.677910",
            "1": "53.426086",
            "city": "رستمکلا",
            "province": "مازندران"
        },
        {
            "0": "36.390144",
            "1": "52.854362",
            "city": "شیرگاه",
            "province": "مازندران"
        },
        {
            "0": "36.845871",
            "1": "50.791904",
            "city": "شیرود",
            "province": "مازندران"
        },
        {
            "0": "36.689060",
            "1": "51.259499",
            "city": "کلارآباد",
            "province": "مازندران"
        },
        {
            "0": "36.456255204873003",
            "1": "52.882468826040999",
            "city": "قائم شهر",
            "province": "مازندران"
        },
        {
            "0": "35.694132166614096",
            "1": "59.881092649965701",
            "city": "فریم",
            "province": "مازندران"
        },
        {
            "0": "36.6439804507663",
            "1": "52.528873253509303",
            "city": "فریدونکنار",
            "province": "مازندران"
        },
        {
            "0": "36.877636",
            "1": "50.719543",
            "city": "کتالم وسادات شهر",
            "province": "مازندران"
        },
        {
            "0": "36.646507135814502",
            "1": "51.159003353817901",
            "city": "عباس آباد",
            "province": "مازندران"
        },
        {
            "0": "36.641193",
            "1": "52.627903",
            "city": "کله بست",
            "province": "مازندران"
        },
        {
            "0": "36.427345045295802",
            "1": "51.079908830079901",
            "city": "کلاردشت",
            "province": "مازندران"
        },
        {
            "0": "36.692421",
            "1": "52.905914",
            "city": "کوهی خیل",
            "province": "مازندران"
        },
        {
            "0": "35.701580",
            "1": "51.455006",
            "city": "کیاسر",
            "province": "مازندران"
        },
        {
            "0": "35.902832",
            "1": "52.219498",
            "city": "گزنک",
            "province": "مازندران"
        },
        {
            "0": "36.693881129381403",
            "1": "53.803060306897898",
            "city": "گلوگاه",
            "province": "مازندران"
        },
        {
            "0": "36.453445",
            "1": "51.296936",
            "city": "مرزن آباد",
            "province": "مازندران"
        },
        {
            "0": "35.777340",
            "1": "51.355568",
            "city": "گتاب",
            "province": "مازندران"
        },
        {
            "0": "36.367287",
            "1": "52.736511",
            "city": "مرزیکلا",
            "province": "مازندران"
        },
        {
            "0": "36.734970",
            "1": "51.030220",
            "city": "نشتارود",
            "province": "مازندران"
        },
        {
            "0": "36.556271",
            "1": "52.692497",
            "city": "کیاکلا",
            "province": "مازندران"
        },
        {
            "0": "36.513711175250599",
            "1": "53.5562560170167",
            "city": "نکا",
            "province": "مازندران"
        },
        {
            "0": "36.434717744866099",
            "1": "51.605577660966802",
            "city": "نوشهر",
            "province": "مازندران"
        },
        {
            "0": "34.141017148430898",
            "1": "49.805616302799798",
            "city": "اراک",
            "province": "مرکزی"
        },
        {
            "0": "37.3300557215005",
            "1": "49.986000080754799",
            "city": "آستانه",
            "province": "مرکزی"
        },
        {
            "0": "38.029349471857898",
            "1": "46.163154371356399",
            "city": "نور",
            "province": "مازندران"
        },
        {
            "0": "34.811706325861302",
            "1": "49.863031067658703",
            "city": "تفرش",
            "province": "مرکزی"
        },
        {
            "0": "35.513630",
            "1": "51.054371",
            "city": "پرندک",
            "province": "مرکزی"
        },
        {
            "0": "34.044575",
            "1": "49.287743",
            "city": "توره",
            "province": "مرکزی"
        },
        {
            "0": "34.431273640159702",
            "1": "50.052376219391299",
            "city": "آشتیان",
            "province": "مرکزی"
        },
        {
            "0": "34.255283",
            "1": "49.327869",
            "city": "جاورسیان",
            "province": "مرکزی"
        },
        {
            "0": "35.359051",
            "1": "50.292248",
            "city": "خشکرود",
            "province": "مرکزی"
        },
        {
            "0": "34.346399474485501",
            "1": "49.221518379332601",
            "city": "خنداب",
            "province": "مرکزی"
        },
        {
            "0": "35.672975185810998",
            "1": "51.325891151672401",
            "city": "رازقان",
            "province": "مرکزی"
        },
        {
            "0": "34.295555",
            "1": "49.854950",
            "city": "داودآباد",
            "province": "مرکزی"
        },
        {
            "0": "34.017134339843999",
            "1": "50.750698902715101",
            "city": "دلیجان",
            "province": "مرکزی"
        },
        {
            "0": "34.433366333945301",
            "1": "49.3841298979576",
            "city": "ساروق",
            "province": "مرکزی"
        },
        {
            "0": "33.666881931046802",
            "1": "49.997613194449499",
            "city": "خمین",
            "province": "مرکزی"
        },
        {
            "0": "34.623584110200099",
            "1": "50.911680367866097",
            "city": "زاویه",
            "province": "مرکزی"
        },
        {
            "0": "34.475863429572499",
            "1": "49.678375720443398",
            "city": "فرمهین",
            "province": "مرکزی"
        },
        {
            "0": "34.049968654975402",
            "1": "49.623178106770403",
            "city": "سنجان",
            "province": "مرکزی"
        },
        {
            "0": "33.891474511412397",
            "1": "49.3036415788741",
            "city": "شازند",
            "province": "مرکزی"
        },
        {
            "0": "35.272724207546297",
            "1": "50.537865177286697",
            "city": "مأمونیه",
            "province": "مرکزی"
        },
        {
            "0": "34.063163943911803",
            "1": "49.647022334720198",
            "city": "کرهرود",
            "province": "مرکزی"
        },
        {
            "0": "34.7255631741263",
            "1": "49.306010108686699",
            "city": "کمیجان",
            "province": "مرکزی"
        },
        {
            "0": "35.282503949262299",
            "1": "49.490299349367703",
            "city": "نوبران",
            "province": "مرکزی"
        },
        {
            "0": "35.074591180614497",
            "1": "50.032896465916998",
            "city": "ساوه",
            "province": "مرکزی"
        },
        {
            "0": "34.096075845863197",
            "1": "49.6772878521951",
            "city": "هندودر",
            "province": "مرکزی"
        },
        {
            "0": "35.633504090498803",
            "1": "51.311647921747898",
            "city": "غرق آباد",
            "province": "مرکزی"
        },
        {
            "0": "37.5474699589764",
            "1": "45.074464855728401",
            "city": "قورچی باشی",
            "province": "مرکزی"
        },
        {
            "0": "25.875535577366801",
            "1": "55.032352627127999",
            "city": "ابوموسی",
            "province": "هرمزگان"
        },
        {
            "0": "27.194710970077999",
            "1": "54.488948575747202",
            "city": "بستک",
            "province": "هرمزگان"
        },
        {
            "0": "33.882955289093204",
            "1": "50.450797855474697",
            "city": "محلات",
            "province": "مرکزی"
        },
        {
            "0": "34.003135856675399",
            "1": "50.846454421058297",
            "city": "نراق",
            "province": "مرکزی"
        },
        {
            "0": "35.714709004266197",
            "1": "51.335645551815801",
            "city": "جناح",
            "province": "هرمزگان"
        },
        {
            "0": "28.990492197278499",
            "1": "53.630262942527899",
            "city": "بندر عباس",
            "province": "هرمزگان"
        },
        {
            "0": "26.838356776006901",
            "1": "57.066699436167298",
            "city": "بندر جاسک",
            "province": "هرمزگان"
        },
        {
            "0": "27.281502290436801",
            "1": "55.4963521843286",
            "city": "خمیر",
            "province": "هرمزگان"
        },
        {
            "0": "26.947482567718801",
            "1": "56.069078831941702",
            "city": "درگهان",
            "province": "هرمزگان"
        },
        {
            "0": "27.135284634425201",
            "1": "53.261813885667898",
            "city": "پارسیان",
            "province": "هرمزگان"
        },
        {
            "0": "32.627003351880298",
            "1": "51.683970378106402",
            "city": "تخت",
            "province": "هرمزگان"
        },
        {
            "0": "36.743429718644599",
            "1": "53.879697762101998",
            "city": "بندر چارک",
            "province": "هرمزگان"
        },
        {
            "0": "26.839491363789499",
            "1": "54.624788961891198",
            "city": "بندر لنگه",
            "province": "هرمزگان"
        },
        {
            "0": "35.776505194121597",
            "1": "51.415734448539801",
            "city": "سوزا",
            "province": "هرمزگان"
        },
        {
            "0": "26.490340527966602",
            "1": "57.229312770246501",
            "city": "سیریک",
            "province": "هرمزگان"
        },
        {
            "0": "36.375487700000001",
            "1": "59.495144199999999",
            "city": "سرگز",
            "province": "هرمزگان"
        },
        {
            "0": "35.786814175796103",
            "1": "51.469234379483702",
            "city": "فین",
            "province": "هرمزگان"
        },
        {
            "0": "26.783832158828901",
            "1": "55.811451092632801",
            "city": "قشم",
            "province": "هرمزگان"
        },
        {
            "0": "36.230435545706399",
            "1": "45.460908031167499",
            "city": "سردشت بشاگرد",
            "province": "هرمزگان"
        },
        {
            "0": "35.272605041581897",
            "1": "59.437095856447698",
            "city": "کنگ",
            "province": "هرمزگان"
        },
        {
            "0": "26.9398793557862",
            "1": "57.330235764016699",
            "city": "میناب",
            "province": "هرمزگان"
        },
        {
            "0": "26.5345657578569",
            "1": "53.972132639206301",
            "city": "کیش",
            "province": "هرمزگان"
        },
        {
            "0": "35.704055028149597",
            "1": "51.113207935451904",
            "city": "قلعه قاضی",
            "province": "هرمزگان"
        },
        {
            "0": "27.162892589892301",
            "1": "56.232479970780197",
            "city": "گوهران",
            "province": "هرمزگان"
        },
        {
            "0": "34.542852998511698",
            "1": "48.332148097061499",
            "city": "تویسرکان",
            "province": "همدان"
        },
        {
            "0": "34.885229291427102",
            "1": "48.610567155438503",
            "city": "همدان",
            "province": "همدان"
        },
        {
            "0": "27.061431104910898",
            "1": "56.4604961550735",
            "city": "هرمز",
            "province": "هرمزگان"
        },
        {
            "0": "34.808490477021103",
            "1": "48.501871737174",
            "city": "دمق",
            "province": "همدان"
        },
        {
            "0": "35.432574314264102",
            "1": "48.973312466791697",
            "city": "رزن",
            "province": "همدان"
        },
        {
            "0": "34.778978310198099",
            "1": "48.028469970762998",
            "city": "اسدآباد",
            "province": "همدان"
        },
        {
            "0": "35.717615550482599",
            "1": "51.111839019183499",
            "city": "سرکان",
            "province": "همدان"
        },
        {
            "0": "35.090729946929102",
            "1": "49.186968527259701",
            "city": "فامنین",
            "province": "همدان"
        },
        {
            "0": "34.983579934789702",
            "1": "48.362648545513103",
            "city": "بهار",
            "province": "همدان"
        },
        {
            "0": "34.460693831235098",
            "1": "48.260132383304502",
            "city": "فرسفج",
            "province": "همدان"
        },
        {
            "0": "35.6342403964263",
            "1": "51.434798693233702",
            "city": "زنگنه",
            "province": "همدان"
        },
        {
            "0": "36.673595499999998",
            "1": "59.098837899999999",
            "city": "جوکار",
            "province": "همدان"
        },
        {
            "0": "34.460693831235098",
            "1": "48.260132383304502",
            "city": "فیروزان",
            "province": "همدان"
        },
        {
            "0": "35.365738054665201",
            "1": "48.380748977847901",
            "city": "کبودرآهنگ",
            "province": "همدان"
        },
        {
            "0": "34.832860011487703",
            "1": "48.466766692357503",
            "city": "مریانج",
            "province": "همدان"
        },
        {
            "0": "31.093275958155399",
            "1": "53.383017792997599",
            "city": "ابرکوه",
            "province": "یزد"
        },
        {
            "0": "35.663544899999998",
            "1": "51.307847049999999",
            "city": "شیرین سو",
            "province": "همدان"
        },
        {
            "0": "34.221539319391901",
            "1": "48.243189618959399",
            "city": "نهاوند",
            "province": "همدان"
        },
        {
            "0": "35.756626068547298",
            "1": "51.325805326505701",
            "city": "گل تپه",
            "province": "همدان"
        },
        {
            "0": "35.229385110257297",
            "1": "47.826159269743201",
            "city": "قروه در جزین",
            "province": "همدان"
        },
        {
            "0": "34.322821463032099",
            "1": "48.793777956196799",
            "city": "ملایر",
            "province": "همدان"
        },
        {
            "0": "36.291315581092803",
            "1": "59.568850854662699",
            "city": "احمدآباد",
            "province": "یزد"
        },
        {
            "0": "31.990862080673701",
            "1": "54.043176362606303",
            "city": "اشکذر",
            "province": "یزد"
        },
        {
            "0": "31.871366015326799",
            "1": "54.043090742545601",
            "city": "خضرآباد",
            "province": "یزد"
        },
        {
            "0": "32.011812601356702",
            "1": "56.143799977328797",
            "city": "بهاباد",
            "province": "یزد"
        },
        {
            "0": "31.937077853795401",
            "1": "54.271494406371197",
            "city": "شاهدیه",
            "province": "یزد"
        },
        {
            "0": "32.032055234862099",
            "1": "54.256796247568197",
            "city": "زارچ",
            "province": "یزد"
        },
        {
            "0": "31.668010354273999",
            "1": "55.400603451107102",
            "city": "بافق",
            "province": "یزد"
        },
        {
            "0": "31.814858592765699",
            "1": "54.408812037658201",
            "city": "حمیدیا",
            "province": "یزد"
        },
        {
            "0": "32.262879577499902",
            "1": "53.492341583842503",
            "city": "عقدا",
            "province": "یزد"
        },
        {
            "0": "35.687227053743101",
            "1": "50.794055102419499",
            "city": "مهردشت",
            "province": "یزد"
        },
        {
            "0": "31.806780554950699",
            "1": "54.609748576743797",
            "city": "یزد",
            "province": "یزد"
        },
        {
            "0": "31.359533912916302",
            "1": "54.289134316469699",
            "city": "مروست",
            "province": "یزد"
        },
        {
            "0": "33.306436604321497",
            "1": "56.820601035511601",
            "city": "طبس",
            "province": "یزد"
        },
        {
            "0": "32.100396865121297",
            "1": "53.856641811708997",
            "city": "ندوشن",
            "province": "یزد"
        },
        {
            "0": "31.4544159879411",
            "1": "53.814270168926001",
            "city": "تفت",
            "province": "یزد"
        },
        {
            "0": "31.346708640439399",
            "1": "54.644753219239902",
            "city": "مهریز",
            "province": "یزد"
        },
        {
            "0": "32.010006140649502",
            "1": "53.527279691193897",
            "city": "میبد",
            "province": "یزد"
        },
        {
            "0": "34.735325357523998",
            "1": "60.801172446245097",
            "city": "هرات",
            "province": "یزد"
        }
    ]

    # advertisement_type_ids
    deal_type_list = [
        {'id': 1, 'title': 'فروش'},
        {'id': 2, 'title': 'اجاره'}
    ]

    # application_ids => estate_type_ids
    category_list = [
        {'id': 1, 'title': 'مسکونی',
         'sub': [
             {'id': 1, 'title': 'آپارتمان'},
             {'id': 5, 'title': 'آپارتمان'},
             {'id': 2, 'title': 'خانه و ویلا'},
             {'id': 3, 'title': 'خانه و ویلا'},
             {'id': 6, 'title': 'زمین و کلنگی'}
         ]
         },
        {'id': 2, 'title': 'اداری و تجاری',
         'sub': [
             {'id': 1, 'title': 'دفتر کار اتاق اداری و مطب'},
             {'id': 6, 'title': 'صنعتی کشاورزی و تجاری'},
             {'id': 4, 'title': 'مغازه و غرفه'}
         ]
         },

        {'id': 4, 'title': 'اداری و تجاری',
         'sub': [
             {'id': 1, 'title': 'دفتر کار اتاق اداری و مطب'},
             {'id': 6, 'title': 'صنعتی کشاورزی و تجاری'},
             {'id': 4, 'title': 'مغازه و غرفه'}
         ]
         },
        {'id': 12, 'title': 'سایر املاک'},
        {'id': 9, 'title': 'سایر املاک'},
        {'id': 5, 'title': 'سایر املاک'},
    ]
