# -*- coding: utf-8 -*-
import scrapy

import json

from cansoCrawler.items import InpinHomeItem


class InpinSpider(scrapy.Spider):
    name = 'inpin'
    allowed_domains = ['api.inpinapp.com']
    _pages = 2

    def start_requests(self):
        for city in self.city_list:
            for deal_type in self.deal_type_list:
                for page in range(1, self._pages):
                    body = json.dumps(
                        self.create_body(deal_type['id'], city['lat-'], city['lat'], city['lat+'], city['lon-'],
                                         city['lon'], city['lon+']))
                    yield scrapy.Request(
                        url=f"https://api.inpinapp.com/api/advertisement/map-filter?order=our_suggestion&direction=desc&page={page}&with_banner=1",
                        headers=self.header, method='post',
                        body=body,
                        cb_kwargs={"city": city['city'], "province": city['province'],
                                   "deal_type": deal_type['title']})

    def parse(self, response, city, province, deal_type):
        json_response = json.loads(response.body.decode('UTF-8'))
        data_list = json_response['advertisements']['data']
        if len(data_list) > 0:
            self.logger.info(f"data length: {len(data_list)}")
        for ad in data_list:
            yield response.follow(url=f"https://api.inpinapp.com/api/advertisement/{ad['id']}", headers=self.header,
                                  callback=self.parse_ad,
                                  cb_kwargs={"city": city, "province": province,
                                             "deal_type": deal_type})

    def parse_ad(self, response, city, province, deal_type):
        json_response = json.loads(response.body.decode('UTF-8'))
        item = InpinHomeItem()
        try:
            item['city'] = city
            item['province'] = province
            item['category'] = deal_type + " "
            item.extract(json_response)
        except Exception as e:
            self.logger.critical(f"extract error: {e} for => {response.body}")
        return item

    def create_body(self, deal_type, latn, lat, latp, lonn, lon, lonp):

        return {
            "advertisement_filter": {
                "_isChangedState": True,
                "advertisement_type_ids": [deal_type],
                "shape": {
                    "type": "polygon",
                    "coordinates": [
                        [
                            [
                                float(lonp),
                                float(latp)
                            ],
                            [
                                float(lonp),
                                float(latn)
                            ],
                            [
                                float(lonn),
                                float(latn)
                            ],
                            [
                                float(lonn),
                                float(latp)
                            ],
                            [
                                float(lonp),
                                float(latp)
                            ]
                        ]
                    ]
                }
            },
            "agent_filter": {
                "shape": {
                    "type": "polygon",
                    "coordinates": [
                        [
                            [
                                float(lonp),
                                float(latp)
                            ],
                            [
                                float(lonp),
                                float(latn)
                            ],
                            [
                                float(lonn),
                                float(latn)
                            ],
                            [
                                float(lonn),
                                float(latp)
                            ],
                            [
                                float(lonp),
                                float(latp)
                            ]
                        ]
                    ]
                }
            },
            "region_filter": {
                "shape": {
                    "type": "point",
                    "coordinates": [
                        float(lon),
                        float(lat)
                    ]
                }
            }
        }

    header = {
        "Authorization": "Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImp0aSI6ImUzN2E4NjM0MzNmMjFmNzdlNzJkYzVjYmFiNjdlY2YxNTMwNmNhNmQ4NzYyYTI2MjM3ZmZlMDU1ZTJmNWVmYjY2YjlmMzExZDVkOWNkMjk3In0.eyJhdWQiOiIyIiwianRpIjoiZTM3YTg2MzQzM2YyMWY3N2U3MmRjNWNiYWI2N2VjZjE1MzA2Y2E2ZDg3NjJhMjYyMzdmZmUwNTVlMmY1ZWZiNjZiOWYzMTFkNWQ5Y2QyOTciLCJpYXQiOjE1MTQzNjExODgsIm5iZiI6MTUxNDM2MTE4OCwiZXhwIjoxNTQ1ODk3MTg4LCJzdWIiOiIyIiwic2NvcGVzIjpbXX0.C78r4gQnoSC-RKoIFk1Y7hni8UWCJk1I3yNB-6Mfh9xtxdC4MQHQ2CMzIppw_zea1tHZdw5QdgQBcV7TcyG9o35gkCpCFX_WoDSaWtLn8osy58oNsp83hddYqVSO8Ki4t23KKOKg6f6A3QIlD6ifkWnhcPHACKvXyFHzONagpsKvOuYjrJ6VgY84R2xAb-E08vceyWndDjouqHqAY_LD0Uw7rXd_mD1h3LCsCDSLTGWg3M7FLKPe91Pcg8XUHmFT5x5ZElkcalNuijKDCcw-S7BbFLba9pqA_5dWKVHRAd7PABOf7kCU1qqIcWP2u8KZndw1EWQhaiNMnPDu06V0pE2OBKsiFAtxWz-AsFEtdkdQzCdOuXZU9jzU4QHkSh0IgQE0e_23rVidxU0vtpANAcmUwYrX0i2fbjVif9IhaZr2n5viz2pKFo944YfsPJJBBGQy4JlU42sfoofX8_QILeD5fll_M0qcIfGA__XR-t0mxvl2wiRY88DJDw84HfVw1ZYWxKOmYIKE03GDCKvnOIJpSZHGpL4D8z2wVKfEuuMt5fFq8mdBfkEqjTgJMcpen91WvlIBaj6rQfMayQN_38j6Gkvsr_-3xLrqYjbGswYNVnF_PD6_PBKpVAP1l2vN-fxI_ru0AQ4jgA5sFHfiTum56d64HzpgHoRCq4rgGJA",
        "Content-Type": "application/json"
    }

    city_list = [
        {
            "lat": "38.0651720158152",
            "lon": "46.289841518480799",
            "lat+": "38.485131600000003",
            "lon+": "46.670341200000003",
            "lat-": "37.718916499999999",
            "lon-": "45.855426700000002",
            "city": "تبریز",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.948429",
            "lon": "45.984283",
            "lat+": "37.948429",
            "lon+": "45.984283",
            "lat-": "37.948429",
            "lon-": "45.984283",
            "city": "ایلخچی",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.868206846002998",
            "lon": "45.866718676854397",
            "lat+": "38.0433947",
            "lon+": "46.347815900000001",
            "lat-": "37.681635499999999",
            "lon-": "45.406767899999998",
            "city": "اسکو",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "35.773293",
            "lon": "47.654613",
            "lat+": "35.773293",
            "lon+": "47.654613",
            "lat-": "35.773293",
            "lon-": "47.654613",
            "city": "آقکند",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.043640",
            "lon": "46.363930",
            "lat+": "38.043640",
            "lon+": "46.363930",
            "lat-": "38.043640",
            "lon-": "46.363930",
            "city": "باسمنج",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.727929035453499",
            "lon": "45.898248291359501",
            "lat+": "37.894367899999999",
            "lon+": "46.163066200000003",
            "lat-": "37.563904800000003",
            "lon-": "45.657770200000002",
            "city": "آذرشهر",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.620143735814302",
            "lon": "47.213684563100301",
            "lat+": "39.083245900000001",
            "lon+": "47.6043029",
            "lat-": "38.298621400000002",
            "lon-": "46.743225799999998",
            "city": "اهر",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "39.047432",
            "lon": "47.317764",
            "lat+": "39.047432",
            "lon+": "47.317764",
            "lat-": "39.047432",
            "lon-": "47.317764",
            "city": "آبش احمد",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.803203308495299",
            "lon": "46.813094973560801",
            "lat+": "38.095091600000003",
            "lon+": "47.244316699999999",
            "lat-": "37.539656299999997",
            "lon-": "46.461235899999998",
            "city": "بستان آباد",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.325653243349599",
            "lon": "45.9954672681015",
            "lat+": "37.535220000000002",
            "lon+": "46.199440899999999",
            "lat-": "37.1660836",
            "lon-": "45.751148999999998",
            "city": "بناب",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "35.628357",
            "lon": "51.372337",
            "lat+": "35.628357",
            "lon+": "51.372337",
            "lat-": "35.628357",
            "lon-": "51.372337",
            "city": "بخشایش",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "35.752319",
            "lon": "51.400967",
            "lat+": "35.752319",
            "lon+": "51.400967",
            "lat-": "35.752319",
            "lon-": "51.400967",
            "city": "بناب جدید",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.582153",
            "lon": "47.391228",
            "lat+": "37.582153",
            "lon+": "47.391228",
            "lat-": "37.582153",
            "lon-": "47.391228",
            "city": "ترکمانچای",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.745193",
            "lon": "46.930984",
            "lat+": "37.745193",
            "lon+": "46.930984",
            "lat-": "37.745193",
            "lon-": "46.930984",
            "city": "تیکمه داش",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.314545",
            "lon": "45.366592",
            "lat+": "38.314545",
            "lon+": "45.366592",
            "lat-": "38.314545",
            "lon-": "45.366592",
            "city": "تسوج",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "35.797622926761299",
            "lon": "50.990793764508098",
            "lat+": "35.802233200000003",
            "lon+": "50.996245299999998",
            "lat-": "35.792469500000003",
            "lon-": "50.986449800000003",
            "city": "ترک",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "32.635404204999602",
            "lon": "51.656084588378299",
            "lat+": "32.637111400000002",
            "lon+": "51.658786999999997",
            "lat-": "32.633678099999997",
            "lon-": "51.653551700000001",
            "city": "جلفا",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.311787",
            "lon": "46.529259",
            "lat+": "37.311787",
            "lon+": "46.529259",
            "lat-": "37.311787",
            "lon-": "46.529259",
            "city": "خراجو",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "36.286011125297698",
            "lon": "59.607527122463502",
            "lat+": "36.290960900000002",
            "lon+": "59.612406700000001",
            "lat-": "36.281828400000002",
            "lon-": "59.602717200000001",
            "city": "خامنه",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.831413",
            "lon": "46.218567",
            "lat+": "38.831413",
            "lon+": "46.218567",
            "lat-": "38.831413",
            "lon-": "46.218567",
            "city": "خاروانا",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "39.157722",
            "lon": "47.033699",
            "lat+": "39.157722",
            "lon+": "47.033699",
            "lat-": "39.157722",
            "lon-": "47.033699",
            "city": "خمارلو",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.949039",
            "lon": "46.055145",
            "lat+": "37.949039",
            "lon+": "46.055145",
            "lat-": "37.949039",
            "lon-": "46.055145",
            "city": "خسروشهر",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.985561",
            "lon": "46.431812",
            "lat+": "37.985561",
            "lon+": "46.431812",
            "lat-": "37.985561",
            "lon-": "46.431812",
            "city": "زرنق",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.948471",
            "lon": "47.118767",
            "lat+": "37.948471",
            "lon+": "47.118767",
            "lat-": "37.948471",
            "lon-": "47.118767",
            "city": "دوزدوزان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "36.294332061214803",
            "lon": "59.6042823748205",
            "lat+": "36.297975999999998",
            "lon+": "59.610266299999999",
            "lat-": "36.290960900000002",
            "lon-": "59.597965700000003",
            "city": "سراب",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "36.342956937291198",
            "lon": "59.635315852130702",
            "lat+": "36.3592735",
            "lon+": "59.646108699999999",
            "lat-": "36.3281457",
            "lon-": "59.624769000000001",
            "city": "خواجه",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.586185",
            "lon": "45.830288",
            "lat+": "38.586185",
            "lon+": "45.830288",
            "lat-": "38.586185",
            "lon-": "45.830288",
            "city": "زنوز",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.023966991172401",
            "lon": "46.153019721237897",
            "lat+": "38.027439100000002",
            "lon+": "46.156396800000003",
            "lat-": "38.020846800000001",
            "lon-": "46.1492729",
            "city": "سردرود",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "36.336476407183497",
            "lon": "59.653951750704998",
            "lat+": "36.351868600000003",
            "lon+": "59.672297800000003",
            "lat-": "36.320703199999997",
            "lon-": "59.642342900000003",
            "city": "سیس",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.241792582939397",
            "lon": "45.746394032726698",
            "lat+": "38.481963",
            "lon+": "46.344925400000001",
            "lat-": "37.998194099999999",
            "lon-": "45.084802000000003",
            "city": "شبستر",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.868874",
            "lon": "46.002968",
            "lat+": "38.868874",
            "lon+": "46.002968",
            "lat-": "38.868874",
            "lon-": "46.002968",
            "city": "سیه رود",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.175526",
            "lon": "45.490078",
            "lat+": "38.175526",
            "lon+": "45.490078",
            "lat-": "38.175526",
            "lon-": "45.490078",
            "city": "شرفخانه",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "35.741512",
            "lon": "51.289787",
            "lat+": "35.741512",
            "lon+": "51.289787",
            "lat-": "35.741512",
            "lon-": "51.289787",
            "city": "شربیان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "35.582264",
            "lon": "51.453079",
            "lat+": "35.582264",
            "lon+": "51.453079",
            "lat-": "35.582264",
            "lon-": "51.453079",
            "city": "شهرجدیدسهند",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.142662",
            "lon": "45.623928",
            "lat+": "38.142662",
            "lon+": "45.623928",
            "lat-": "38.142662",
            "lon-": "45.623928",
            "city": "شندآباد",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.547770355693203",
            "lon": "46.025646750912003",
            "lat+": "37.702602300000002",
            "lon+": "46.331822299999999",
            "lat-": "37.374924999999998",
            "lon-": "45.7058885",
            "city": "عجب شیر",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "34.075909",
            "lon": "49.669930",
            "lat+": "34.075909",
            "lon+": "49.669930",
            "lat-": "34.075909",
            "lon-": "49.669930",
            "city": "صوفیان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.457733",
            "lon": "45.568016",
            "lat+": "38.457733",
            "lon+": "45.568016",
            "lat-": "38.457733",
            "lon-": "45.568016",
            "city": "کشکسرای",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.102547",
            "lon": "46.991222",
            "lat+": "38.102547",
            "lon+": "46.991222",
            "lat-": "38.102547",
            "lon-": "46.991222",
            "city": "کلوانق",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.081158",
            "lon": "46.267830",
            "lat+": "38.081158",
            "lon+": "46.267830",
            "lat-": "38.081158",
            "lon-": "46.267830",
            "city": "قره آغاج",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "35.701202",
            "lon": "51.458149",
            "lat+": "35.701202",
            "lon+": "51.458149",
            "lat-": "35.701202",
            "lon-": "51.458149",
            "city": "کوزه کنان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.937591803823501",
            "lon": "47.138108595950797",
            "lat+": "39.287144400000003",
            "lon+": "47.526145200000002",
            "lat-": "38.611746099999998",
            "lon-": "46.683494799999998",
            "city": "کلیبر",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.779453",
            "lon": "45.902534",
            "lat+": "37.779453",
            "lon+": "45.902534",
            "lat-": "37.779453",
            "lon-": "45.902534",
            "city": "گوگان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.013344",
            "lon": "46.204754",
            "lat+": "37.013344",
            "lon+": "46.204754",
            "lat-": "37.013344",
            "lon-": "46.204754",
            "city": "لیلان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.3610269272775",
            "lon": "46.4211561198304",
            "lat+": "37.736606299999998",
            "lon+": "46.721280999999998",
            "lat-": "37.015703600000002",
            "lon-": "46.1337683",
            "city": "مراغه",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.5578299346177",
            "lon": "45.659079785653901",
            "lat+": "38.880144199999997",
            "lon+": "46.199561799999998",
            "lat-": "38.291122999999999",
            "lon-": "45.2024556",
            "city": "مرند",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.466516778055201",
            "lon": "47.723731220472601",
            "lat+": "37.892368900000001",
            "lon+": "48.342766099999999",
            "lat-": "37.075451700000002",
            "lon-": "47.208670900000001",
            "city": "میانه",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.821331",
            "lon": "45.972668",
            "lat+": "37.821331",
            "lon+": "45.972668",
            "lat-": "37.821331",
            "lon-": "45.972668",
            "city": "ممقان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.129211",
            "lon": "45.713150",
            "lat+": "38.129211",
            "lon+": "45.713150",
            "lat-": "38.129211",
            "lon-": "45.713150",
            "city": "وایقان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.347775",
            "lon": "46.762825",
            "lat+": "37.347775",
            "lon+": "46.762825",
            "lat-": "37.347775",
            "lon-": "46.762825",
            "city": "نظرکهریزی",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.082001",
            "lon": "47.131378",
            "lat+": "38.082001",
            "lon+": "47.131378",
            "lat-": "38.082001",
            "lon-": "47.131378",
            "city": "مهربان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.127159946308097",
            "lon": "46.202758168407698",
            "lat+": "37.283659499999999",
            "lon+": "46.442270999999998",
            "lat-": "36.939694799999998",
            "lon-": "45.910789899999997",
            "city": "ملکان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.838139",
            "lon": "45.663807",
            "lat+": "38.838139",
            "lon+": "45.663807",
            "lat-": "38.838139",
            "lon-": "45.663807",
            "city": "هادیشهر",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.600535756514397",
            "lon": "46.452456302897602",
            "lat+": "38.794930700000002",
            "lon+": "46.8692007",
            "lat-": "38.3714941",
            "lon-": "46.025773899999997",
            "city": "ورزقان",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.227694815489201",
            "lon": "46.823401591984997",
            "lat+": "38.404369600000003",
            "lon+": "47.380702800000002",
            "lat-": "38.053643399999999",
            "lon-": "46.373531300000003",
            "city": "هریس",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.4241905484513",
            "lon": "46.904764668147997",
            "lat+": "37.641285500000002",
            "lon+": "47.317837500000003",
            "lat-": "37.147683000000001",
            "lon-": "46.466689000000002",
            "city": "هشترود",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.809135",
            "lon": "47.384281",
            "lat+": "38.809135",
            "lon+": "47.384281",
            "lat-": "38.809135",
            "lon-": "47.384281",
            "city": "هوراند",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "38.523193",
            "lon": "45.639389",
            "lat+": "38.523193",
            "lon+": "45.639389",
            "lat-": "38.523193",
            "lon-": "45.639389",
            "city": "یامچی",
            "province": "آذربایجان شرقی"
        },
        {
            "lat": "37.617095864462598",
            "lon": "44.927999617726897",
            "lat+": "38.158959299999999",
            "lon+": "45.431850900000001",
            "lat-": "37.1154589",
            "lon-": "44.395717300000001",
            "city": "ارومیه",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "38.716801",
            "lon": "45.210644",
            "lat+": "38.716801",
            "lon+": "45.210644",
            "lat-": "38.716801",
            "lon-": "45.210644",
            "city": "ایواوغلی",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "37.069007880897203",
            "lon": "45.0588687068146",
            "lat+": "37.282554699999999",
            "lon+": "45.262628100000001",
            "lat-": "36.890445399999997",
            "lon-": "44.748040500000002",
            "city": "اشنویه",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "39.331772",
            "lon": "44.156258",
            "lat+": "39.331772",
            "lon+": "44.156258",
            "lat-": "39.331772",
            "lon-": "44.156258",
            "city": "آواجیق",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.952908",
            "lon": "46.322491",
            "lat+": "36.952908",
            "lon+": "46.322491",
            "lat-": "36.952908",
            "lon-": "46.322491",
            "city": "باروق",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "35.654457",
            "lon": "51.339443",
            "lat+": "35.654457",
            "lon+": "51.339443",
            "lat-": "35.654457",
            "lon-": "51.339443",
            "city": "بازرگان",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.507385",
            "lon": "45.796844",
            "lat+": "36.507385",
            "lon+": "45.796844",
            "lat-": "36.507385",
            "lon-": "45.796844",
            "city": "خلیفان",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.5566706597142",
            "lon": "46.141461604489201",
            "lat+": "36.865880199999999",
            "lon+": "46.505541700000002",
            "lat-": "36.216079000000001",
            "lon-": "45.696918599999997",
            "city": "بوکان",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "38.258732",
            "lon": "48.295738",
            "lat+": "38.258732",
            "lon+": "48.295738",
            "lat-": "38.258732",
            "lon-": "48.295738",
            "city": "تازه شهر",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.681302208623997",
            "lon": "45.225220127853198",
            "lat+": "36.932398800000001",
            "lon+": "45.561512700000002",
            "lat-": "36.404397699999997",
            "lon-": "44.836644100000001",
            "city": "پیرانشهر",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "39.1999620472792",
            "lon": "45.091304615656803",
            "lat+": "39.598380900000002",
            "lon+": "45.461093099999999",
            "lat-": "38.935654399999997",
            "lon-": "44.769050300000004",
            "city": "پلدشت",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "37.124310",
            "lon": "45.974701",
            "lat+": "37.124310",
            "lon+": "45.974701",
            "lat-": "37.124310",
            "lon-": "45.974701",
            "city": "چهاربرج",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.505685749248798",
            "lon": "47.124048250151503",
            "lat+": "36.837046999999998",
            "lon+": "47.396033099999997",
            "lat-": "36.243562099999998",
            "lon-": "46.807920799999998",
            "city": "تکاب",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "38.461414",
            "lon": "45.023605",
            "lat+": "38.461414",
            "lon+": "45.023605",
            "lat-": "38.461414",
            "lon-": "45.023605",
            "city": "دیزج دیز",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "37.423981",
            "lon": "44.851948",
            "lat+": "37.423981",
            "lon+": "44.851948",
            "lat-": "37.423981",
            "lon-": "44.851948",
            "city": "سیلوانه",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.211445",
            "lon": "45.552654",
            "lat+": "36.211445",
            "lon+": "45.552654",
            "lat-": "36.211445",
            "lon-": "45.552654",
            "city": "ربط",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "38.604780865370699",
            "lon": "44.761679566682801",
            "lat+": "38.976030299999998",
            "lon+": "45.344419600000002",
            "lat-": "38.315762900000003",
            "lon-": "44.251814699999997",
            "city": "خوی",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.730263",
            "lon": "46.153431",
            "lat+": "36.730263",
            "lon+": "46.153431",
            "lat-": "36.730263",
            "lon-": "46.153431",
            "city": "سیمینه",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "35.7783833279505",
            "lon": "51.352753568178201",
            "lat+": "35.784582999999998",
            "lon+": "51.363399600000001",
            "lat-": "35.771194299999998",
            "lon-": "51.343121099999998",
            "city": "سرو",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "39.138037998997497",
            "lon": "44.837953723881803",
            "lat+": "39.357557499999999",
            "lon+": "45.057524600000001",
            "lat-": "38.945799800000003",
            "lon-": "44.646078600000003",
            "city": "شوط",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "38.1391244651861",
            "lon": "44.6550261384767",
            "lat+": "38.369647399999998",
            "lon+": "45.104297600000002",
            "lat-": "37.845559899999998",
            "lon-": "44.221807599999998",
            "city": "سلماس",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.230435545706399",
            "lon": "45.460908031167499",
            "lat+": "36.476326999999998",
            "lon+": "45.7021072",
            "lat-": "35.968154499999997",
            "lon-": "45.237242199999997",
            "city": "سردشت",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "38.1319032677713",
            "lon": "45.023242137138901",
            "lat+": "38.133230400000002",
            "lon+": "45.084816099999998",
            "lat-": "38.086329399999997",
            "lon-": "45.0000517",
            "city": "قوشچی",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "39.444196433896799",
            "lon": "44.589334584843797",
            "lat+": "39.771215499999997",
            "lon+": "44.880271399999998",
            "lat-": "39.135004899999998",
            "lon-": "44.286476700000001",
            "city": "ماکو",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "35.848838970675303",
            "lon": "51.004551154182899",
            "lat+": "35.849896000000001",
            "lon+": "51.004847099999999",
            "lat-": "35.848250899999996",
            "lon-": "51.003566999999997",
            "city": "سیه چشمه",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "35.776887250000001",
            "lon": "51.488006499999997",
            "lat+": "35.777038599999997",
            "lon+": "51.488259599999999",
            "lat-": "35.776735899999998",
            "lon-": "51.487753400000003",
            "city": "محمدیار",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.677431203746899",
            "lon": "46.644376640256603",
            "lat+": "36.934842500000002",
            "lon+": "46.988076100000001",
            "lat-": "36.395288399999998",
            "lon-": "46.242159299999997",
            "city": "شاهین دژ",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "38.073702426000203",
            "lon": "46.316329826564903",
            "lat+": "38.079716900000001",
            "lon+": "46.325890999999999",
            "lat-": "38.066220199999997",
            "lon-": "46.304969800000002",
            "city": "قره ضیاءالدین",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.605561838686597",
            "lon": "52.334672930174897",
            "lat+": "36.685544800000002",
            "lon+": "52.484220899999997",
            "lat-": "36.5293098",
            "lon-": "52.181385300000002",
            "city": "محمودآباد",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.545441408062501",
            "lon": "45.239975744211897",
            "lat+": "36.577869499999998",
            "lon+": "45.363579700000003",
            "lat-": "36.4327471",
            "lon-": "45.213967500000003",
            "city": "میرآباد",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.247371770159099",
            "lon": "59.690770936804803",
            "lat+": "36.2645464",
            "lon+": "59.721704099999997",
            "lat-": "36.230529199999999",
            "lon-": "59.663497499999998",
            "city": "کشاورز",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "39.302929829812904",
            "lon": "47.507938040010004",
            "lat+": "39.433760999999997",
            "lon+": "47.5285461",
            "lat-": "39.264637499999999",
            "lon-": "47.396298399999999",
            "city": "اصلاندوز",
            "province": "اردبیل"
        },
        {
            "lat": "37.011326011647299",
            "lon": "46.1957519189301",
            "lat+": "37.293213999999999",
            "lon+": "46.894998600000001",
            "lat-": "36.787262400000003",
            "lon-": "45.609630799999998",
            "city": "میاندوآب",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.9776088804648",
            "lon": "45.446706646584197",
            "lat+": "37.166482500000001",
            "lon+": "45.696129499999998",
            "lat-": "36.753554800000003",
            "lon-": "45.235087200000002",
            "city": "نقده",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "36.661737000872797",
            "lon": "45.736529809146901",
            "lat+": "37.043543",
            "lon+": "46.0638814",
            "lat-": "36.271771200000003",
            "lon-": "45.438863499999997",
            "city": "مهاباد",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "31.329743167848399",
            "lon": "48.6337328913826",
            "lat+": "31.330009799999999",
            "lon+": "48.644162299999998",
            "lat-": "31.324247700000001",
            "lon-": "48.633229399999998",
            "city": "نوشین",
            "province": "آذربایجان غربی"
        },
        {
            "lat": "37.293390600301798",
            "lon": "49.708818013141098",
            "lat+": "37.366644999999998",
            "lon+": "49.712343099999998",
            "lat-": "37.277078500000002",
            "lon-": "49.683497299999999",
            "city": "جعفرآباد",
            "province": "اردبیل"
        },
        {
            "lat": "34.382638354015398",
            "lon": "47.119000842985002",
            "lat+": "34.3841331",
            "lon+": "47.123262400000002",
            "lat-": "34.380166299999999",
            "lon-": "47.112555",
            "city": "تازه کندانگوت",
            "province": "اردبیل"
        },
        {
            "lat": "37.426862092314501",
            "lon": "48.541842556187298",
            "lat+": "37.872598500000002",
            "lon+": "48.922960500000002",
            "lat-": "37.102777099999997",
            "lon-": "48.146104700000002",
            "city": "خلخال",
            "province": "اردبیل"
        },
        {
            "lat": "38.193239443767503",
            "lon": "48.009060268367399",
            "lat+": "38.263464300000003",
            "lon+": "48.247802999999998",
            "lat-": "38.098211900000003",
            "lon-": "47.7801714",
            "city": "سرعین",
            "province": "اردبیل"
        },
        {
            "lat": "38.262754492568298",
            "lon": "48.271164550641402",
            "lat+": "38.641713199999998",
            "lon+": "48.687978800000003",
            "lat-": "37.929040499999999",
            "lon-": "47.846085000000002",
            "city": "اردبیل",
            "province": "اردبیل"
        },
        {
            "lat": "38.264517669867502",
            "lon": "48.501925875485497",
            "lat+": "38.276046399999998",
            "lon+": "48.540678700000001",
            "lat-": "38.241296499999997",
            "lon-": "48.313786399999998",
            "city": "آبی بیگلو",
            "province": "اردبیل"
        },
        {
            "lat": "39.340009561713998",
            "lon": "47.972991986007401",
            "lat+": "39.5625918",
            "lon+": "48.367623999999999",
            "lat-": "39.122205999999998",
            "lon-": "47.616638999999999",
            "city": "بیله سوار",
            "province": "اردبیل"
        },
        {
            "lat": "37.6676681",
            "lon": "45.025371",
            "lat+": "37.671628699999999",
            "lon+": "45.047133100000003",
            "lat-": "37.663467300000001",
            "lon-": "45.018228299999997",
            "city": "تازه کند",
            "province": "اردبیل"
        },
        {
            "lat": "39.474634762111101",
            "lon": "47.736211643833997",
            "lat+": "39.705692599999999",
            "lon+": "48.171275700000002",
            "lat-": "39.209664799999999",
            "lon-": "47.3628231",
            "city": "پارس آباد",
            "province": "اردبیل"
        },
        {
            "lat": "29.611000701162499",
            "lon": "52.524353988997099",
            "lat+": "29.6153078",
            "lon+": "52.529754699999998",
            "lat-": "29.6066331",
            "lon-": "52.518253299999998",
            "city": "فخرآباد",
            "province": "اردبیل"
        },
        {
            "lat": "35.742238918409697",
            "lon": "51.466601953609803",
            "lat+": "35.743140799999999",
            "lon+": "51.468180599999997",
            "lat-": "35.742136000000002",
            "lon-": "51.463557299999998",
            "city": "کلور",
            "province": "اردبیل"
        },
        {
            "lat": "35.637825424750297",
            "lon": "51.409343487818902",
            "lat+": "35.642592100000002",
            "lon+": "51.4101116",
            "lat-": "35.636423600000001",
            "lon-": "51.4090895",
            "city": "گیوی",
            "province": "اردبیل"
        },
        {
            "lat": "35.6882970648428",
            "lon": "51.342129477149498",
            "lat+": "35.688322999999997",
            "lon+": "51.343327700000003",
            "lat-": "35.688296399999999",
            "lon-": "51.342066600000003",
            "city": "رضی",
            "province": "اردبیل"
        },
        {
            "lat": "39.032294155278898",
            "lon": "47.8789947121832",
            "lat+": "39.224483399999997",
            "lon+": "48.336581799999998",
            "lat-": "38.827797699999998",
            "lon-": "47.499795599999999",
            "city": "گرمی",
            "province": "اردبیل"
        },
        {
            "lat": "38.390404086296599",
            "lon": "48.467106504346702",
            "lat+": "38.613711199999997",
            "lon+": "48.689357299999998",
            "lat-": "38.159837000000003",
            "lon-": "48.279520900000001",
            "city": "نمین",
            "province": "اردبیل"
        },
        {
            "lat": "37.545987090432298",
            "lon": "48.436601760872797",
            "lat+": "37.620728100000001",
            "lon+": "48.5125387",
            "lat-": "37.529609999999998",
            "lon-": "48.418810000000001",
            "city": "هشتجین",
            "province": "اردبیل"
        },
        {
            "lat": "32.367576281867002",
            "lon": "52.246980945470597",
            "lat+": "32.427746900000002",
            "lon+": "52.372115100000002",
            "lat-": "32.306109499999998",
            "lon-": "52.193092300000004",
            "city": "اژیه",
            "province": "اصفهان"
        },
        {
            "lat": "35.728009020391603",
            "lon": "51.4555702156553",
            "lat+": "35.728284199999997",
            "lon+": "51.455669200000003",
            "lat-": "35.7274502",
            "lon-": "51.455535699999999",
            "city": "انارک",
            "province": "اصفهان"
        },
        {
            "lat": "36.594868499999997",
            "lon": "50.252273099999996",
            "lat+": "36.596431299999999",
            "lon+": "50.266490300000001",
            "lat-": "36.593324500000001",
            "lon-": "50.250293200000002",
            "city": "هیر",
            "province": "اردبیل"
        },
        {
            "lat": "38.558067065603701",
            "lon": "47.765259022815599",
            "lat+": "38.899902599999997",
            "lon+": "48.292127899999997",
            "lat-": "38.182593199999999",
            "lon-": "47.292544700000001",
            "city": "مشگین شهر",
            "province": "اردبیل"
        },
        {
            "lat": "37.991017645728803",
            "lon": "48.106707062500902",
            "lat+": "38.1894578",
            "lon+": "48.3713129",
            "lat-": "37.8007852",
            "lon-": "47.824701599999997",
            "city": "نیر",
            "province": "اردبیل"
        },
        {
            "lat": "33.862501111884399",
            "lon": "51.688113854080903",
            "lat+": "33.941488800000002",
            "lon+": "51.689807600000002",
            "lat-": "33.862176400000003",
            "lon-": "51.506673800000002",
            "city": "بادرود",
            "province": "اصفهان"
        },
        {
            "lat": "34.385154582345599",
            "lon": "47.1159265194349",
            "lat+": "34.386488200000002",
            "lon+": "47.120687500000003",
            "lat-": "34.383902900000002",
            "lon-": "47.109787699999998",
            "city": "ابریشم",
            "province": "اصفهان"
        },
        {
            "lat": "33.5889821214504",
            "lon": "52.612799657163599",
            "lat+": "34.429142599999999",
            "lon+": "53.219484299999998",
            "lat-": "32.876055100000002",
            "lon-": "51.824191999999996",
            "city": "اردستان",
            "province": "اصفهان"
        },
        {
            "lat": "32.245853541835302",
            "lon": "52.442471460304603",
            "lat+": "33.011699100000001",
            "lon+": "53.2038212",
            "lat-": "31.490936300000001",
            "lon-": "51.5253224",
            "city": "اصفهان",
            "province": "اصفهان"
        },
        {
            "lat": "34.171535409024003",
            "lon": "51.872504746664603",
            "lat+": "34.504502899999999",
            "lon+": "52.425609399999999",
            "lat-": "33.7892291",
            "lon-": "51.297368300000002",
            "city": "آران وبیدگل",
            "province": "اصفهان"
        },
        {
            "lat": "32.368906306892697",
            "lon": "51.235187660667798",
            "lat+": "32.3689514",
            "lon+": "51.238759299999998",
            "lat-": "32.3686182",
            "lon-": "51.2341908",
            "city": "باغ بهادران",
            "province": "اصفهان"
        },
        {
            "lat": "35.500554215093601",
            "lon": "54.4523137738041",
            "lat+": "36.1339592",
            "lon+": "54.562833500000004",
            "lat-": "35.145770300000002",
            "lon-": "54.285567299999997",
            "city": "جندق",
            "province": "اصفهان"
        },
        {
            "lat": "34.228772954173003",
            "lon": "50.904070155701604",
            "lat+": "34.233078200000001",
            "lon+": "50.910218200000003",
            "lat-": "34.227276500000002",
            "lon-": "50.902711199999999",
            "city": "برف انبار",
            "province": "اصفهان"
        },
        {
            "lat": "33.156538510010101",
            "lon": "50.089558958258003",
            "lat+": "33.359484999999999",
            "lon+": "50.328739300000002",
            "lat-": "32.971796699999999",
            "lon-": "49.868134599999998",
            "city": "بوئین ومیاندشت",
            "province": "اصفهان"
        },
        {
            "lat": "32.783228945745897",
            "lon": "50.959171098910801",
            "lat+": "33.0553332",
            "lon+": "51.242797000000003",
            "lat-": "32.507945100000001",
            "lon-": "50.547681500000003",
            "city": "تیران",
            "province": "اصفهان"
        },
        {
            "lat": "32.650754592705098",
            "lon": "51.727530862228797",
            "lat+": "32.6545165",
            "lon+": "51.737462299999997",
            "lat-": "32.647738799999999",
            "lon-": "51.721189299999999",
            "city": "بهاران شهر",
            "province": "اصفهان"
        },
        {
            "lat": "35.530142049660398",
            "lon": "51.170719628268301",
            "lat+": "35.5955905",
            "lon+": "51.2174701",
            "lat-": "35.4703053",
            "lon-": "51.123974699999998",
            "city": "بهارستان",
            "province": "اصفهان"
        },
        {
            "lat": "32.660619475936599",
            "lon": "51.648197128644298",
            "lat+": "32.667092799999999",
            "lon+": "51.6531977",
            "lat-": "32.654962400000002",
            "lon-": "51.643494699999998",
            "city": "جوزدان",
            "province": "اصفهان"
        },
        {
            "lat": "32.390799967283897",
            "lon": "51.349696188931198",
            "lat+": "32.391024799999997",
            "lon+": "51.349955399999999",
            "lat-": "32.390522900000001",
            "lon-": "51.349367100000002",
            "city": "چمگردان",
            "province": "اصفهان"
        },
        {
            "lat": "32.341684869500597",
            "lon": "51.233576678813897",
            "lat+": "32.3686328",
            "lon+": "51.238263199999999",
            "lat-": "32.324889499999998",
            "lon-": "51.226330099999998",
            "city": "چرمهین",
            "province": "اصفهان"
        },
        {
            "lat": "32.748860405240997",
            "lon": "50.533093524766699",
            "lat+": "32.963443599999998",
            "lon+": "50.853928500000002",
            "lat-": "32.536534699999997",
            "lon-": "50.217296900000001",
            "city": "چادگان",
            "province": "اصفهان"
        },
        {
            "lat": "32.648809514734999",
            "lon": "51.751842978929297",
            "lat+": "32.648969299999997",
            "lon+": "51.752042799999998",
            "lat-": "32.648648799999997",
            "lon-": "51.7516538",
            "city": "خوراسگان",
            "province": "اصفهان"
        },
        {
            "lat": "31.881332843910499",
            "lon": "54.360235793944",
            "lat+": "31.8868042",
            "lon+": "54.365564999999997",
            "lat-": "31.880395100000001",
            "lon-": "54.3587165",
            "city": "حنا",
            "province": "اصفهان"
        },
        {
            "lat": "32.475623411189297",
            "lon": "51.770532741448797",
            "lat+": "32.476025800000002",
            "lon+": "51.771659800000002",
            "lat-": "32.475491900000002",
            "lon-": "51.7671171",
            "city": "دامنه",
            "province": "اصفهان"
        },
        {
            "lat": "32.827293747659503",
            "lon": "51.859988305714303",
            "lat+": "32.832366700000001",
            "lon+": "52.121929600000001",
            "lat-": "32.707765799999997",
            "lon-": "51.794359300000004",
            "city": "حبیب آباد",
            "province": "اصفهان"
        },
        {
            "lat": "32.617625694227698",
            "lon": "51.567384448705901",
            "lat+": "32.617908499999999",
            "lon+": "51.567962799999997",
            "lat-": "32.617377599999998",
            "lon-": "51.565725100000002",
            "city": "درچه پیاز",
            "province": "اصفهان"
        },
        {
            "lat": "32.814499751716603",
            "lon": "50.974365407140297",
            "lat+": "32.933307999999997",
            "lon+": "51.074891700000002",
            "lat-": "32.751256499999997",
            "lon-": "50.715738999999999",
            "city": "داران",
            "province": "اصفهان"
        },
        {
            "lat": "34.841004777188601",
            "lon": "48.5541718965736",
            "lat+": "34.847824699999997",
            "lon+": "48.568119799999998",
            "lat-": "34.834175999999999",
            "lon-": "48.538604800000002",
            "city": "حسن آباد",
            "province": "اصفهان"
        },
        {
            "lat": "33.249765377630901",
            "lon": "50.381405013707599",
            "lat+": "33.415792199999999",
            "lon+": "50.697843800000001",
            "lat-": "33.075717099999999",
            "lon-": "50.022455100000002",
            "city": "خوانسار",
            "province": "اصفهان"
        },
        {
            "lat": "33.794565191224699",
            "lon": "54.915801560344804",
            "lat+": "34.249682800000002",
            "lon+": "55.494326899999997",
            "lat-": "33.093586500000001",
            "lon-": "54.1705325",
            "city": "خور",
            "province": "اصفهان"
        },
        {
            "lat": "31.979446699433101",
            "lon": "51.615193227458498",
            "lat+": "32.256166399999998",
            "lon+": "51.801124000000002",
            "lat-": "31.754936799999999",
            "lon-": "51.376656699999998",
            "city": "دهاقان",
            "province": "اصفهان"
        },
        {
            "lat": "32.682338195372402",
            "lon": "51.5109296469385",
            "lat+": "32.768999999999998",
            "lon+": "51.590344600000002",
            "lat-": "32.590293299999999",
            "lon-": "51.4132003",
            "city": "خمینی شهر",
            "province": "اصفهان"
        },
        {
            "lat": "32.622285322954298",
            "lon": "51.604711592177601",
            "lat+": "32.6231309",
            "lon+": "51.605159299999997",
            "lat-": "32.618127600000001",
            "lon-": "51.603315600000002",
            "city": "دستگرد",
            "province": "اصفهان"
        },
        {
            "lat": "32.391989970238797",
            "lon": "51.455096926516497",
            "lat+": "32.392826700000001",
            "lon+": "51.499845399999998",
            "lat-": "32.388775299999999",
            "lon-": "51.429594700000003",
            "city": "دیزیچه",
            "province": "اصفهان"
        },
        {
            "lat": "38.112830575338201",
            "lon": "46.290116641387399",
            "lat+": "38.125239499999999",
            "lon+": "46.304755200000002",
            "lat-": "38.099915199999998",
            "lon-": "46.269435799999997",
            "city": "رضوانشهر",
            "province": "اصفهان"
        },
        {
            "lat": "35.423114655682397",
            "lon": "51.584966893639603",
            "lat+": "35.423339200000001",
            "lon+": "51.5852608",
            "lat-": "35.423054100000002",
            "lon-": "51.584912099999997",
            "city": "زیباشهر",
            "province": "اصفهان"
        },
        {
            "lat": "35.7420023404934",
            "lon": "51.4548643226167",
            "lat+": "35.742374499999997",
            "lon+": "51.458528700000002",
            "lat-": "35.741371899999997",
            "lon-": "51.452838100000001",
            "city": "زواره",
            "province": "اصفهان"
        },
        {
            "lat": "35.8091290713676",
            "lon": "50.970203309174202",
            "lat+": "35.815214900000001",
            "lon+": "50.978768000000002",
            "lat-": "35.801138600000002",
            "lon-": "50.962889300000001",
            "city": "دولت آباد",
            "province": "اصفهان"
        },
        {
            "lat": "35.850738900000003",
            "lon": "50.919419699999999",
            "lat+": "35.851060199999999",
            "lon+": "50.922275399999997",
            "lat-": "35.850013099999998",
            "lon-": "50.918092100000003",
            "city": "دهق",
            "province": "اصفهان"
        },
        {
            "lat": "31.281193318735301",
            "lon": "51.600143610843297",
            "lat+": "31.852073799999999",
            "lon+": "51.9691592",
            "lat-": "30.701300400000001",
            "lon-": "51.2584175",
            "city": "سمیرم",
            "province": "اصفهان"
        },
        {
            "lat": "32.6861798856552",
            "lon": "51.669579722870402",
            "lat+": "32.686319699999999",
            "lon+": "51.670098600000003",
            "lat-": "32.686156699999998",
            "lon-": "51.669438700000001",
            "city": "عسگران",
            "province": "اصفهان"
        },
        {
            "lat": "32.6086576580512",
            "lon": "51.768308529176302",
            "lat+": "32.617278800000001",
            "lon+": "51.775964199999997",
            "lat-": "32.599202599999998",
            "lon-": "51.7612156",
            "city": "زاینده رود",
            "province": "اصفهان"
        },
        {
            "lat": "32.373013002429701",
            "lon": "51.366737670497699",
            "lat+": "32.377121000000002",
            "lon+": "51.366944699999998",
            "lat-": "32.365719400000003",
            "lon-": "51.366598600000003",
            "city": "زرین شهر",
            "province": "اصفهان"
        },
        {
            "lat": "32.376856844368803",
            "lon": "51.302289223913697",
            "lat+": "32.378008899999998",
            "lon+": "51.333902799999997",
            "lat-": "32.372727400000002",
            "lon-": "51.297555899999999",
            "city": "سده لنجان",
            "province": "اصفهان"
        },
        {
            "lat": "32.514583492853603",
            "lon": "51.536890419094398",
            "lat+": "32.618487700000003",
            "lon+": "51.681355799999999",
            "lat-": "32.422863300000003",
            "lon-": "51.419789799999997",
            "city": "فلاورجان",
            "province": "اصفهان"
        },
        {
            "lat": "32.852278098668002",
            "lon": "50.002045918578403",
            "lat+": "33.0808252",
            "lon+": "50.324692200000001",
            "lat-": "32.614712400000002",
            "lon-": "49.641263000000002",
            "city": "فریدونشهر",
            "province": "اصفهان"
        },
        {
            "lat": "31.864236690253499",
            "lon": "51.880253307095799",
            "lat+": "32.391520700000001",
            "lon+": "52.209249300000003",
            "lat-": "31.388838499999999",
            "lon-": "51.6162603",
            "city": "شهرضا",
            "province": "اصفهان"
        },
        {
            "lat": "32.594362258112298",
            "lon": "51.363788036974903",
            "lat+": "32.605656199999999",
            "lon+": "51.374819600000002",
            "lat-": "32.543236899999997",
            "lon-": "51.358782900000001",
            "city": "فولادشهر",
            "province": "اصفهان"
        },
        {
            "lat": "32.539961981343701",
            "lon": "51.428419902351898",
            "lat+": "32.565694899999997",
            "lon+": "51.445112199999997",
            "lat-": "32.503798000000003",
            "lon-": "51.409506999999998",
            "city": "قهدریجان",
            "province": "اصفهان"
        },
        {
            "lat": "32.7040176532591",
            "lon": "51.791217234147197",
            "lat+": "32.7061943",
            "lon+": "51.805106299999998",
            "lat-": "32.703278300000001",
            "lon-": "51.7638563",
            "city": "قهجاورستان",
            "province": "اصفهان"
        },
        {
            "lat": "32.860647186106803",
            "lon": "51.553004714741903",
            "lat+": "32.861015399999999",
            "lon+": "51.5534423",
            "lat-": "32.860289700000003",
            "lon-": "51.552574499999999",
            "city": "شاهین شهر",
            "province": "اصفهان"
        },
        {
            "lat": "33.842526566118799",
            "lon": "51.482693808626699",
            "lat+": "33.876623000000002",
            "lon+": "51.495704699999997",
            "lat-": "33.755033699999998",
            "lon-": "51.453996799999999",
            "city": "قمصر",
            "province": "اصفهان"
        },
        {
            "lat": "32.685121150000001",
            "lon": "51.683133300000001",
            "lat+": "32.685275099999998",
            "lon+": "51.683202199999997",
            "lat-": "32.684967200000003",
            "lon-": "51.683064399999999",
            "city": "گرگاب",
            "province": "اصفهان"
        },
        {
            "lat": "32.702926374775402",
            "lon": "51.633094474237303",
            "lat+": "32.703207999999997",
            "lon+": "51.633429999999997",
            "lat-": "32.702645500000003",
            "lon-": "51.632760300000001",
            "city": "فرخی",
            "province": "اصفهان"
        },
        {
            "lat": "33.493297261398801",
            "lon": "50.352832192014098",
            "lat+": "33.520926500000002",
            "lon+": "50.354905799999997",
            "lat-": "33.485081000000001",
            "lon-": "50.348777300000002",
            "city": "گوگد",
            "province": "اصفهان"
        },
        {
            "lat": "33.920791125878999",
            "lon": "51.2783012639322",
            "lat+": "34.4443451",
            "lon+": "51.815725399999998",
            "lat-": "33.495893899999999",
            "lon-": "50.913410499999998",
            "city": "کاشان",
            "province": "اصفهان"
        },
        {
            "lat": "35.767320550533299",
            "lon": "51.314045469221803",
            "lat+": "35.767331900000002",
            "lon+": "51.3147132",
            "lat-": "35.767308999999997",
            "lon-": "51.313390499999997",
            "city": "کوهپایه",
            "province": "اصفهان"
        },
        {
            "lat": "32.661556850046601",
            "lon": "51.665231440401698",
            "lat+": "32.665629699999997",
            "lon+": "51.670213599999997",
            "lat-": "32.657319899999997",
            "lon-": "51.6602143",
            "city": "کوشک",
            "province": "اصفهان"
        },
        {
            "lat": "33.447081253186703",
            "lon": "50.386485034047098",
            "lat+": "33.652636999999999",
            "lon+": "50.767189700000003",
            "lat-": "33.235170799999999",
            "lon-": "49.947540799999999",
            "city": "گلپایگان",
            "province": "اصفهان"
        },
        {
            "lat": "35.7430339387383",
            "lon": "51.562995838176498",
            "lat+": "35.748747299999998",
            "lon+": "51.5732456",
            "lat-": "35.7361571",
            "lon-": "51.554981699999999",
            "city": "گلشن",
            "province": "اصفهان"
        },
        {
            "lat": "35.870431220998299",
            "lon": "50.904021753165203",
            "lat+": "35.876683399999997",
            "lon+": "50.910339499999999",
            "lat-": "35.862459800000003",
            "lon-": "50.898151499999997",
            "city": "گلدشت",
            "province": "اصفهان"
        },
        {
            "lat": "35.819603206589598",
            "lon": "50.936461655256899",
            "lat+": "35.824714800000002",
            "lon+": "50.951945899999998",
            "lat-": "35.813614000000001",
            "lon-": "50.915124499999997",
            "city": "گلشهر",
            "province": "اصفهان"
        },
        {
            "lat": "32.276749688704797",
            "lon": "51.510262350781197",
            "lat+": "32.477780699999997",
            "lon+": "51.823724300000002",
            "lat-": "32.065182900000003",
            "lon-": "51.221030499999998",
            "city": "مبارکه",
            "province": "اصفهان"
        },
        {
            "lat": "34.098976415139802",
            "lon": "51.381030971233599",
            "lat+": "34.0993335",
            "lon+": "51.381461600000002",
            "lat-": "34.098623400000001",
            "lon-": "51.380606399999998",
            "city": "محمدآباد",
            "province": "اصفهان"
        },
        {
            "lat": "38.0764779",
            "lon": "46.292029700000001",
            "lat+": "38.077155599999998",
            "lon+": "46.292752900000004",
            "lat-": "38.076136900000002",
            "lon-": "46.291620700000003",
            "city": "مشکات",
            "province": "اصفهان"
        },
        {
            "lat": "37.266938746229997",
            "lon": "56.5177771489059",
            "lat+": "37.411056100000003",
            "lon+": "56.547051099999997",
            "lat-": "37.005179400000003",
            "lon-": "56.252150899999997",
            "city": "لای بید",
            "province": "اصفهان"
        },
        {
            "lat": "33.208070388982598",
            "lon": "46.922181479903699",
            "lat+": "33.222448100000001",
            "lon+": "46.963782500000001",
            "lat-": "33.172791400000001",
            "lon-": "46.913473500000002",
            "city": "میمه",
            "province": "اصفهان"
        },
        {
            "lat": "33.402169237942402",
            "lon": "53.690845682321502",
            "lat+": "34.247942700000003",
            "lon+": "54.769245900000001",
            "lat-": "32.512198099999999",
            "lon-": "52.601509499999999",
            "city": "نائین",
            "province": "اصفهان"
        },
        {
            "lat": "34.007121859386203",
            "lon": "51.199300039930499",
            "lat+": "34.013617199999999",
            "lon+": "51.208573199999996",
            "lat-": "33.981132799999997",
            "lon-": "51.149446699999999",
            "city": "نیاسر",
            "province": "اصفهان"
        },
        {
            "lat": "32.649626762924797",
            "lon": "51.610958784733803",
            "lat+": "32.653728000000001",
            "lon+": "51.619345099999997",
            "lat-": "32.644588499999998",
            "lon-": "51.601423599999997",
            "city": "نصرآباد",
            "province": "اصفهان"
        },
        {
            "lat": "33.547779608511703",
            "lon": "51.8767112546645",
            "lat+": "33.966981099999998",
            "lon+": "52.340206299999998",
            "lat-": "33.201752399999997",
            "lon-": "51.4188227",
            "city": "نطنز",
            "province": "اصفهان"
        },
        {
            "lat": "32.240053570917702",
            "lon": "52.652201221237299",
            "lat+": "32.413977899999999",
            "lon+": "52.6657595",
            "lat-": "32.175299799999998",
            "lon-": "52.621054100000002",
            "city": "ورزنه",
            "province": "اصفهان"
        },
        {
            "lat": "32.264800981284701",
            "lon": "51.3272453324604",
            "lat+": "32.345303100000002",
            "lon+": "51.372937399999998",
            "lat-": "32.134318499999999",
            "lon-": "51.185970900000001",
            "city": "ورنامخواست",
            "province": "اصفهان"
        },
        {
            "lat": "35.676329799999998",
            "lon": "51.370851350000002",
            "lat+": "35.676349799999997",
            "lon+": "51.371075400000002",
            "lat-": "35.676309799999999",
            "lon-": "51.370627300000002",
            "city": "وزوان",
            "province": "اصفهان"
        },
        {
            "lat": "38.051896389124202",
            "lon": "46.274942242381002",
            "lat+": "38.059209000000003",
            "lon+": "46.283383299999997",
            "lat-": "38.041264099999999",
            "lon-": "46.263813900000002",
            "city": "منظریه",
            "province": "اصفهان"
        },
        {
            "lat": "34.0092983283851",
            "lon": "51.436580848171097",
            "lat+": "34.012701300000003",
            "lon+": "51.438929899999998",
            "lat-": "34.002502300000003",
            "lon-": "51.435523600000003",
            "city": "نوش آباد",
            "province": "اصفهان"
        },
        {
            "lat": "32.960074735137603",
            "lon": "51.054819701180698",
            "lat+": "33.316725599999998",
            "lon+": "51.4931646",
            "lat-": "32.490079299999998",
            "lon-": "50.602635499999998",
            "city": "نجف آباد",
            "province": "اصفهان"
        },
        {
            "lat": "35.708510894737799",
            "lon": "50.421491386851002",
            "lat+": "35.857324400000003",
            "lon+": "50.749668999999997",
            "lat-": "35.544852599999999",
            "lon-": "50.163162",
            "city": "اشتهارد",
            "province": "البرز"
        },
        {
            "lat": "32.367576281867002",
            "lon": "52.246980945470597",
            "lat+": "32.427746900000002",
            "lon+": "52.372115100000002",
            "lat-": "32.306109499999998",
            "lon-": "52.193092300000004",
            "city": "نیک آباد",
            "province": "اصفهان"
        },
        {
            "lat": "32.525873993659403",
            "lon": "52.508614440583102",
            "lat+": "32.557371799999999",
            "lon+": "52.667262899999997",
            "lat-": "32.439998099999997",
            "lon-": "52.447700300000001",
            "city": "هرند",
            "province": "اصفهان"
        },
        {
            "lat": "35.7643093874984",
            "lon": "51.391913977109297",
            "lat+": "35.787902600000002",
            "lon+": "51.396891400000001",
            "lat-": "35.750329600000001",
            "lon-": "51.386025500000002",
            "city": "ونک",
            "province": "اصفهان"
        },
        {
            "lat": "35.753326452506997",
            "lon": "51.065796140219298",
            "lat+": "35.7682784",
            "lon+": "51.086983600000003",
            "lat-": "35.735957999999997",
            "lon-": "51.042780800000003",
            "city": "گرمدره",
            "province": "البرز"
        },
        {
            "lat": "35.721604419970802",
            "lon": "50.799357634546404",
            "lat+": "35.744492100000002",
            "lon+": "50.8607339",
            "lat-": "35.693412899999998",
            "lon-": "50.742836400000002",
            "city": "ماهدشت",
            "province": "البرز"
        },
        {
            "lat": "35.956953799581797",
            "lon": "51.148765663114197",
            "lat+": "36.181361299999999",
            "lon+": "51.463854400000002",
            "lat-": "35.693006199999999",
            "lon-": "50.739850500000003",
            "city": "کرج",
            "province": "البرز"
        },
        {
            "lat": "35.752253226597503",
            "lon": "50.900523913992302",
            "lat+": "35.770611500000001",
            "lon+": "50.925750600000001",
            "lat-": "35.735226500000003",
            "lon-": "50.870303900000003",
            "city": "محمدشهر",
            "province": "البرز"
        },
        {
            "lat": "36.289146706301302",
            "lon": "59.611199876753602",
            "lat+": "36.294002599999999",
            "lon+": "59.615734000000003",
            "lat-": "36.283852199999998",
            "lon-": "59.606409300000003",
            "city": "چهارباغ",
            "province": "البرز"
        },
        {
            "lat": "32.693474440589704",
            "lon": "51.699129585005601",
            "lat+": "32.693771699999999",
            "lon+": "51.699494000000001",
            "lat-": "32.693260700000003",
            "lon-": "51.698580900000003",
            "city": "سیف آباد",
            "province": "البرز"
        },
        {
            "lat": "35.894043486907201",
            "lon": "50.514063991288602",
            "lat+": "36.038860100000001",
            "lon+": "50.674843099999997",
            "lat-": "35.759948199999997",
            "lon-": "50.332061699999997",
            "city": "نظرآباد",
            "province": "البرز"
        },
        {
            "lat": "35.794713962749",
            "lon": "51.381390751479401",
            "lat+": "35.801180500000001",
            "lon+": "51.387766300000003",
            "lat-": "35.790238199999997",
            "lon-": "51.371616500000002",
            "city": "کوهسار",
            "province": "البرز"
        },
        {
            "lat": "36.211676826520304",
            "lon": "50.771017212619",
            "lat+": "36.342407299999998",
            "lon+": "51.176857200000001",
            "lat-": "36.098112899999997",
            "lon-": "50.414407199999999",
            "city": "طالقان",
            "province": "البرز"
        },
        {
            "lat": "35.7310975623842",
            "lon": "51.358217963004897",
            "lat+": "35.733914900000002",
            "lon+": "51.358533399999999",
            "lat-": "35.729989400000001",
            "lon-": "51.358013",
            "city": "کمال شهر",
            "province": "البرز"
        },
        {
            "lat": "33.376517183926502",
            "lon": "46.735478350229002",
            "lat+": "33.398544100000002",
            "lon+": "46.747966400000003",
            "lat-": "33.3617846",
            "lon-": "46.642747",
            "city": "ارکواز",
            "province": "ایلام"
        },
        {
            "lat": "37.955726599999998",
            "lon": "46.122817737346097",
            "lat+": "37.955726599999998",
            "lon+": "46.131847299999997",
            "lat-": "37.942290399999997",
            "lon-": "46.121753099999999",
            "city": "هشتگرد",
            "province": "البرز"
        },
        {
            "lat": "33.312724457928297",
            "lon": "47.027354423318002",
            "lat+": "33.490359400000003",
            "lon+": "47.2476536",
            "lat-": "33.143692199999997",
            "lon-": "46.790031200000001",
            "city": "بدره",
            "province": "ایلام"
        },
        {
            "lat": "35.736586663516",
            "lon": "50.927738264864999",
            "lat+": "35.756891099999997",
            "lon+": "50.954503899999999",
            "lat-": "35.716413099999997",
            "lon-": "50.8994006",
            "city": "مشکین دشت",
            "province": "البرز"
        },
        {
            "lat": "32.8463530812435",
            "lon": "47.544894912103899",
            "lat+": "33.191347999999998",
            "lon+": "48.009564500000003",
            "lat-": "32.5136593",
            "lon-": "47.033580700000002",
            "city": "آبدانان",
            "province": "ایلام"
        },
        {
            "lat": "33.208070388982598",
            "lon": "46.922181479903699",
            "lat+": "33.222448100000001",
            "lon+": "46.963782500000001",
            "lat-": "33.172791400000001",
            "lon-": "46.913473500000002",
            "city": "پهله",
            "province": "ایلام"
        },
        {
            "lat": "33.884385569833398",
            "lon": "46.166001941890599",
            "lat+": "34.038021800000003",
            "lon+": "46.453357699999998",
            "lat-": "33.684680100000001",
            "lon-": "45.836831199999999",
            "city": "ایوان",
            "province": "ایلام"
        },
        {
            "lat": "33.120932964951699",
            "lon": "46.919897726810099",
            "lat+": "34.038021899999997",
            "lon+": "48.044158799999998",
            "lat-": "32.043997900000001",
            "lon-": "45.679287799999997",
            "city": "ایلام",
            "province": "ایلام"
        },
        {
            "lat": "33.803081991854697",
            "lon": "46.509857894129297",
            "lat+": "33.825159200000002",
            "lon+": "46.563775",
            "lat-": "33.786631499999999",
            "lon-": "46.489646299999997",
            "city": "آسمان آباد",
            "province": "ایلام"
        },
        {
            "lat": "38.033232202946202",
            "lon": "46.163885637802402",
            "lat+": "38.037512300000003",
            "lon+": "46.167983999999997",
            "lat-": "38.030346299999998",
            "lon-": "46.159250700000001",
            "city": "توحید",
            "province": "ایلام"
        },
        {
            "lat": "32.659172524462903",
            "lon": "47.282628753848698",
            "lat+": "33.320043099999999",
            "lon+": "48.044158699999997",
            "lat-": "32.043997900000001",
            "lon-": "46.514735299999998",
            "city": "دهلران",
            "province": "ایلام"
        },
        {
            "lat": "33.573498281913302",
            "lon": "46.7341896656581",
            "lat+": "33.5739096",
            "lon+": "46.8359922",
            "lat-": "33.535294700000001",
            "lon-": "46.691451999999998",
            "city": "لومار",
            "province": "ایلام"
        },
        {
            "lat": "33.643472467529499",
            "lon": "46.672704802908903",
            "lat+": "33.732252899999999",
            "lon+": "46.8015306",
            "lat-": "33.575091700000002",
            "lon-": "46.522327300000001",
            "city": "سرابله",
            "province": "ایلام"
        },
        {
            "lat": "32.7139547196088",
            "lon": "47.760290376601297",
            "lat+": "32.754621299999997",
            "lon+": "47.824875400000003",
            "lat-": "32.470432199999998",
            "lon-": "47.678197500000003",
            "city": "مورموری",
            "province": "ایلام"
        },
        {
            "lat": "32.529245307919098",
            "lon": "47.369469719938998",
            "lat+": "32.580008599999999",
            "lon+": "47.377848200000003",
            "lat-": "32.527788600000001",
            "lon-": "47.364477100000002",
            "city": "موسیان",
            "province": "ایلام"
        },
        {
            "lat": "35.865934539925902",
            "lon": "47.605699578747",
            "lat+": "35.866462400000003",
            "lon+": "47.6061348",
            "lat-": "35.8640404",
            "lon-": "47.605681199999999",
            "city": "سراب باغ",
            "province": "ایلام"
        },
        {
            "lat": "29.604890516086801",
            "lon": "52.590071011969997",
            "lat+": "29.6117816",
            "lon+": "52.599599400000002",
            "lat-": "29.596726199999999",
            "lon-": "52.580502000000003",
            "city": "دلگشا",
            "province": "ایلام"
        },
        {
            "lat": "33.196792391110201",
            "lon": "47.323121630155399",
            "lat+": "33.267876399999999",
            "lon+": "47.372832000000002",
            "lat-": "33.162854799999998",
            "lon-": "47.175523200000001",
            "city": "دره شهر",
            "province": "ایلام"
        },
        {
            "lat": "28.884470294451098",
            "lon": "51.220851201511998",
            "lat+": "28.997758900000001",
            "lon+": "51.239204000000001",
            "lat-": "28.866324599999999",
            "lon-": "51.030661600000002",
            "city": "اهرم",
            "province": "بوشهر"
        },
        {
            "lat": "38.077508384883402",
            "lon": "46.351578848389103",
            "lat+": "38.082503799999998",
            "lon+": "46.364321699999998",
            "lat-": "38.074125700000003",
            "lon-": "46.343421900000003",
            "city": "صالح آباد",
            "province": "ایلام"
        },
        {
            "lat": "28.968782340408701",
            "lon": "51.007055634633502",
            "lat+": "29.0460241",
            "lon+": "51.052621100000003",
            "lat-": "28.9316499",
            "lon-": "50.907509699999999",
            "city": "برازجان",
            "province": "بوشهر"
        },
        {
            "lat": "32.929095780620798",
            "lon": "47.487123261462699",
            "lat+": "32.937665600000003",
            "lon+": "47.620490099999998",
            "lat-": "32.775847400000004",
            "lon-": "47.470743800000001",
            "city": "آبدان",
            "province": "بوشهر"
        },
        {
            "lat": "34.673041508645298",
            "lon": "50.851364269793699",
            "lat+": "34.674630100000002",
            "lon+": "50.8528114",
            "lat-": "34.672647699999999",
            "lon-": "50.848236499999999",
            "city": "انارستان",
            "province": "بوشهر"
        },
        {
            "lat": "28.8249915574197",
            "lon": "51.392994160418603",
            "lat+": "30.2876592",
            "lon+": "52.935341999999999",
            "lat-": "27.2950397",
            "lon-": "50.105617000000002",
            "city": "بوشهر",
            "province": "بوشهر"
        },
        {
            "lat": "33.245720239337999",
            "lon": "46.275936856390203",
            "lat+": "33.6301737",
            "lon+": "46.681060600000002",
            "lat-": "32.895912199999998",
            "lon-": "45.8637303",
            "city": "مهران",
            "province": "ایلام"
        },
        {
            "lat": "31.9373293122907",
            "lon": "54.366676851216901",
            "lat+": "31.9579883",
            "lon+": "54.385757400000003",
            "lat-": "31.922262100000001",
            "lon-": "54.343957899999999",
            "city": "امام حسن",
            "province": "بوشهر"
        },
        {
            "lat": "32.688654526767003",
            "lon": "51.637190385277798",
            "lat+": "32.689110200000002",
            "lon+": "51.638092499999999",
            "lat-": "32.687632000000001",
            "lon-": "51.633832099999999",
            "city": "بنک",
            "province": "بوشهر"
        },
        {
            "lat": "28.884470294451098",
            "lon": "51.220851201511998",
            "lat+": "28.997758900000001",
            "lon+": "51.239204000000001",
            "lat-": "28.866324599999999",
            "lon-": "51.030661600000002",
            "city": "چغادک",
            "province": "بوشهر"
        },
        {
            "lat": "36.743429718644599",
            "lon": "53.879697762101998",
            "lat+": "36.7483006",
            "lon+": "53.905227600000003",
            "lat-": "36.732675499999999",
            "lon-": "53.797355799999998",
            "city": "بندر دیلم",
            "province": "بوشهر"
        },
        {
            "lat": "36.743429718644599",
            "lon": "53.879697762101998",
            "lat+": "36.7483006",
            "lon+": "53.905227600000003",
            "lat-": "36.732675499999999",
            "lon-": "53.797355799999998",
            "city": "بندر ریگ",
            "province": "بوشهر"
        },
        {
            "lat": "35.739428099999998",
            "lon": "51.0083731",
            "lat+": "35.745611099999998",
            "lon+": "51.010793499999998",
            "lat-": "35.736295900000002",
            "lon-": "51.007411300000001",
            "city": "تنگ ارم",
            "province": "بوشهر"
        },
        {
            "lat": "36.743429718644599",
            "lon": "53.879697762101998",
            "lat+": "36.7483006",
            "lon+": "53.905227600000003",
            "lat-": "36.732675499999999",
            "lon-": "53.797355799999998",
            "city": "بندر دیر",
            "province": "بوشهر"
        },
        {
            "lat": "36.743429718644599",
            "lon": "53.879697762101998",
            "lat+": "36.7483006",
            "lon+": "53.905227600000003",
            "lat-": "36.732675499999999",
            "lon-": "53.797355799999998",
            "city": "بندر گناوه",
            "province": "بوشهر"
        },
        {
            "lat": "36.743429718644599",
            "lon": "53.879697762101998",
            "lat+": "36.7483006",
            "lon+": "53.905227600000003",
            "lat-": "36.732675499999999",
            "lon-": "53.797355799999998",
            "city": "بندر کنگان",
            "province": "بوشهر"
        },
        {
            "lat": "29.240495733327101",
            "lon": "50.311499126757198",
            "lat+": "29.273426000000001",
            "lon+": "50.337198700000002",
            "lat-": "29.205231699999999",
            "lon-": "50.280222199999997",
            "city": "خارک",
            "province": "بوشهر"
        },
        {
            "lat": "27.937497456417901",
            "lon": "52.237176416938397",
            "lat+": "28.173125500000001",
            "lon+": "52.538378000000002",
            "lat-": "27.6725295",
            "lon-": "51.864625500000002",
            "city": "جم",
            "province": "بوشهر"
        },
        {
            "lat": "35.719330281555699",
            "lon": "51.358939502008802",
            "lat+": "35.719441099999997",
            "lon+": "51.359158200000003",
            "lat-": "35.719088499999998",
            "lon-": "51.358775100000003",
            "city": "سیراف",
            "province": "بوشهر"
        },
        {
            "lat": "27.439339654134901",
            "lon": "52.7017617976609",
            "lat+": "27.7036759",
            "lon+": "52.935341999999999",
            "lat-": "27.2724303",
            "lon-": "52.473406699999998",
            "city": "عسلویه",
            "province": "بوشهر"
        },
        {
            "lat": "28.8664251955284",
            "lon": "51.041314738170399",
            "lat+": "28.909657899999999",
            "lon+": "51.059232100000003",
            "lat-": "28.778338999999999",
            "lon-": "51.033840300000001",
            "city": "دلوار",
            "province": "بوشهر"
        },
        {
            "lat": "29.336844316291302",
            "lon": "54.4303075024403",
            "lat+": "29.909283500000001",
            "lon+": "55.281008499999999",
            "lat-": "28.708322800000001",
            "lon-": "53.408851599999998",
            "city": "ریز",
            "province": "بوشهر"
        },
        {
            "lat": "37.230355439439698",
            "lon": "49.303592847134802",
            "lat+": "37.247264700000002",
            "lon+": "49.306349500000003",
            "lat-": "37.228204699999999",
            "lon-": "49.2843327",
            "city": "شنبه",
            "province": "بوشهر"
        },
        {
            "lat": "32.62356506615",
            "lon": "51.744256294798198",
            "lat+": "32.626553600000001",
            "lon+": "51.749199300000001",
            "lat-": "32.620874200000003",
            "lon-": "51.738255199999998",
            "city": "کلمه",
            "province": "بوشهر"
        },
        {
            "lat": "35.760690817209998",
            "lon": "52.038729460496903",
            "lat+": "35.771196799999998",
            "lon+": "52.062866",
            "lat-": "35.746370900000002",
            "lon-": "51.997770699999997",
            "city": "آبعلی",
            "province": "تهران"
        },
        {
            "lat": "35.637366937662001",
            "lon": "52.160562818677001",
            "lat+": "35.655755499999998",
            "lon+": "52.1698655",
            "lat-": "35.629807",
            "lon-": "52.155830999999999",
            "city": "آبسرد",
            "province": "تهران"
        },
        {
            "lat": "35.579806137070101",
            "lon": "51.2489892635082",
            "lat+": "35.681998499999999",
            "lon+": "51.355358899999999",
            "lat-": "35.474737400000002",
            "lon-": "51.176338100000002",
            "city": "اسلامشهر",
            "province": "تهران"
        },
        {
            "lat": "35.724702965638897",
            "lon": "51.8464437704299",
            "lat+": "35.729636599999999",
            "lon+": "51.863567400000001",
            "lat-": "35.715229600000001",
            "lon-": "51.846198299999998",
            "city": "بومهن",
            "province": "تهران"
        },
        {
            "lat": "35.720393543994703",
            "lon": "51.160848445520799",
            "lat+": "35.724398399999998",
            "lon+": "51.163114999999998",
            "lat-": "35.720082599999998",
            "lon-": "51.160691",
            "city": "نخل تقی",
            "province": "بوشهر"
        },
        {
            "lat": "37.188110247313702",
            "lon": "50.138908374707299",
            "lat+": "37.188180199999998",
            "lon+": "50.138989500000001",
            "lat-": "37.187919999999998",
            "lon-": "50.138662500000002",
            "city": "ارجمند",
            "province": "تهران"
        },
        {
            "lat": "35.701346919302097",
            "lon": "51.024073744096697",
            "lat+": "35.717667400000003",
            "lon+": "51.044446899999997",
            "lat-": "35.683730300000001",
            "lon-": "51.003084100000002",
            "city": "اندیشه",
            "province": "تهران"
        },
        {
            "lat": "35.877813820701597",
            "lon": "50.955927264255301",
            "lat+": "35.889392100000002",
            "lon+": "50.969938200000001",
            "lat-": "35.862598900000002",
            "lon-": "50.942401799999999",
            "city": "باغستان",
            "province": "تهران"
        },
        {
            "lat": "35.217860244702202",
            "lon": "51.659439389966401",
            "lat+": "35.262301200000003",
            "lon+": "51.666309800000001",
            "lat-": "35.214849600000001",
            "lon-": "51.610580599999999",
            "city": "جوادآباد",
            "province": "تهران"
        },
        {
            "lat": "35.792274305947203",
            "lon": "51.430505552310798",
            "lat+": "35.807021400000004",
            "lon+": "51.435921499999999",
            "lat-": "35.778705500000001",
            "lon-": "51.423357500000002",
            "city": "تجریش",
            "province": "تهران"
        },
        {
            "lat": "35.605644783849002",
            "lon": "51.309034258578301",
            "lat+": "35.605744799999997",
            "lon+": "51.309155699999998",
            "lat-": "35.605534200000001",
            "lon-": "51.308896799999999",
            "city": "چهاردانگه",
            "province": "تهران"
        },
        {
            "lat": "35.450804198552198",
            "lon": "51.779827285413397",
            "lat+": "35.587335699999997",
            "lon+": "51.944835699999999",
            "lat-": "35.294193399999997",
            "lon-": "51.580954300000002",
            "city": "پاکدشت",
            "province": "تهران"
        },
        {
            "lat": "35.694426007256503",
            "lon": "51.788043747405098",
            "lat+": "35.7888527",
            "lon+": "51.890616399999999",
            "lat-": "35.554567800000001",
            "lon-": "51.676250699999997",
            "city": "پردیس",
            "province": "تهران"
        },
        {
            "lat": "35.551904527595802",
            "lon": "51.7252345512848",
            "lat+": "36.134299599999999",
            "lon+": "53.155692700000003",
            "lat-": "34.861731800000001",
            "lon-": "50.332803499999997",
            "city": "تهران",
            "province": "تهران"
        },
        {
            "lat": "35.805582100000002",
            "lon": "51.825662199999996",
            "lat+": "35.810507700000002",
            "lon+": "51.891294899999998",
            "lat-": "35.788995900000003",
            "lon-": "51.787874000000002",
            "city": "رودهن",
            "province": "تهران"
        },
        {
            "lat": "35.323173718952603",
            "lon": "51.750812661909499",
            "lat+": "35.3907357",
            "lon+": "51.885440099999997",
            "lat-": "35.273854399999998",
            "lon-": "51.645269300000002",
            "city": "پیشوا",
            "province": "تهران"
        },
        {
            "lat": "35.598695112159398",
            "lon": "51.050768307750502",
            "lat+": "35.607829000000002",
            "lon+": "51.055593799999997",
            "lat-": "35.597202199999998",
            "lon-": "51.043656200000001",
            "city": "فردوسیه",
            "province": "تهران"
        },
        {
            "lat": "35.676088930201701",
            "lon": "50.841891153959097",
            "lat+": "35.692715800000002",
            "lon+": "50.883240000000001",
            "lat-": "35.654715899999999",
            "lon-": "50.804085600000001",
            "city": "صفادشت",
            "province": "تهران"
        },
        {
            "lat": "35.496103483906502",
            "lon": "51.0523681639446",
            "lat+": "35.565002999999997",
            "lon+": "51.2104936",
            "lat-": "35.4101924",
            "lon-": "50.896840300000001",
            "city": "رباط کریم",
            "province": "تهران"
        },
        {
            "lat": "35.623303618478801",
            "lon": "52.171697502060297",
            "lat+": "35.861183500000003",
            "lon+": "52.554132899999999",
            "lat-": "35.373353199999997",
            "lon-": "51.802747799999999",
            "city": "دماوند",
            "province": "تهران"
        },
        {
            "lat": "35.845871500000001",
            "lon": "51.556548999999997",
            "lat+": "35.868089400000002",
            "lon+": "51.5619516",
            "lat-": "35.840019599999998",
            "lon-": "51.542085499999999",
            "city": "فشم",
            "province": "تهران"
        },
        {
            "lat": "35.700701426783198",
            "lon": "52.663967844726301",
            "lat+": "35.939216399999999",
            "lon+": "53.1569346",
            "lat-": "35.332128500000003",
            "lon-": "52.220626500000002",
            "city": "فیروزکوه",
            "province": "تهران"
        },
        {
            "lat": "29.578080966218799",
            "lon": "52.610255937558698",
            "lat+": "29.579715",
            "lon+": "52.611995",
            "lat-": "29.576542",
            "lon-": "52.608437000000002",
            "city": "شریف آباد",
            "province": "تهران"
        },
        {
            "lat": "35.340559873537998",
            "lon": "51.271330475803701",
            "lat+": "35.622419200000003",
            "lon+": "51.690171900000003",
            "lat-": "35.1105132",
            "lon-": "50.847383700000002",
            "city": "ری",
            "province": "تهران"
        },
        {
            "lat": "35.416716870328202",
            "lon": "51.570559752533299",
            "lat+": "35.467909800000001",
            "lon+": "51.638674799999997",
            "lat-": "35.371135000000002",
            "lon-": "51.495977699999997",
            "city": "قرچک",
            "province": "تهران"
        },
        {
            "lat": "35.608861357848198",
            "lon": "51.0309475784792",
            "lat+": "35.733689300000002",
            "lon+": "51.231202600000003",
            "lat-": "35.479195300000001",
            "lon-": "50.833741099999997",
            "city": "شهریار",
            "province": "تهران"
        },
        {
            "lat": "35.476667300000003",
            "lon": "52.162448599999998",
            "lat+": "35.507307599999997",
            "lon+": "52.172903400000003",
            "lat-": "35.408827799999997",
            "lon-": "52.141546900000002",
            "city": "کیلان",
            "province": "تهران"
        },
        {
            "lat": "35.603928924202101",
            "lon": "52.1964163507322",
            "lat+": "35.603954299999998",
            "lon+": "52.197511400000003",
            "lat-": "35.603203899999997",
            "lon-": "52.1963078",
            "city": "کهریزک",
            "province": "تهران"
        },
        {
            "lat": "35.518874332230801",
            "lon": "51.621235019019501",
            "lat+": "35.522759200000003",
            "lon+": "51.624932600000001",
            "lat-": "35.5183052",
            "lon-": "51.6206934",
            "city": "فرون آباد",
            "province": "تهران"
        },
        {
            "lat": "35.611875433279401",
            "lon": "50.694477157165799",
            "lat+": "35.725994499999999",
            "lon+": "51.001012600000003",
            "lat-": "35.480838599999998",
            "lon-": "50.332803499999997",
            "city": "ملارد",
            "province": "تهران"
        },
        {
            "lat": "36.607628373620301",
            "lon": "49.233626458714603",
            "lat+": "36.630835300000001",
            "lon+": "49.236786500000001",
            "lat-": "36.604718300000002",
            "lon-": "49.228266499999997",
            "city": "نصیرآباد",
            "province": "تهران"
        },
        {
            "lat": "35.713837699999999",
            "lon": "51.475301199999997",
            "lat+": "35.720717800000003",
            "lon+": "51.478580600000001",
            "lat-": "35.710998400000001",
            "lon-": "51.467121200000001",
            "city": "وحیدیه",
            "province": "تهران"
        },
        {
            "lat": "31.895813734514501",
            "lon": "51.179828102718702",
            "lat+": "31.953308499999999",
            "lon+": "51.269983199999999",
            "lat-": "31.891162000000001",
            "lon-": "51.170924300000003",
            "city": "آلونی",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "35.704055028149597",
            "lon": "51.113207935451904",
            "lat+": "35.7425067",
            "lon+": "51.197470299999999",
            "lat-": "35.662363300000003",
            "lon-": "51.020417600000002",
            "city": "قدس",
            "province": "تهران"
        },
        {
            "lat": "35.854555900000001",
            "lon": "51.683687999999997",
            "lat+": "35.8584295",
            "lon+": "51.6895758",
            "lat-": "35.834429200000002",
            "lon-": "51.665144599999998",
            "city": "لواسان",
            "province": "تهران"
        },
        {
            "lat": "35.132762109249697",
            "lon": "51.756833399441803",
            "lat+": "35.413464599999998",
            "lon+": "52.044811099999997",
            "lat-": "34.865228799999997",
            "lon-": "51.453510700000002",
            "city": "ورامین",
            "province": "تهران"
        },
        {
            "lat": "37.318828503073",
            "lon": "55.090715716345002",
            "lat+": "38.124448600000001",
            "lon+": "56.313564100000001",
            "lat-": "36.495617000000003",
            "lon-": "53.858131899999997",
            "city": "گلستان",
            "province": "تهران"
        },
        {
            "lat": "32.305174815057498",
            "lon": "50.799623275635199",
            "lat+": "32.566047699999999",
            "lon+": "51.195875899999997",
            "lat-": "32.020440100000002",
            "lon-": "50.353640900000002",
            "city": "شهرکرد",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "31.871838473529898",
            "lon": "54.3079696888665",
            "lat+": "31.872158800000001",
            "lon+": "54.308346299999997",
            "lat-": "31.8715051",
            "lon-": "54.307574600000002",
            "city": "نسیم شهر",
            "province": "تهران"
        },
        {
            "lat": "32.362825962180203",
            "lon": "50.389253760819201",
            "lat+": "32.390644000000002",
            "lon+": "50.558277400000001",
            "lat-": "32.267988699999997",
            "lon-": "50.336773000000001",
            "city": "چلگرد",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "31.865516570898599",
            "lon": "51.152129143407798",
            "lat+": "32.220348999999999",
            "lon+": "51.434142100000003",
            "lat-": "31.492254800000001",
            "lon-": "50.775034099999999",
            "city": "بروجن",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "36.024437035755099",
            "lon": "50.644409952787399",
            "lat+": "36.037194599999999",
            "lon+": "50.651773900000002",
            "lat-": "36.018332600000001",
            "lon-": "50.640923299999997",
            "city": "شلمزار",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "32.241103163644901",
            "lon": "50.838858224181699",
            "lat+": "32.2417807",
            "lon+": "50.839793",
            "lat-": "32.2326622",
            "lon-": "50.8363966",
            "city": "طاقانک",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "31.909204777380399",
            "lon": "50.457780007202501",
            "lat+": "32.234285800000002",
            "lon+": "50.739979900000002",
            "lat-": "31.591088899999999",
            "lon-": "50.148191699999998",
            "city": "اردل",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "32.227116119773498",
            "lon": "50.563075223719601",
            "lat+": "32.383278199999999",
            "lon+": "50.766070399999997",
            "lat-": "32.056939499999999",
            "lon-": "50.350387400000002",
            "city": "فارسان",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "31.9710546517111",
            "lon": "51.284931463680302",
            "lat+": "31.972717500000002",
            "lon+": "51.286537099999997",
            "lat-": "31.970819500000001",
            "lon-": "51.284886200000003",
            "city": "گندمان",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "31.461044685006499",
            "lon": "50.887381099187202",
            "lat+": "31.758458699999998",
            "lon+": "51.338542099999998",
            "lat-": "31.150817199999999",
            "lon-": "50.2934834",
            "city": "لردگان",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "31.971246141294699",
            "lon": "51.287784658597097",
            "lat+": "31.971410899999999",
            "lon+": "51.288003099999997",
            "lat-": "31.971194300000001",
            "lon-": "51.287748100000002",
            "city": "ناغان",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "32.581970255932902",
            "lon": "50.648227358864503",
            "lat+": "32.717840299999999",
            "lon+": "50.8502194",
            "lat-": "32.437496600000003",
            "lon-": "50.416023199999998",
            "city": "بن",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "32.5483546070937",
            "lon": "50.8892466867254",
            "lat+": "32.709175700000003",
            "lon+": "51.005159300000003",
            "lat-": "32.389673999999999",
            "lon-": "50.777360000000002",
            "city": "سامان",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "32.2576694243484",
            "lon": "50.817056349170002",
            "lat+": "32.300377599999997",
            "lon+": "50.817948399999999",
            "lat-": "32.236435",
            "lon-": "50.800015100000003",
            "city": "هفشجان",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "33.0558009629233",
            "lon": "59.2687583916248",
            "lat+": "33.502242299999999",
            "lon+": "59.696927100000003",
            "lat-": "32.650828799999999",
            "lon-": "58.658537699999997",
            "city": "بیرجند",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "34.023402680239101",
            "lon": "57.427295824087302",
            "lat+": "34.6204003",
            "lon+": "57.8064082",
            "lat-": "33.460252199999999",
            "lon-": "57.0084479",
            "city": "بشرویه",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "31.367790240880499",
            "lon": "48.644437163016597",
            "lat+": "31.375257099999999",
            "lon+": "48.657760600000003",
            "lat-": "31.360636599999999",
            "lon-": "48.631582199999997",
            "city": "کیان",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "32.119934810818698",
            "lon": "50.9827420014417",
            "lat+": "32.259524800000001",
            "lon+": "50.993356599999998",
            "lat-": "32.106983499999998",
            "lon-": "50.974328100000001",
            "city": "فرخ شهر",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "32.637987063028099",
            "lon": "51.644097739405701",
            "lat+": "32.6380798",
            "lon+": "51.644551399999997",
            "lat-": "32.635277199999997",
            "lon-": "51.644070999999997",
            "city": "مال خلیفه",
            "province": "چهارمحال بختیاری"
        },
        {
            "lat": "32.303969684006397",
            "lon": "58.684125506032601",
            "lat+": "33.215407200000001",
            "lon+": "59.373454799999998",
            "lat-": "31.441665100000002",
            "lon-": "57.995608699999998",
            "city": "خوسف",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "34.344384148663501",
            "lon": "47.038806309246802",
            "lat+": "34.352074799999997",
            "lon+": "47.045939699999998",
            "lat-": "34.337774899999999",
            "lon-": "47.030425800000003",
            "city": "اسلامیه",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "33.365383774543901",
            "lon": "58.242378016329297",
            "lat+": "34.109583399999998",
            "lon+": "58.866008200000003",
            "lat-": "32.572614899999998",
            "lon-": "57.671463099999997",
            "city": "سرایان",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "32.441198443441799",
            "lon": "60.067697571687297",
            "lat+": "32.916603799999997",
            "lon+": "60.873614699999997",
            "lat-": "32.016447499999998",
            "lon-": "59.222053000000002",
            "city": "سربیشه",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "29.7153659635268",
            "lon": "52.457779913057898",
            "lat+": "29.724209999999999",
            "lon+": "52.473148999999999",
            "lat-": "29.707736000000001",
            "lon-": "52.443280000000001",
            "city": "آرین شهر",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "32.9060931512522",
            "lon": "59.256995820023597",
            "lat+": "32.929728300000001",
            "lon+": "59.289482399999997",
            "lat-": "32.903009699999998",
            "lon-": "59.2510057",
            "city": "قائن",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "32.577387267472801",
            "lon": "51.787234606870904",
            "lat+": "32.5998716",
            "lon+": "51.8418378",
            "lat-": "32.565391099999999",
            "lon-": "51.769907600000003",
            "city": "خضری دشت بیاض",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "28.2402347564901",
            "lon": "56.007751265381899",
            "lat+": "28.880206999999999",
            "lon+": "57.008870399999999",
            "lat-": "27.7170819",
            "lon-": "55.244445599999999",
            "city": "حاجی آباد",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "35.704055028149597",
            "lon": "51.113207935451904",
            "lat+": "35.7425067",
            "lon+": "51.197470299999999",
            "lat-": "35.662363300000003",
            "lon-": "51.020417600000002",
            "city": "سه قلعه",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "33.994085377097598",
            "lon": "58.016230974412899",
            "lat+": "34.347073000000002",
            "lon+": "58.495540699999999",
            "lat-": "33.579973000000003",
            "lon-": "57.669592000000002",
            "city": "فردوس",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "34.1028500238181",
            "lon": "49.657684274428199",
            "lat+": "34.103366600000001",
            "lon+": "49.668382200000003",
            "lat-": "34.101088900000001",
            "lon-": "49.652458799999998",
            "city": "مود",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "31.4966454065286",
            "lon": "59.746179159421402",
            "lat+": "32.336703200000002",
            "lon+": "60.859778599999999",
            "lat-": "30.516734",
            "lon-": "58.423341299999997",
            "city": "نهبندان",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "33.306436604321497",
            "lon": "56.820601035511601",
            "lat+": "35.0943404",
            "lon+": "58.350374000000002",
            "lat-": "31.680605",
            "lon-": "55.381466600000003",
            "city": "طبس مسینا",
            "province": "خراسان جنوبی"
        },
        {
            "lat": "37.131475093543202",
            "lon": "58.511647908476199",
            "lat+": "37.148370999999997",
            "lon+": "58.517080499999999",
            "lat-": "37.128250000000001",
            "lon-": "58.502385799999999",
            "city": "باجگیران",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.037761668299801",
            "lon": "60.296704751537199",
            "lat+": "35.323150099999999",
            "lon+": "60.672451100000004",
            "lat-": "34.777358399999997",
            "lon-": "60.0021208",
            "city": "باخرز",
            "province": "خراسان رضوی"
        },
        {
            "lat": "34.603074783054197",
            "lon": "58.090700697721402",
            "lat+": "34.9198594",
            "lon+": "58.618889500000002",
            "lat-": "34.2309828",
            "lon-": "57.557809599999999",
            "city": "بجستان",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.698193549999999",
            "lon": "51.460556150000002",
            "lat+": "35.698216000000002",
            "lon+": "51.460851400000003",
            "lat-": "35.698171100000003",
            "lon-": "51.460260900000002",
            "city": "بیدخت",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.309925333150296",
            "lon": "59.150208032718801",
            "lat+": "35.324812199999997",
            "lon+": "59.1693693",
            "lat-": "35.290407199999997",
            "lon-": "59.078566899999998",
            "city": "بایگ",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.1737909133264",
            "lon": "57.362987051179303",
            "lat+": "35.586403300000001",
            "lon+": "58.249481899999999",
            "lat-": "34.680922000000002",
            "lon-": "56.227891499999998",
            "city": "بردسکن",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.682459051098903",
            "lon": "56.989143355948599",
            "lat+": "36.8683446",
            "lon+": "57.296102099999999",
            "lat-": "36.425801499999999",
            "lon-": "56.52722",
            "city": "جغتای",
            "province": "خراسان رضوی"
        },
        {
            "lat": "34.762479213629099",
            "lon": "60.699498788014097",
            "lat+": "35.106779500000002",
            "lon+": "61.064144300000002",
            "lat-": "34.448097699999998",
            "lon-": "60.274015499999997",
            "city": "تایباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.250003270393499",
            "lon": "59.814294542264399",
            "lat+": "36.974725100000001",
            "lon+": "60.602090799999999",
            "lat-": "35.704324399999997",
            "lon-": "59.172753399999998",
            "city": "مشهد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.251459263630103",
            "lon": "59.211609557010902",
            "lat+": "35.251993300000002",
            "lon+": "59.212329500000003",
            "lat-": "35.2509309",
            "lon-": "59.210849000000003",
            "city": "بار",
            "province": "خراسان رضوی"
        },
        {
            "lat": "34.412030362579699",
            "lon": "60.033074675210401",
            "lat+": "35.043269500000001",
            "lon+": "60.903208599999999",
            "lat-": "33.854452199999997",
            "lon-": "59.387972900000001",
            "city": "خواف",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.475826531673",
            "lon": "60.739891259293302",
            "lat+": "35.996798800000001",
            "lon+": "61.268053700000003",
            "lat-": "34.903144099999999",
            "lon-": "60.006836800000002",
            "city": "تربت جام",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.791815235810098",
            "lon": "54.113351273995299",
            "lat+": "36.791954400000002",
            "lon+": "54.115445999999999",
            "lat-": "36.787404600000002",
            "lon-": "54.113284700000001",
            "city": "جنگل",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.469812119810797",
            "lon": "59.119102166119802",
            "lat+": "35.851935300000001",
            "lon+": "59.512942700000004",
            "lat-": "34.955582499999998",
            "lon-": "58.686322099999998",
            "city": "تربت حیدریه",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.288335544574402",
            "lon": "57.070741233743",
            "lat+": "36.556890899999999",
            "lon+": "57.4646756",
            "lat-": "36.066133700000002",
            "lon-": "56.696916000000002",
            "city": "داورزن",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.688997835075",
            "lon": "59.051455644396398",
            "lat+": "37.047121599999997",
            "lon+": "59.402400200000002",
            "lat-": "36.271660699999998",
            "lon-": "58.657740099999998",
            "city": "چناران",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.944972047203997",
            "lon": "50.775024500340798",
            "lat+": "35.952200099999999",
            "lon+": "50.790494899999999",
            "lat-": "35.943001299999999",
            "lon-": "50.770996199999999",
            "city": "خرو",
            "province": "خراسان رضوی"
        },
        {
            "lat": "37.354871044257898",
            "lon": "59.021611854607201",
            "lat+": "37.7008261",
            "lon+": "59.4655512",
            "lat-": "36.9133779",
            "lon-": "58.481921399999997",
            "city": "درگز",
            "province": "خراسان رضوی"
        },
        {
            "lat": "34.829884418383699",
            "lon": "59.396246600741797",
            "lat+": "35.213164300000003",
            "lon+": "59.919220000000003",
            "lat-": "34.4001679",
            "lon-": "58.943837299999998",
            "city": "رشتخوار",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.609602808357501",
            "lon": "51.500521252075103",
            "lat+": "35.619909100000001",
            "lon+": "51.515317699999997",
            "lat-": "35.598645300000001",
            "lon-": "51.487522499999997",
            "city": "رضویه",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.321786267648001",
            "lon": "58.467193874299802",
            "lat+": "35.469189100000001",
            "lon+": "58.496822199999997",
            "lat-": "35.288455900000002",
            "lon-": "58.4618167",
            "city": "ریوش",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.168304465116599",
            "lon": "58.187898390801898",
            "lat+": "35.460153300000002",
            "lon+": "58.429524299999997",
            "lat-": "34.883904899999997",
            "lon-": "57.9913156",
            "city": "خلیل آباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "32.6395852118169",
            "lon": "51.703032851325197",
            "lat+": "32.639603299999997",
            "lon+": "51.704179099999998",
            "lat-": "32.639158999999999",
            "lon-": "51.702984200000003",
            "city": "روداب",
            "province": "خراسان رضوی"
        },
        {
            "lat": "33.4810547919474",
            "lon": "48.392154162898102",
            "lat+": "33.4872771",
            "lon+": "48.3976933",
            "lat-": "33.476658100000002",
            "lon-": "48.371045899999999",
            "city": "درود",
            "province": "خراسان رضوی"
        },
        {
            "lat": "37.035389407100404",
            "lon": "45.084720794253798",
            "lat+": "37.037169599999999",
            "lon+": "45.087492300000001",
            "lat-": "37.024501100000002",
            "lon-": "45.072999000000003",
            "city": "سنگان",
            "province": "خراسان رضوی"
        },
        {
            "lat": "33.986913968136598",
            "lon": "51.451308890440998",
            "lat+": "33.9870211",
            "lon+": "51.451420800000001",
            "lat-": "33.986698199999999",
            "lon-": "51.451029200000001",
            "city": "رباط سنگ",
            "province": "خراسان رضوی"
        },
        {
            "lat": "37.795536344128898",
            "lon": "48.900842361348097",
            "lat+": "37.795769",
            "lon+": "48.9010739",
            "lat-": "37.795439799999997",
            "lon-": "48.898881600000003",
            "city": "سلامی",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.908464862079803",
            "lon": "57.5585122773021",
            "lat+": "36.4347633",
            "lon+": "58.2915177",
            "lat-": "35.465968500000002",
            "lon-": "56.714013199999997",
            "city": "سبزوار",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.365517466769901",
            "lon": "59.418354357579801",
            "lat+": "36.413811799999998",
            "lon+": "59.4435328",
            "lat-": "36.347011500000001",
            "lon-": "59.333093900000001",
            "city": "شاندیز",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.291366780659502",
            "lon": "60.781043901638",
            "lat+": "36.633137599999998",
            "lon+": "61.221174400000002",
            "lat-": "35.891959399999998",
            "lon-": "60.204288200000001",
            "city": "سرخس",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.7091225784282",
            "lon": "51.363494324295502",
            "lat+": "35.718253400000002",
            "lon+": "51.370411599999997",
            "lat-": "35.700343699999998",
            "lon-": "51.356831700000001",
            "city": "شادمهر",
            "province": "خراسان رضوی"
        },
        {
            "lat": "32.6538016350883",
            "lon": "51.743199667824101",
            "lat+": "32.6575548",
            "lon+": "51.750068400000004",
            "lat-": "32.649824099999996",
            "lon-": "51.736767999999998",
            "city": "سلطان آباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.317203494487501",
            "lon": "59.384997994722802",
            "lat+": "36.3232651",
            "lon+": "59.404708499999998",
            "lat-": "36.313905200000001",
            "lon-": "59.3759078",
            "city": "طرقبه",
            "province": "خراسان رضوی"
        },
        {
            "lat": "29.608918558282301",
            "lon": "52.514824258375498",
            "lat+": "29.610264799999999",
            "lon+": "52.517959900000001",
            "lat-": "29.606658199999998",
            "lon-": "52.513667900000002",
            "city": "قدمگاه",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.694132166614096",
            "lon": "59.881092649965701",
            "lat+": "36.018065",
            "lon+": "60.583976200000002",
            "lat-": "35.4352929",
            "lon-": "59.487825299999997",
            "city": "فریمان",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.587815923847003",
            "lon": "59.130749170726702",
            "lat+": "35.6052581",
            "lon+": "59.193686999999997",
            "lat-": "35.548910399999997",
            "lon-": "58.968540400000002",
            "city": "کدکن",
            "province": "خراسان رضوی"
        },
        {
            "lat": "26.556706708954",
            "lon": "53.969480348426799",
            "lat+": "26.556858600000002",
            "lon+": "53.969675100000003",
            "lat-": "26.5566064",
            "lon-": "53.9693878",
            "city": "کاریز",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.557800153200297",
            "lon": "52.326342096790697",
            "lat+": "36.558708299999999",
            "lon+": "52.329045000000001",
            "lat-": "36.557288700000001",
            "lon-": "52.326288099999999",
            "city": "عشق آباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.417569857721602",
            "lon": "58.493625559066601",
            "lat+": "35.731841000000003",
            "lon+": "58.812769500000002",
            "lat-": "35.094427899999999",
            "lon-": "58.16075",
            "city": "کاشمر",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.315712979364498",
            "lon": "58.423232035305503",
            "lat+": "36.608665600000002",
            "lon+": "58.675749600000003",
            "lat-": "36.077370000000002",
            "lon-": "58.214576600000001",
            "city": "فیروزه",
            "province": "خراسان رضوی"
        },
        {
            "lat": "31.8574056032394",
            "lon": "54.345213677470397",
            "lat+": "31.866259700000001",
            "lon+": "54.356639399999999",
            "lat-": "31.848453500000002",
            "lon-": "54.332735499999998",
            "city": "قاسم آباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.326217115268499",
            "lon": "47.004439355037597",
            "lat+": "35.329790299999999",
            "lon+": "47.006810399999999",
            "lat-": "35.321788300000001",
            "lon-": "47.0024649",
            "city": "فیض آباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.536709413884701",
            "lon": "59.236309374346497",
            "lat+": "36.551013099999999",
            "lon+": "59.258897599999997",
            "lat-": "36.471400000000003",
            "lon-": "59.069493100000003",
            "city": "گلمکان",
            "province": "خراسان رضوی"
        },
        {
            "lat": "37.117722784637003",
            "lon": "58.588017862266597",
            "lat+": "37.666992800000003",
            "lon+": "59.090281300000001",
            "lat-": "36.6220657",
            "lon-": "58.160095099999999",
            "city": "قوچان",
            "province": "خراسان رضوی"
        },
        {
            "lat": "34.730552992652399",
            "lon": "60.727159684761297",
            "lat+": "34.799388800000003",
            "lon+": "60.759635000000003",
            "lat-": "34.727927200000003",
            "lon-": "60.515116800000001",
            "city": "مشهدریزه",
            "province": "خراسان رضوی"
        },
        {
            "lat": "34.376083260899797",
            "lon": "58.855232349121799",
            "lat+": "34.800171900000002",
            "lon+": "59.539810000000003",
            "lat-": "34.019387299999998",
            "lon-": "58.293047199999997",
            "city": "گناباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.838960304455",
            "lon": "51.097340902520401",
            "lat+": "35.847520500000002",
            "lon+": "51.108687199999999",
            "lat-": "35.834441300000002",
            "lon-": "51.057071000000001",
            "city": "کندر",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.830447133298598",
            "lon": "59.917753393247096",
            "lat+": "37.283067000000003",
            "lon+": "60.444423700000002",
            "lat-": "36.409162500000001",
            "lon-": "59.344809900000001",
            "city": "کلات",
            "province": "خراسان رضوی"
        },
        {
            "lat": "35.729638401000997",
            "lon": "51.461491647103699",
            "lat+": "35.730752899999999",
            "lon+": "51.4631002",
            "lat-": "35.729588200000002",
            "lon-": "51.461419300000003",
            "city": "نقاب",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.9548006060338",
            "lon": "57.554586947895601",
            "lat+": "37.281981600000002",
            "lon+": "58.130947200000001",
            "lat-": "36.576115999999999",
            "lon-": "56.971858400000002",
            "city": "اسفراین",
            "province": "خراسان شمالی"
        },
        {
            "lat": "34.323631381640901",
            "lon": "47.090422641715598",
            "lat+": "34.324560900000002",
            "lon+": "47.091767699999998",
            "lat-": "34.323553500000003",
            "lon-": "47.0861363",
            "city": "لطف آباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.301400461959901",
            "lon": "59.561502985047497",
            "lat+": "36.307716499999998",
            "lon+": "59.563136399999998",
            "lat-": "36.3004392",
            "lon-": "59.551892199999998",
            "city": "ملک آباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "38.2639433133278",
            "lon": "48.3085047141793",
            "lat+": "38.264530999999998",
            "lon+": "48.310667299999999",
            "lat-": "38.262709399999999",
            "lon-": "48.307785199999998",
            "city": "یونسی",
            "province": "خراسان رضوی"
        },
        {
            "lat": "36.967582299999997",
            "lon": "56.230811500000002",
            "lat+": "36.968498500000003",
            "lon+": "56.250977399999996",
            "lat-": "36.965985799999999",
            "lon-": "56.223792099999997",
            "city": "ایور",
            "province": "خراسان شمالی"
        },
        {
            "lat": "36.1676948249427",
            "lon": "58.676098797692902",
            "lat+": "36.966961099999999",
            "lon+": "59.315649399999998",
            "lat-": "35.574633200000001",
            "lon-": "58.201674799999999",
            "city": "نیشابور",
            "province": "خراسان رضوی"
        },
        {
            "lat": "32.625898096185502",
            "lon": "51.7006706711893",
            "lat+": "32.629806500000001",
            "lon+": "51.712850000000003",
            "lat-": "32.623282600000003",
            "lon-": "51.691408799999998",
            "city": "همت آباد",
            "province": "خراسان رضوی"
        },
        {
            "lat": "37.555706056036399",
            "lon": "57.342857082282499",
            "lat+": "37.984553499999997",
            "lon+": "57.725223300000003",
            "lat-": "37.220222800000002",
            "lon-": "56.950914599999997",
            "city": "بجنورد",
            "province": "خراسان شمالی"
        },
        {
            "lat": "35.762453100000002",
            "lon": "51.370012600000003",
            "lat+": "35.7628336",
            "lon+": "51.370157499999998",
            "lat-": "35.762072600000003",
            "lon-": "51.3698677",
            "city": "نیل شهر",
            "province": "خراسان رضوی"
        },
        {
            "lat": "37.006113361527198",
            "lon": "56.539433712955898",
            "lat+": "37.094217100000002",
            "lon+": "56.851480199999997",
            "lat-": "36.983658300000002",
            "lon-": "56.419649800000002",
            "city": "سنخواست",
            "province": "خراسان شمالی"
        },
        {
            "lat": "37.192559134094701",
            "lon": "58.1678600981325",
            "lat+": "37.682911900000001",
            "lon+": "58.424430200000003",
            "lat-": "36.860968700000001",
            "lon-": "57.859142800000001",
            "city": "فاروج",
            "province": "خراسان شمالی"
        },
        {
            "lat": "35.704055028149597",
            "lon": "51.113207935451904",
            "lat+": "35.7425067",
            "lon+": "51.197470299999999",
            "lat-": "35.662363300000003",
            "lon-": "51.020417600000002",
            "city": "پیش قلعه",
            "province": "خراسان شمالی"
        },
        {
            "lat": "37.029112844875499",
            "lon": "56.666729676972402",
            "lat+": "37.395787499999997",
            "lon+": "57.035867000000003",
            "lat-": "36.658817200000001",
            "lon-": "56.234475400000001",
            "city": "جاجرم",
            "province": "خراسان شمالی"
        },
        {
            "lat": "36.969321322526703",
            "lon": "56.220070399768098",
            "lat+": "36.969465800000002",
            "lon+": "56.220243799999999",
            "lat-": "36.9691215",
            "lon-": "56.2198128",
            "city": "درق",
            "province": "خراسان شمالی"
        },
        {
            "lat": "29.575146799999999",
            "lon": "52.515826099999998",
            "lat+": "29.575895800000001",
            "lon+": "52.516028599999999",
            "lat-": "29.573764100000002",
            "lon-": "52.5156402",
            "city": "راز",
            "province": "خراسان شمالی"
        },
        {
            "lat": "37.544249241038401",
            "lon": "57.891903153633002",
            "lat+": "37.923643300000002",
            "lon+": "58.286811399999998",
            "lat-": "37.091377199999997",
            "lon-": "57.463024300000001",
            "city": "شیروان",
            "province": "خراسان شمالی"
        },
        {
            "lat": "36.265823621638397",
            "lon": "50.001960640415497",
            "lat+": "36.265846099999997",
            "lon+": "50.002153499999999",
            "lat-": "36.265258899999999",
            "lon-": "50.001906699999999",
            "city": "الوان",
            "province": "خوزستان"
        },
        {
            "lat": "32.2925191",
            "lon": "48.434215500000001",
            "lat+": "32.328054000000002",
            "lon+": "48.434594300000001",
            "lat-": "32.285375799999997",
            "lon-": "48.417421300000001",
            "city": "صفی آباد",
            "province": "خراسان شمالی"
        },
        {
            "lat": "30.2274179410283",
            "lon": "48.418256106685703",
            "lat+": "30.295308299999999",
            "lon+": "48.5225954",
            "lat-": "30.0107994",
            "lon-": "48.347667199999997",
            "city": "اروندکنار",
            "province": "خوزستان"
        },
        {
            "lat": "38.026577904370498",
            "lon": "46.157691081207197",
            "lat+": "38.029737799999999",
            "lon+": "46.161761200000001",
            "lat-": "38.0237543",
            "lon-": "46.153864800000001",
            "city": "قاضی",
            "province": "خراسان شمالی"
        },
        {
            "lat": "31.873249540387",
            "lon": "49.971573376317401",
            "lat+": "32.347571199999997",
            "lon+": "50.4425454",
            "lat-": "31.442050200000001",
            "lon-": "49.552083400000001",
            "city": "ایذه",
            "province": "خوزستان"
        },
        {
            "lat": "30.7936959831002",
            "lon": "49.924732670904802",
            "lat+": "30.884068500000001",
            "lon+": "50.014832400000003",
            "lat-": "30.6836074",
            "lon-": "49.826688699999998",
            "city": "آغاجاری",
            "province": "خوزستان"
        },
        {
            "lat": "37.151735757543797",
            "lon": "56.235998575189797",
            "lat+": "37.376369699999998",
            "lon+": "56.621943299999998",
            "lat-": "36.824329499999997",
            "lon-": "55.903365100000002",
            "city": "گرمه",
            "province": "خراسان شمالی"
        },
        {
            "lat": "30.769336541793699",
            "lon": "49.708318375315997",
            "lat+": "31.1317296",
            "lon+": "50.076447700000003",
            "lat-": "30.442112300000002",
            "lon-": "49.320100099999998",
            "city": "امیدیه",
            "province": "خوزستان"
        },
        {
            "lat": "31.218830406250301",
            "lon": "48.685893292158603",
            "lat+": "31.7685453",
            "lon+": "49.313996899999999",
            "lat-": "30.891629999999999",
            "lon-": "48.033720099999996",
            "city": "اهواز",
            "province": "خوزستان"
        },
        {
            "lat": "32.696074031726603",
            "lon": "48.3289613387009",
            "lat+": "32.994282300000002",
            "lon+": "48.781257699999998",
            "lat-": "32.274035699999999",
            "lon-": "47.903027999999999",
            "city": "اندیمشک",
            "province": "خوزستان"
        },
        {
            "lat": "30.181592919101799",
            "lon": "48.611484755674198",
            "lat+": "30.505610600000001",
            "lon+": "48.946881900000001",
            "lat-": "29.882294699999999",
            "lon-": "48.197121799999998",
            "city": "آبادان",
            "province": "خوزستان"
        },
        {
            "lat": "31.484101523894001",
            "lon": "49.904433591057703",
            "lat+": "31.726208499999998",
            "lon+": "50.299364599999997",
            "lat-": "31.206992799999998",
            "lon-": "49.477311399999998",
            "city": "باغ ملک",
            "province": "خوزستان"
        },
        {
            "lat": "30.5275438951406",
            "lon": "50.209192496603997",
            "lat+": "30.905404900000001",
            "lon+": "50.552046400000002",
            "lat-": "30.164213400000001",
            "lon-": "49.789206399999998",
            "city": "بهبهان",
            "province": "خوزستان"
        },
        {
            "lat": "30.807575845728",
            "lon": "49.058850127081797",
            "lat+": "31.271425600000001",
            "lon+": "49.0777188",
            "lat-": "30.710237100000001",
            "lon-": "48.793548899999998",
            "city": "بندر امام خمینی",
            "province": "خوزستان"
        },
        {
            "lat": "37.803203308495299",
            "lon": "46.813094973560801",
            "lat+": "38.095091600000003",
            "lon+": "47.244316699999999",
            "lat-": "37.539656299999997",
            "lon-": "46.461235899999998",
            "city": "بستان",
            "province": "خوزستان"
        },
        {
            "lat": "30.040266042135801",
            "lon": "48.533126533828899",
            "lat+": "30.197167400000001",
            "lon+": "48.578699100000001",
            "lat-": "30.010866700000001",
            "lon-": "48.433034300000003",
            "city": "چوئبده",
            "province": "خوزستان"
        },
        {
            "lat": "30.512611759626999",
            "lon": "49.211629552821201",
            "lat+": "30.9319582",
            "lon+": "49.5409583",
            "lat-": "30.133602400000001",
            "lon-": "48.912267399999998",
            "city": "بندر ماهشهر",
            "province": "خوزستان"
        },
        {
            "lat": "36.274644250533001",
            "lon": "59.600549769568303",
            "lat+": "36.275342000000002",
            "lon+": "59.601613800000003",
            "lat-": "36.271357000000002",
            "lon-": "59.595490699999999",
            "city": "دارخوین",
            "province": "خوزستان"
        },
        {
            "lat": "35.700562529212299",
            "lon": "51.260704070418299",
            "lat+": "35.700742200000001",
            "lon+": "51.261558800000003",
            "lat-": "35.7002612",
            "lon-": "51.259668099999999",
            "city": "جنت مکان",
            "province": "خوزستان"
        },
        {
            "lat": "31.4906820382256",
            "lon": "48.4492396925395",
            "lat+": "31.713282400000001",
            "lon+": "48.611583600000003",
            "lat-": "31.295568100000001",
            "lon-": "48.266407999999998",
            "city": "حمیدیه",
            "province": "خوزستان"
        },
        {
            "lat": "36.2683797427892",
            "lon": "59.589347491843498",
            "lat+": "36.271928000000003",
            "lon+": "59.594670899999997",
            "lat-": "36.267530999999998",
            "lon-": "59.588062299999997",
            "city": "حسینیه",
            "province": "خوزستان"
        },
        {
            "lat": "30.943820473427699",
            "lon": "49.394276410060201",
            "lat+": "31.259250300000001",
            "lon+": "49.6278498",
            "lat-": "30.634132699999999",
            "lon-": "49.170251999999998",
            "city": "رامشیر",
            "province": "خوزستان"
        },
        {
            "lat": "36.946565662633297",
            "lon": "56.375273892208398",
            "lat+": "36.948017900000004",
            "lon+": "56.377242600000002",
            "lat-": "36.942858600000001",
            "lon-": "56.370339999999999",
            "city": "چمران",
            "province": "خوزستان"
        },
        {
            "lat": "36.457816423767397",
            "lon": "52.341008384825201",
            "lat+": "36.457931799999997",
            "lon+": "52.341147900000003",
            "lat-": "36.457673900000003",
            "lon-": "52.340828299999998",
            "city": "حر",
            "province": "خوزستان"
        },
        {
            "lat": "31.215329091919902",
            "lon": "49.662139243905798",
            "lat+": "31.460227100000001",
            "lon+": "49.990742400000002",
            "lat-": "30.9459175",
            "lon-": "49.269842500000003",
            "city": "رامهرمز",
            "province": "خوزستان"
        },
        {
            "lat": "30.685274512205002",
            "lon": "48.2139464205097",
            "lat+": "30.944772199999999",
            "lon+": "48.472120599999997",
            "lat-": "30.315635400000001",
            "lon-": "48.0328971",
            "city": "خرمشهر",
            "province": "خوزستان"
        },
        {
            "lat": "35.750359394494403",
            "lon": "51.470631415878401",
            "lat+": "35.750785700000002",
            "lon+": "51.471819400000001",
            "lat-": "35.749900799999999",
            "lon-": "51.468585400000002",
            "city": "حمزه",
            "province": "خوزستان"
        },
        {
            "lat": "32.428117186540099",
            "lon": "48.529927600055601",
            "lat+": "32.442986300000001",
            "lon+": "48.541282899999999",
            "lat-": "32.4254204",
            "lon-": "48.500061299999999",
            "city": "سالند",
            "province": "خوزستان"
        },
        {
            "lat": "35.566680442769098",
            "lon": "51.255339730570498",
            "lat+": "35.573169700000001",
            "lon+": "51.2571534",
            "lat-": "35.5647004",
            "lon-": "51.249091",
            "city": "سوسنگرد",
            "province": "خوزستان"
        },
        {
            "lat": "32.572739632257097",
            "lon": "48.840230290512302",
            "lat+": "32.966725699999998",
            "lon+": "49.565688799999997",
            "lat-": "31.996987699999998",
            "lon-": "48.279967999999997",
            "city": "دزفول",
            "province": "خوزستان"
        },
        {
            "lat": "30.643021567326201",
            "lon": "48.681160262900697",
            "lat+": "30.9843598",
            "lon+": "49.040636200000002",
            "lat-": "30.293850200000001",
            "lon-": "48.324575699999997",
            "city": "شادگان",
            "province": "خوزستان"
        },
        {
            "lat": "32.476528614429903",
            "lon": "51.764637132993599",
            "lat+": "32.480369199999998",
            "lon+": "51.765307",
            "lat-": "32.475768299999999",
            "lon-": "51.764503599999998",
            "city": "زهره",
            "province": "خوزستان"
        },
        {
            "lat": "36.826196000000003",
            "lon": "54.4396597",
            "lat+": "36.827536000000002",
            "lon+": "54.440579100000001",
            "lat-": "36.826086799999999",
            "lon-": "54.438224099999999",
            "city": "رفیع",
            "province": "خوزستان"
        },
        {
            "lat": "31.884207497460299",
            "lon": "48.877717281119203",
            "lat+": "32.1397403",
            "lon+": "49.206824300000001",
            "lat-": "31.605331799999998",
            "lon-": "48.564040499999997",
            "city": "شوشتر",
            "province": "خوزستان"
        },
        {
            "lat": "29.617642413846198",
            "lon": "52.541395267628403",
            "lat+": "29.6177016",
            "lon+": "52.541905800000002",
            "lat-": "29.615948400000001",
            "lon-": "52.538146400000002",
            "city": "شیبان",
            "province": "خوزستان"
        },
        {
            "lat": "32.909665403130397",
            "lon": "59.233361567004302",
            "lat+": "32.915574800000002",
            "lon+": "59.233548499999998",
            "lat-": "32.907036599999998",
            "lon-": "59.232952099999999",
            "city": "شرافت",
            "province": "خوزستان"
        },
        {
            "lat": "32.030760093532798",
            "lon": "48.222735819274",
            "lat+": "32.507855300000003",
            "lon+": "48.666226399999999",
            "lat-": "31.672372200000002",
            "lon-": "47.666704199999998",
            "city": "شوش",
            "province": "خوزستان"
        },
        {
            "lat": "32.236280847900801",
            "lon": "48.818556048970201",
            "lat+": "32.439065499999998",
            "lon+": "49.024972499999997",
            "lat-": "32.076847100000002",
            "lon-": "48.571461300000003",
            "city": "گتوند",
            "province": "خوزستان"
        },
        {
            "lat": "29.579676200000002",
            "lon": "52.489138099999998",
            "lat+": "29.580081199999999",
            "lon+": "52.489565200000001",
            "lat-": "29.577998000000001",
            "lon-": "52.487549799999996",
            "city": "صالح مشطط",
            "province": "خوزستان"
        },
        {
            "lat": "34.578916016292403",
            "lon": "50.823113159008798",
            "lat+": "34.5824748",
            "lon+": "50.8317421",
            "lat-": "34.577340399999997",
            "lon-": "50.818314899999997",
            "city": "صالح شهر",
            "province": "خوزستان"
        },
        {
            "lat": "32.425089078599598",
            "lon": "49.172400552039001",
            "lat+": "32.607247100000002",
            "lon+": "49.427446500000002",
            "lat-": "32.185780700000002",
            "lon-": "48.913498599999997",
            "city": "لالی",
            "province": "خوزستان"
        },
        {
            "lat": "31.628367594157201",
            "lon": "48.923724292267899",
            "lat+": "31.697428800000001",
            "lon+": "48.995502100000003",
            "lat-": "31.605464300000001",
            "lon-": "48.8976738",
            "city": "ملاثانی",
            "province": "خوزستان"
        },
        {
            "lat": "35.806134911596999",
            "lon": "51.507382991323901",
            "lat+": "35.806289900000003",
            "lon+": "51.507618700000002",
            "lat-": "35.805953100000004",
            "lon-": "51.5071157",
            "city": "مسجدسلیمان",
            "province": "خوزستان"
        },
        {
            "lat": "36.5434579",
            "lon": "53.054702300000002",
            "lat+": "36.543681599999999",
            "lon+": "53.055331600000002",
            "lat-": "36.5428468",
            "lon-": "53.052767500000002",
            "city": "میانرود",
            "province": "خوزستان"
        },
        {
            "lat": "31.535380017619001",
            "lon": "49.403813412668804",
            "lat+": "31.7207817",
            "lon+": "49.711825300000001",
            "lat-": "31.343949899999998",
            "lon-": "49.148117200000002",
            "city": "هفتگل",
            "province": "خوزستان"
        },
        {
            "lat": "30.311199006151401",
            "lon": "49.735430008286599",
            "lat+": "30.598898599999998",
            "lon+": "50.2087729",
            "lat-": "30.010107300000001",
            "lon-": "49.475898399999998",
            "city": "هندیجان",
            "province": "خوزستان"
        },
        {
            "lat": "35.704055028149597",
            "lon": "51.113207935451904",
            "lat+": "35.7425067",
            "lon+": "51.197470299999999",
            "lat-": "35.662363300000003",
            "lon-": "51.020417600000002",
            "city": "قلعه تل",
            "province": "خوزستان"
        },
        {
            "lat": "35.704055028149597",
            "lon": "51.113207935451904",
            "lat+": "35.7425067",
            "lon+": "51.197470299999999",
            "lat-": "35.662363300000003",
            "lon-": "51.020417600000002",
            "city": "قلعه خواجه",
            "province": "خوزستان"
        },
        {
            "lat": "36.813190669951403",
            "lon": "48.590766080660302",
            "lat+": "36.855213200000001",
            "lon+": "48.648032700000002",
            "lat-": "36.704810000000002",
            "lon-": "48.466714899999999",
            "city": "چورزق",
            "province": "زنجان"
        },
        {
            "lat": "32.687742707226597",
            "lon": "51.685818555159003",
            "lat+": "32.688196300000001",
            "lon+": "51.6873176",
            "lat-": "32.686444299999998",
            "lon-": "51.685524800000003",
            "city": "ویس",
            "province": "خوزستان"
        },
        {
            "lat": "34.115072625379",
            "lon": "49.7022031340694",
            "lat+": "34.115510499999999",
            "lon+": "49.702649299999997",
            "lat-": "34.114621700000001",
            "lon-": "49.701774299999997",
            "city": "مقاومت",
            "province": "خوزستان"
        },
        {
            "lat": "37.1057982322315",
            "lon": "58.510100798862503",
            "lat+": "37.106328499999996",
            "lon+": "58.510337900000003",
            "lat-": "37.105722200000002",
            "lon-": "58.509829000000003",
            "city": "حلب",
            "province": "زنجان"
        },
        {
            "lat": "36.268915152789397",
            "lon": "49.151321776987899",
            "lat+": "36.430462599999998",
            "lon+": "49.306003500000003",
            "lat-": "36.1542429",
            "lon-": "48.940178099999997",
            "city": "خرمدره",
            "province": "زنجان"
        },
        {
            "lat": "36.0990284759093",
            "lon": "49.185497050396897",
            "lat+": "36.387293999999997",
            "lon+": "49.436378900000001",
            "lat-": "35.873404700000002",
            "lon-": "48.902631499999998",
            "city": "ابهر",
            "province": "زنجان"
        },
        {
            "lat": "36.634905549507302",
            "lon": "48.406726873499899",
            "lat+": "36.641844300000002",
            "lon+": "48.416826399999998",
            "lat-": "36.627699399999997",
            "lon-": "48.388852999999997",
            "city": "دندی",
            "province": "زنجان"
        },
        {
            "lat": "31.275860093020899",
            "lon": "47.913290590593803",
            "lat+": "31.6736176",
            "lon+": "48.3182756",
            "lat-": "30.897151999999998",
            "lon-": "47.683421799999998",
            "city": "هویزه",
            "province": "خوزستان"
        },
        {
            "lat": "36.440894073296199",
            "lon": "48.8916250874883",
            "lat+": "36.711626799999998",
            "lon+": "49.168662400000002",
            "lat-": "36.230492699999999",
            "lon-": "48.557012399999998",
            "city": "سلطانیه",
            "province": "زنجان"
        },
        {
            "lat": "36.846427917326302",
            "lon": "48.219714104043902",
            "lat+": "37.252113600000001",
            "lon+": "48.917771600000002",
            "lat-": "36.452245099999999",
            "lon-": "47.427909800000002",
            "city": "زنجان",
            "province": "زنجان"
        },
        {
            "lat": "37.183178992109497",
            "lon": "49.530579021265403",
            "lat+": "37.186035400000002",
            "lon+": "49.5782545",
            "lat-": "37.175457199999997",
            "lon-": "49.508741100000002",
            "city": "آب بر",
            "province": "زنجان"
        },
        {
            "lat": "35.956930219724299",
            "lon": "47.847773192467002",
            "lat+": "35.984514599999997",
            "lon+": "48.102833799999999",
            "lat-": "35.945240499999997",
            "lon-": "47.802027799999998",
            "city": "قیدار",
            "province": "زنجان"
        },
        {
            "lat": "36.142228274333803",
            "lon": "49.226668987093298",
            "lat+": "36.143007099999998",
            "lon+": "49.227840499999999",
            "lat-": "36.140873999999997",
            "lon-": "49.225676700000001",
            "city": "هیدج",
            "province": "زنجان"
        },
        {
            "lat": "35.887578209375697",
            "lon": "48.162420141332902",
            "lat+": "35.954908799999998",
            "lon+": "48.1884668",
            "lat-": "35.854761099999997",
            "lon-": "48.102270300000001",
            "city": "گرماب",
            "province": "زنجان"
        },
        {
            "lat": "33.208070388982598",
            "lon": "46.922181479903699",
            "lat+": "33.222448100000001",
            "lon+": "46.963782500000001",
            "lat-": "33.172791400000001",
            "lon-": "46.913473500000002",
            "city": "زرین آباد",
            "province": "زنجان"
        },
        {
            "lat": "32.373013002429701",
            "lon": "51.366737670497699",
            "lat+": "32.377121000000002",
            "lon+": "51.366944699999998",
            "lat-": "32.365719400000003",
            "lon-": "51.366598600000003",
            "city": "زرین رود",
            "province": "زنجان"
        },
        {
            "lat": "35.721110711804897",
            "lon": "51.434569222222798",
            "lat+": "35.7248856",
            "lon+": "51.443572099999997",
            "lat-": "35.715912199999998",
            "lon-": "51.424635500000001",
            "city": "سهرورد",
            "province": "زنجان"
        },
        {
            "lat": "35.476667300000003",
            "lon": "52.162448599999998",
            "lat+": "35.507307599999997",
            "lon+": "52.172903400000003",
            "lat-": "35.408827799999997",
            "lon-": "52.141546900000002",
            "city": "ایوانکی",
            "province": "سمنان"
        },
        {
            "lat": "34.901161128949603",
            "lon": "52.640757268024601",
            "lat+": "35.557358000000001",
            "lon+": "52.871257100000001",
            "lat-": "34.280106400000001",
            "lon-": "52.365989300000003",
            "city": "آرادان",
            "province": "سمنان"
        },
        {
            "lat": "35.704055028149597",
            "lon": "51.113207935451904",
            "lat+": "35.7425067",
            "lon+": "51.197470299999999",
            "lat-": "35.662363300000003",
            "lon-": "51.020417600000002",
            "city": "صائین قلعه",
            "province": "زنجان"
        },
        {
            "lat": "36.646275299798802",
            "lon": "47.582069968328597",
            "lat+": "36.959311499999998",
            "lon+": "47.9714186",
            "lat-": "36.327863600000001",
            "lon-": "47.1736687",
            "city": "ماه نشان",
            "province": "زنجان"
        },
        {
            "lat": "35.424796420725798",
            "lon": "54.672255062842297",
            "lat+": "37.328185900000001",
            "lon+": "57.056779800000001",
            "lat-": "34.239121699999998",
            "lon-": "51.832748899999999",
            "city": "سمنان",
            "province": "سمنان"
        },
        {
            "lat": "35.560273683141602",
            "lon": "54.349847443680702",
            "lat+": "36.545490700000002",
            "lon+": "54.807972100000001",
            "lat-": "34.245165999999998",
            "lon-": "53.702826999999999",
            "city": "دامغان",
            "province": "سمنان"
        },
        {
            "lat": "35.753058063871997",
            "lon": "51.447205244844803",
            "lat+": "35.753226099999999",
            "lon+": "51.448646099999998",
            "lat-": "35.752922400000003",
            "lon-": "51.446233399999997",
            "city": "دیباج",
            "province": "سمنان"
        },
        {
            "lat": "37.069616302193701",
            "lon": "54.879637686965602",
            "lat+": "37.069645899999998",
            "lon+": "54.879778799999997",
            "lat-": "37.069287199999998",
            "lon-": "54.877434100000002",
            "city": "بسطام",
            "province": "سمنان"
        },
        {
            "lat": "34.912600480939098",
            "lon": "53.1577600544842",
            "lat+": "35.714237799999999",
            "lon+": "53.528458899999997",
            "lat-": "34.232343399999998",
            "lon-": "52.793620599999997",
            "city": "سرخه",
            "province": "سمنان"
        },
        {
            "lat": "32.610649432731201",
            "lon": "51.605041755924901",
            "lat+": "32.617347799999997",
            "lon+": "51.617062900000001",
            "lat-": "32.605836500000002",
            "lon-": "51.591571199999997",
            "city": "امیریه",
            "province": "سمنان"
        },
        {
            "lat": "35.945468667962103",
            "lon": "53.425921046571098",
            "lat+": "36.176768299999999",
            "lon+": "53.849789000000001",
            "lat-": "35.7585628",
            "lon-": "53.015569900000003",
            "city": "شهمیرزاد",
            "province": "سمنان"
        },
        {
            "lat": "35.6652620690502",
            "lon": "51.230234019899498",
            "lat+": "35.665551200000003",
            "lon+": "51.230889500000004",
            "lat-": "35.663151800000001",
            "lon-": "51.227926699999998",
            "city": "مجن",
            "province": "سمنان"
        },
        {
            "lat": "34.945266266288598",
            "lon": "52.174272718629403",
            "lat+": "35.576775699999999",
            "lon+": "52.524629099999999",
            "lat-": "34.397059800000001",
            "lon-": "51.832748899999999",
            "city": "گرمسار",
            "province": "سمنان"
        },
        {
            "lat": "36.988003314422599",
            "lon": "56.396696946682702",
            "lat+": "36.992514399999997",
            "lon+": "56.4006422",
            "lat-": "36.985877100000003",
            "lon-": "56.382054500000002",
            "city": "کلاته خیج",
            "province": "سمنان"
        },
        {
            "lat": "35.439028519146802",
            "lon": "55.6094937665194",
            "lat+": "36.902492000000002",
            "lon+": "57.056779800000001",
            "lat-": "34.239121699999998",
            "lon-": "54.568702999999999",
            "city": "شاهرود",
            "province": "سمنان"
        },
        {
            "lat": "29.634617973889199",
            "lon": "60.191154579029501",
            "lat+": "30.768008900000002",
            "lon+": "61.319243499999999",
            "lat-": "28.547291900000001",
            "lon-": "59.422242400000002",
            "city": "زاهدان",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "27.7347454246441",
            "lon": "60.1381478349509",
            "lat+": "28.733315099999999",
            "lon+": "61.228502900000002",
            "lat-": "26.7632078",
            "lon-": "58.9555164",
            "city": "ایرانشهر",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "34.325616400000001",
            "lon": "47.080248599999997",
            "lat+": "34.329101100000003",
            "lon+": "47.082854400000002",
            "lat-": "34.322703799999999",
            "lon-": "47.078465299999998",
            "city": "بنت",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "36.6223419733697",
            "lon": "56.055874817112098",
            "lat+": "37.328185900000001",
            "lon+": "56.861859099999997",
            "lat-": "36.142588199999999",
            "lon-": "55.308608700000001",
            "city": "میامی",
            "province": "سمنان"
        },
        {
            "lat": "35.738835727378003",
            "lon": "53.325290036694497",
            "lat+": "35.874724399999998",
            "lon+": "53.592863399999999",
            "lat-": "35.5842429",
            "lon-": "53.066449300000002",
            "city": "مهدی شهر",
            "province": "سمنان"
        },
        {
            "lat": "25.2969510216628",
            "lon": "60.660778441577001",
            "lat+": "25.2985769",
            "lon+": "60.664376900000001",
            "lat-": "25.296511299999999",
            "lon-": "60.653333600000003",
            "city": "راسک",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "30.8189628088615",
            "lon": "61.640587842208298",
            "lat+": "30.982593600000001",
            "lon+": "61.811597900000002",
            "lat-": "30.6092762",
            "lon-": "61.502500900000001",
            "city": "زهک",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "28.184775032892301",
            "lon": "61.252649587318501",
            "lat+": "28.900387299999998",
            "lon+": "62.781752500000003",
            "lat-": "27.455990100000001",
            "lon-": "60.1683618",
            "city": "خاش",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "36.474704199999998",
            "lon": "50.417501399999999",
            "lat+": "36.4806223",
            "lon+": "50.430676400000003",
            "lat-": "36.470975899999999",
            "lon-": "50.414667399999999",
            "city": "زرآباد",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "35.680911620705302",
            "lon": "51.359452232651499",
            "lat+": "35.680999999999997",
            "lon+": "51.361070599999998",
            "lat-": "35.6808786",
            "lon-": "51.358860700000001",
            "city": "زابلی",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "27.352164229296299",
            "lon": "62.560721551672302",
            "lat+": "28.088901799999999",
            "lon+": "63.321851299999999",
            "lat-": "26.5765779",
            "lon-": "61.728422799999997",
            "city": "سراوان",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "31.8867573868664",
            "lon": "54.342955888259702",
            "lat+": "31.887436099999999",
            "lon+": "54.343857399999997",
            "lat-": "31.8832086",
            "lon-": "54.339700499999999",
            "city": "چاه بهار",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "30.8361667810819",
            "lon": "60.920794110369201",
            "lat+": "31.478568599999999",
            "lon+": "61.741443599999997",
            "lat-": "30.0966916",
            "lon-": "59.9354455",
            "city": "زابل",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "27.1892920617139",
            "lon": "56.2453899582584",
            "lat+": "27.189293500000002",
            "lon+": "56.245489200000002",
            "lat-": "27.189266700000001",
            "lon-": "56.243060999999997",
            "city": "دوست محمد",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "27.316869117876202",
            "lon": "61.871376508073403",
            "lat+": "27.900460500000001",
            "lon+": "62.514185900000001",
            "lat-": "26.5401712",
            "lon-": "61.183059100000001",
            "city": "سوران",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "26.712299667088601",
            "lon": "59.542230487156097",
            "lat+": "27.0613952",
            "lon+": "59.980650199999999",
            "lat-": "26.379260200000001",
            "lon-": "58.993721299999997",
            "city": "فنوج",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "26.075804984808499",
            "lon": "60.831160830915699",
            "lat+": "26.526983000000001",
            "lon+": "61.308173799999999",
            "lat-": "25.702794300000001",
            "lon-": "60.328845800000003",
            "city": "قصرقند",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "25.665164530294401",
            "lon": "59.902319682662402",
            "lat+": "25.992252700000002",
            "lon+": "60.778146399999997",
            "lat-": "25.284391500000002",
            "lon-": "58.9956703",
            "city": "کنارک",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "28.846667771706901",
            "lon": "61.327855018478402",
            "lat+": "29.3842447",
            "lon+": "62.0496494",
            "lat-": "28.330978200000001",
            "lon-": "60.709075599999998",
            "city": "میرجاوه",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "26.449638885826499",
            "lon": "61.409259703883102",
            "lat+": "27.065123499999999",
            "lon+": "62.316500300000001",
            "lat-": "25.812604100000001",
            "lon-": "60.619768899999997",
            "city": "سرباز",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "35.780031149999999",
            "lon": "51.424803850000004",
            "lat+": "35.780382000000003",
            "lon+": "51.426822199999997",
            "lat-": "35.779680300000003",
            "lon-": "51.422785500000003",
            "city": "گشت",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "31.3878327274833",
            "lon": "48.692647762219401",
            "lat+": "31.3904192",
            "lon+": "48.694946199999997",
            "lat-": "31.386467400000001",
            "lon-": "48.691441699999999",
            "city": "علی اکبر",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "29.832754663131698",
            "lon": "53.387496865527503",
            "lat+": "30.020172800000001",
            "lon+": "53.739028400000002",
            "lat-": "29.647880000000001",
            "lon-": "53.1239366",
            "city": "ارسنجان",
            "province": "فارس"
        },
        {
            "lat": "35.644198668688901",
            "lon": "51.347852759072197",
            "lat+": "35.644844599999999",
            "lon+": "51.350653899999998",
            "lat-": "35.643960900000003",
            "lon-": "51.346805699999997",
            "city": "محمدی",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "29.145083483199599",
            "lon": "54.004161419409897",
            "lat+": "29.512124",
            "lon+": "54.481785100000003",
            "lat-": "28.830416199999998",
            "lon-": "53.567160899999998",
            "city": "استهبان",
            "province": "فارس"
        },
        {
            "lat": "35.633504090498803",
            "lon": "51.311647921747898",
            "lat+": "35.633867000000002",
            "lon+": "51.311983499999997",
            "lat-": "35.633138899999999",
            "lon-": "51.311345099999997",
            "city": "نوک آباد",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "29.482304659049401",
            "lon": "60.8143801571821",
            "lat+": "29.4825692",
            "lon+": "60.816925400000002",
            "lat-": "29.481847900000002",
            "lon-": "60.797392799999997",
            "city": "نصرت آباد",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "26.393384605760399",
            "lon": "59.913804992818797",
            "lat+": "27.015333800000001",
            "lon+": "60.895156700000001",
            "lat-": "25.885869799999998",
            "lon-": "58.843446100000001",
            "city": "نیک شهر",
            "province": "سیستان و بلوچستان"
        },
        {
            "lat": "30.722268236512701",
            "lon": "52.397899653701302",
            "lat+": "31.213161599999999",
            "lon+": "52.920180700000003",
            "lat-": "30.234889500000001",
            "lon-": "51.786393799999999",
            "city": "اقلید",
            "province": "فارس"
        },
        {
            "lat": "29.600667074212399",
            "lon": "52.433358300601398",
            "lat+": "29.949648799999999",
            "lon+": "53.096184200000003",
            "lat-": "29.191849300000001",
            "lon-": "51.803992100000002",
            "city": "شیراز",
            "province": "فارس"
        },
        {
            "lat": "29.776183169707199",
            "lon": "52.548665115869198",
            "lat+": "29.776638299999998",
            "lon+": "52.548979099999997",
            "lat-": "29.772776700000001",
            "lon-": "52.546043599999997",
            "city": "اهل",
            "province": "فارس"
        },
        {
            "lat": "36.8387757536103",
            "lon": "54.4803951260471",
            "lat+": "36.847004699999999",
            "lon+": "54.480533299999998",
            "lat-": "36.835138000000001",
            "lon-": "54.477642600000003",
            "city": "اوز",
            "province": "فارس"
        },
        {
            "lat": "31.2607128111047",
            "lon": "52.510135867500999",
            "lat+": "31.670557599999999",
            "lon+": "53.245821499999998",
            "lat-": "30.774695900000001",
            "lon-": "51.934122600000002",
            "city": "آباده",
            "province": "فارس"
        },
        {
            "lat": "32.605173488115902",
            "lon": "54.767440695799998",
            "lat+": "33.362711300000001",
            "lon+": "56.306925800000002",
            "lat-": "32.036486799999999",
            "lon-": "53.014371799999999",
            "city": "اردکان",
            "province": "فارس"
        },
        {
            "lat": "36.344694377045101",
            "lon": "48.198654893551897",
            "lat+": "36.565506499999998",
            "lon+": "48.578094399999998",
            "lat-": "36.078560299999999",
            "lon-": "47.874462700000002",
            "city": "ایج",
            "province": "فارس"
        },
        {
            "lat": "30.303325945181498",
            "lon": "53.665996049646502",
            "lat+": "30.7474107",
            "lon+": "54.106344700000001",
            "lat-": "29.786736900000001",
            "lon-": "53.271935200000001",
            "city": "بوانات",
            "province": "فارس"
        },
        {
            "lat": "30.270469447322402",
            "lon": "57.122950361068298",
            "lat+": "30.2712635",
            "lon+": "57.1238782",
            "lat-": "30.269682799999998",
            "lon-": "57.122028",
            "city": "بیرم",
            "province": "فارس"
        },
        {
            "lat": "29.750174302766698",
            "lon": "54.250394552908602",
            "lat+": "29.776260099999998",
            "lon+": "54.314820699999999",
            "lat-": "29.609881600000001",
            "lon-": "54.049807800000004",
            "city": "آباده طشک",
            "province": "فارس"
        },
        {
            "lat": "38.245569043412701",
            "lon": "48.289116249917697",
            "lat+": "38.247283000000003",
            "lon+": "48.2913152",
            "lat-": "38.243886600000003",
            "lon-": "48.285468600000002",
            "city": "بیضا",
            "province": "فارس"
        },
        {
            "lat": "31.901496095034499",
            "lon": "54.3236675590922",
            "lat+": "31.915620000000001",
            "lon+": "54.340320800000001",
            "lat-": "31.889711500000001",
            "lon-": "54.3088531",
            "city": "امام شهر",
            "province": "فارس"
        },
        {
            "lat": "35.701278926394899",
            "lon": "51.364418501884103",
            "lat+": "35.702396899999997",
            "lon+": "51.364888999999998",
            "lat-": "35.700691800000001",
            "lon-": "51.364168900000003",
            "city": "حسامی",
            "province": "فارس"
        },
        {
            "lat": "29.501304059933801",
            "lon": "53.263290242913897",
            "lat+": "29.7027596",
            "lon+": "53.5912887",
            "lat-": "29.329488600000001",
            "lon-": "52.9644762",
            "city": "خرامه",
            "province": "فارس"
        },
        {
            "lat": "30.591671804320601",
            "lon": "55.538817505722598",
            "lat+": "30.689156000000001",
            "lon+": "55.921385200000003",
            "lat-": "30.377072600000002",
            "lon-": "55.454968800000003",
            "city": "باب انار",
            "province": "فارس"
        },
        {
            "lat": "36.343956354339703",
            "lon": "59.620645954681599",
            "lat+": "36.362772700000001",
            "lon+": "59.632558199999998",
            "lat-": "36.327395799999998",
            "lon-": "59.605494700000001",
            "city": "بهمن",
            "province": "فارس"
        },
        {
            "lat": "35.665653676987603",
            "lon": "51.453103948079097",
            "lat+": "35.668841700000002",
            "lon+": "51.4596898",
            "lat-": "35.660262500000002",
            "lon-": "51.445597800000002",
            "city": "خاوران",
            "province": "فارس"
        },
        {
            "lat": "28.6968517734763",
            "lon": "53.352628101086303",
            "lat+": "29.130681899999999",
            "lon+": "54.0478065",
            "lat-": "28.292861500000001",
            "lon-": "52.7611408",
            "city": "جهرم",
            "province": "فارس"
        },
        {
            "lat": "27.968506727487998",
            "lon": "53.064581037583402",
            "lat+": "28.286058700000002",
            "lon+": "53.755509199999999",
            "lat-": "27.670268100000001",
            "lon-": "52.397779999999997",
            "city": "خنج",
            "province": "فارس"
        },
        {
            "lat": "35.773483255353",
            "lon": "51.307307841873602",
            "lat+": "35.7736254",
            "lon+": "51.3074814",
            "lat-": "35.7733293",
            "lon-": "51.307120500000003",
            "city": "جنت شهر",
            "province": "فارس"
        },
        {
            "lat": "35.786683199999999",
            "lon": "51.3095997",
            "lat+": "35.786739699999998",
            "lon+": "51.310990400000001",
            "lat-": "35.785149199999999",
            "lon-": "51.308671599999997",
            "city": "خشت",
            "province": "فارس"
        },
        {
            "lat": "35.713016169500499",
            "lon": "51.3593712347081",
            "lat+": "35.7142385",
            "lon+": "51.365084500000002",
            "lat-": "35.712753300000003",
            "lon-": "51.358243799999997",
            "city": "داریان",
            "province": "فارس"
        },
        {
            "lat": "34.663981438120302",
            "lon": "50.896460941421203",
            "lat+": "34.664532100000002",
            "lon+": "50.897015699999997",
            "lat-": "34.662624200000003",
            "lon-": "50.895156700000001",
            "city": "دبیران",
            "province": "فارس"
        },
        {
            "lat": "32.644835479445398",
            "lon": "51.674405806314198",
            "lat+": "32.647157399999998",
            "lon+": "51.675564899999998",
            "lat-": "32.644055799999997",
            "lon-": "51.673194899999999",
            "city": "خانه زنیان",
            "province": "فارس"
        },
        {
            "lat": "29.761555363991",
            "lon": "52.719940117118803",
            "lat+": "29.762048",
            "lon+": "52.720305199999999",
            "lat-": "29.760685800000001",
            "lon-": "52.719402199999998",
            "city": "زرقان",
            "province": "فارس"
        },
        {
            "lat": "35.303513383105503",
            "lon": "46.989465329998502",
            "lat+": "35.303657000000001",
            "lon+": "46.993392200000002",
            "lat-": "35.300685600000001",
            "lon-": "46.987463599999998",
            "city": "خومه زار",
            "province": "فارس"
        },
        {
            "lat": "30.339587314480202",
            "lon": "48.310523917827403",
            "lat+": "30.3397459",
            "lon+": "48.310696299999996",
            "lat-": "30.3393789",
            "lon-": "48.310271999999998",
            "city": "سده",
            "province": "فارس"
        },
        {
            "lat": "34.780760367153597",
            "lon": "48.498413267572701",
            "lat+": "34.780816100000003",
            "lon+": "48.498496500000002",
            "lat-": "34.779836899999999",
            "lon-": "48.497014299999996",
            "city": "ششده",
            "province": "فارس"
        },
        {
            "lat": "28.529856308129499",
            "lon": "54.897567619616602",
            "lat+": "28.942720000000001",
            "lon+": "55.451984899999999",
            "lat-": "28.0272614",
            "lon-": "54.101162100000003",
            "city": "داراب",
            "province": "فارس"
        },
        {
            "lat": "31.772304463240001",
            "lon": "54.287243397056301",
            "lat+": "31.799837799999999",
            "lon+": "54.359459999999999",
            "lat-": "31.7288706",
            "lon-": "54.170706699999997",
            "city": "سورمق",
            "province": "فارس"
        },
        {
            "lat": "34.635891290863",
            "lon": "50.8895359332965",
            "lat+": "34.636110000000002",
            "lon+": "50.890360800000003",
            "lat-": "34.634346299999997",
            "lon-": "50.889405699999998",
            "city": "سیدان",
            "province": "فارس"
        },
        {
            "lat": "34.607352458276999",
            "lon": "50.843905950998199",
            "lat+": "34.613890499999997",
            "lon+": "50.855756",
            "lat-": "34.600644699999997",
            "lon-": "50.831508599999999",
            "city": "صفاشهر",
            "province": "فارس"
        },
        {
            "lat": "29.233611194752701",
            "lon": "53.114751947738299",
            "lat+": "29.450978299999999",
            "lon+": "53.467339799999998",
            "lat-": "29.015267099999999",
            "lon-": "52.7350159",
            "city": "سروستان",
            "province": "فارس"
        },
        {
            "lat": "28.623876301180999",
            "lon": "52.208198801693001",
            "lat+": "29.191892899999999",
            "lon+": "52.536073600000002",
            "lat-": "28.019000999999999",
            "lon-": "51.794001000000002",
            "city": "فراشبند",
            "province": "فارس"
        },
        {
            "lat": "30.020303682928098",
            "lon": "53.180723005217999",
            "lat+": "30.063626200000002",
            "lon+": "53.280700000000003",
            "lat-": "29.930930700000001",
            "lon-": "53.148588799999999",
            "city": "سعادت شهر",
            "province": "فارس"
        },
        {
            "lat": "32.860647186106803",
            "lon": "51.553004714741903",
            "lat+": "32.861015399999999",
            "lon+": "51.5534423",
            "lat-": "32.860289700000003",
            "lon-": "51.552574499999999",
            "city": "شهر جدید صدرا",
            "province": "فارس"
        },
        {
            "lat": "28.8981268690818",
            "lon": "52.561470662992598",
            "lat+": "29.258121500000001",
            "lon+": "52.963849500000002",
            "lat-": "28.469799800000001",
            "lon-": "52.111449399999998",
            "city": "فیروزآباد",
            "province": "فارس"
        },
        {
            "lat": "32.716815328706303",
            "lon": "47.313132008497497",
            "lat+": "32.719588299999998",
            "lon+": "47.332164599999999",
            "lat-": "32.700372299999998",
            "lon-": "47.307973799999999",
            "city": "قیر",
            "province": "فارس"
        },
        {
            "lat": "32.6286062404264",
            "lon": "51.589645360408397",
            "lat+": "32.638439499999997",
            "lon+": "51.604832100000003",
            "lat-": "32.616880199999997",
            "lon-": "51.572817200000003",
            "city": "قائمیه",
            "province": "فارس"
        },
        {
            "lat": "28.948811000890998",
            "lon": "53.785483467217503",
            "lat+": "29.425582599999998",
            "lon+": "54.261216500000003",
            "lat-": "28.5046669",
            "lon-": "53.3403584",
            "city": "فسا",
            "province": "فارس"
        },
        {
            "lat": "29.220425525649699",
            "lon": "52.7170327553848",
            "lat+": "29.384643199999999",
            "lon+": "53.038304699999998",
            "lat-": "29.0420245",
            "lon-": "52.449623899999999",
            "city": "کوار",
            "province": "فارس"
        },
        {
            "lat": "29.521002690940399",
            "lon": "51.713112446213302",
            "lat+": "29.917396799999999",
            "lon+": "52.141823899999999",
            "lat-": "29.096357099999999",
            "lon-": "51.270052499999998",
            "city": "کازرون",
            "province": "فارس"
        },
        {
            "lat": "32.647334131743897",
            "lon": "51.6412680911723",
            "lat+": "32.647345199999997",
            "lon+": "51.642065899999999",
            "lat-": "32.645629900000003",
            "lon-": "51.637287800000003",
            "city": "کوهنجان",
            "province": "فارس"
        },
        {
            "lat": "27.650105169606402",
            "lon": "53.702959055496898",
            "lat+": "27.809973100000001",
            "lon+": "54.242910100000003",
            "lat-": "27.435241900000001",
            "lon-": "53.180948200000003",
            "city": "گراش",
            "province": "فارس"
        },
        {
            "lat": "28.6446998307756",
            "lon": "53.643713188917303",
            "lat+": "28.644806599999999",
            "lon+": "53.646895999999998",
            "lat-": "28.643279499999998",
            "lon-": "53.643095600000002",
            "city": "قطب آباد",
            "province": "فارس"
        },
        {
            "lat": "27.405362468950901",
            "lon": "53.3469599478234",
            "lat+": "27.894496700000001",
            "lon+": "54.013416599999999",
            "lat-": "27.048347100000001",
            "lon-": "52.615861500000001",
            "city": "لامرد",
            "province": "فارس"
        },
        {
            "lat": "35.636682359085498",
            "lon": "51.493658502253901",
            "lat+": "35.636882800000002",
            "lon+": "51.4944354",
            "lat-": "35.6366254",
            "lon-": "51.491500000000002",
            "city": "مصیری",
            "province": "فارس"
        },
        {
            "lat": "29.674957214184399",
            "lon": "54.3377442383755",
            "lat+": "29.781810100000001",
            "lon+": "54.375671799999999",
            "lat-": "29.4129501",
            "lon-": "54.301526899999999",
            "city": "مشکان",
            "province": "فارس"
        },
        {
            "lat": "32.651667164189099",
            "lon": "51.363129905315098",
            "lat+": "32.651723099999998",
            "lon+": "51.365405099999997",
            "lat-": "32.6514199",
            "lon-": "51.362666400000002",
            "city": "گله دار",
            "province": "فارس"
        },
        {
            "lat": "30.100719156821999",
            "lon": "52.645749027939303",
            "lat+": "30.6233298",
            "lon+": "53.240716300000003",
            "lat-": "29.688393900000001",
            "lon-": "51.972854900000002",
            "city": "مرودشت",
            "province": "فارس"
        },
        {
            "lat": "35.474537499999997",
            "lon": "51.663169000000003",
            "lat+": "35.475990600000003",
            "lon+": "51.663406000000002",
            "lat-": "35.473914000000001",
            "lon-": "51.662891999999999",
            "city": "لار",
            "province": "فارس"
        },
        {
            "lat": "36.2689385524518",
            "lon": "50.0061006819531",
            "lat+": "36.269107599999998",
            "lon+": "50.0125484",
            "lat-": "36.267763199999997",
            "lon-": "50.005122200000002",
            "city": "کره ای",
            "province": "فارس"
        },
        {
            "lat": "35.713657523802297",
            "lon": "50.912211580676399",
            "lat+": "35.713921499999998",
            "lon+": "50.912514000000002",
            "lat-": "35.711993700000001",
            "lon-": "50.911846199999999",
            "city": "نوبندگان",
            "province": "فارس"
        },
        {
            "lat": "35.722163183196201",
            "lon": "51.4309677152836",
            "lat+": "35.722167200000001",
            "lon+": "51.431348300000003",
            "lat-": "35.722152000000001",
            "lon-": "51.428046600000002",
            "city": "وراوی",
            "province": "فارس"
        },
        {
            "lat": "35.637175444319297",
            "lon": "51.390115572709497",
            "lat+": "35.637281799999997",
            "lon+": "51.390743499999999",
            "lat-": "35.636597399999999",
            "lon-": "51.388244999999998",
            "city": "لطیفی",
            "province": "فارس"
        },
        {
            "lat": "34.043062200000001",
            "lon": "48.3128782",
            "lat+": "34.049297299999999",
            "lon+": "48.343565400000003",
            "lat-": "34.037659099999999",
            "lon-": "48.263675800000001",
            "city": "نورآباد",
            "province": "فارس"
        },
        {
            "lat": "36.082663560539402",
            "lon": "49.946934559231401",
            "lat+": "36.101239",
            "lon+": "50.046626000000003",
            "lat-": "36.001261200000002",
            "lon-": "49.711218000000002",
            "city": "ارداق",
            "province": "قزوین"
        },
        {
            "lat": "35.768944922351899",
            "lon": "51.483183717313104",
            "lat+": "35.768990000000002",
            "lon+": "51.483230399999997",
            "lat-": "35.768811499999998",
            "lon-": "51.483010499999999",
            "city": "مبارک آباد",
            "province": "فارس"
        },
        {
            "lat": "36.137587762627199",
            "lon": "49.786574072208197",
            "lat+": "36.157952399999999",
            "lon+": "49.816065100000003",
            "lat-": "36.0995183",
            "lon-": "49.732064999999999",
            "city": "اقبالیه",
            "province": "قزوین"
        },
        {
            "lat": "35.9049092893747",
            "lon": "52.208256352587497",
            "lat+": "35.9195274",
            "lon+": "52.217894600000001",
            "lat-": "35.899636800000003",
            "lon-": "52.192337999999999",
            "city": "آبگرم",
            "province": "قزوین"
        },
        {
            "lat": "36.086655379696303",
            "lon": "50.347274927700703",
            "lat+": "36.316495199999999",
            "lon+": "50.679401900000002",
            "lat-": "35.845232000000003",
            "lon-": "50.070406599999998",
            "city": "آبیک",
            "province": "قزوین"
        },
        {
            "lat": "27.633588018384",
            "lon": "52.7642227163443",
            "lat+": "28.030220199999999",
            "lon+": "53.233556800000002",
            "lat-": "27.331794899999998",
            "lon-": "52.352244300000002",
            "city": "مهر",
            "province": "فارس"
        },
        {
            "lat": "35.586727946616698",
            "lon": "51.258073019089302",
            "lat+": "35.587602599999997",
            "lon+": "51.259853900000003",
            "lat-": "35.583469600000001",
            "lon-": "51.251429999999999",
            "city": "بیدستان",
            "province": "قزوین"
        },
        {
            "lat": "36.298272709606202",
            "lon": "50.014020259513998",
            "lat+": "36.298353599999999",
            "lon+": "50.015552300000003",
            "lat-": "36.298051399999999",
            "lon-": "50.011528200000001",
            "city": "خاکعلی",
            "province": "قزوین"
        },
        {
            "lat": "35.846949690925598",
            "lon": "50.994184048017402",
            "lat+": "35.851920800000002",
            "lon+": "50.999705800000001",
            "lat-": "35.842476300000001",
            "lon-": "50.988059200000002",
            "city": "آوج",
            "province": "قزوین"
        },
        {
            "lat": "36.523377345071701",
            "lon": "50.232187231240601",
            "lat+": "36.539094400000003",
            "lon+": "50.2880082",
            "lat-": "36.4861377",
            "lon-": "50.210264799999997",
            "city": "رازمیان",
            "province": "قزوین"
        },
        {
            "lat": "35.953535543018504",
            "lon": "49.489567159050203",
            "lat+": "36.003837500000003",
            "lon+": "49.503619700000002",
            "lat-": "35.9341917",
            "lon-": "49.464145299999998",
            "city": "خرمدشت",
            "province": "قزوین"
        },
        {
            "lat": "34.820110570589698",
            "lon": "48.475027021287403",
            "lat+": "34.826989699999999",
            "lon+": "48.486049999999999",
            "lat-": "34.814158200000001",
            "lon-": "48.465949100000003",
            "city": "الوند",
            "province": "قزوین"
        },
        {
            "lat": "36.666318050532801",
            "lon": "49.2105392079078",
            "lat+": "36.712405699999998",
            "lon+": "49.251732500000003",
            "lat-": "36.649318299999997",
            "lon-": "49.191428700000003",
            "city": "سیردان",
            "province": "قزوین"
        },
        {
            "lat": "29.336844316291302",
            "lon": "54.4303075024403",
            "lat+": "29.909283500000001",
            "lon+": "55.281008499999999",
            "lat-": "28.708322800000001",
            "lon-": "53.408851599999998",
            "city": "نی ریز",
            "province": "فارس"
        },
        {
            "lat": "36.089875351724601",
            "lon": "49.7665805921052",
            "lat+": "36.8171228",
            "lon+": "50.8572287",
            "lat-": "35.405836299999997",
            "lon-": "48.725732800000003",
            "city": "قزوین",
            "province": "قزوین"
        },
        {
            "lat": "36.012772549747197",
            "lon": "49.542880122893799",
            "lat+": "36.360127599999998",
            "lon+": "49.882300399999998",
            "lat-": "35.671895399999997",
            "lon-": "49.141210800000003",
            "city": "تاکستان",
            "province": "قزوین"
        },
        {
            "lat": "35.734892058368303",
            "lon": "49.6103195732491",
            "lat+": "36.176490800000003",
            "lon+": "50.332061699999997",
            "lat-": "35.396477900000001",
            "lon-": "48.725732800000003",
            "city": "بوئین زهرا",
            "province": "قزوین"
        },
        {
            "lat": "35.677919205026903",
            "lon": "51.405721603632102",
            "lat+": "35.678776999999997",
            "lon+": "51.405813500000001",
            "lat-": "35.677802800000002",
            "lon-": "51.405713599999999",
            "city": "کوهین",
            "province": "قزوین"
        },
        {
            "lat": "35.953535543018504",
            "lon": "49.489567159050203",
            "lat+": "36.003837500000003",
            "lon+": "49.503619700000002",
            "lat-": "35.9341917",
            "lon-": "49.464145299999998",
            "city": "ضیاءآباد",
            "province": "قزوین"
        },
        {
            "lat": "30.553922650000001",
            "lon": "49.195151099999997",
            "lat+": "30.5542394",
            "lon+": "49.195650800000003",
            "lat-": "30.553605900000001",
            "lon-": "49.194651399999998",
            "city": "قنوات",
            "province": "قم"
        },
        {
            "lat": "35.675868276543703",
            "lon": "51.441048726816803",
            "lat+": "35.6763391",
            "lon+": "51.441649400000003",
            "lat-": "35.675613300000002",
            "lon-": "51.440010600000001",
            "city": "شال",
            "province": "قزوین"
        },
        {
            "lat": "34.952381953751697",
            "lon": "50.423390118875702",
            "lat+": "34.994390099999997",
            "lon+": "50.451323600000002",
            "lat-": "34.784453999999997",
            "lon-": "50.421524900000001",
            "city": "سلفچگان",
            "province": "قم"
        },
        {
            "lat": "32.240053570917702",
            "lon": "52.652201221237299",
            "lat+": "32.413977899999999",
            "lon+": "52.6657595",
            "lat-": "32.175299799999998",
            "lon-": "52.621054100000002",
            "city": "دستجرد",
            "province": "قم"
        },
        {
            "lat": "35.6643348014222",
            "lon": "50.997277034608203",
            "lat+": "35.664490600000001",
            "lon+": "50.997468599999998",
            "lat-": "35.6641701",
            "lon-": "50.997073100000001",
            "city": "جعفریه",
            "province": "قم"
        },
        {
            "lat": "29.6129632796526",
            "lon": "52.438938610611402",
            "lat+": "29.617518",
            "lon+": "52.441935999999998",
            "lat-": "29.606922000000001",
            "lon-": "52.435504000000002",
            "city": "محمدیه",
            "province": "قزوین"
        },
        {
            "lat": "36.523377345071701",
            "lon": "50.232187231240601",
            "lat+": "36.539094400000003",
            "lon+": "50.2880082",
            "lat-": "36.4861377",
            "lon-": "50.210264799999997",
            "city": "معلم کلایه",
            "province": "قزوین"
        },
        {
            "lat": "35.3015539797439",
            "lon": "51.712925910735301",
            "lat+": "35.301832500000003",
            "lon+": "51.713272799999999",
            "lat-": "35.3012674",
            "lon-": "51.712575000000001",
            "city": "کهک",
            "province": "قم"
        },
        {
            "lat": "35.996036451755998",
            "lon": "45.848957569773603",
            "lat+": "36.235278600000001",
            "lon+": "46.1953958",
            "lat-": "35.800366599999997",
            "lon-": "45.554956099999998",
            "city": "بانه",
            "province": "کردستان"
        },
        {
            "lat": "34.695388533144502",
            "lon": "51.0264227073176",
            "lat+": "35.182934500000002",
            "lon+": "51.964952599999997",
            "lat-": "34.149622399999998",
            "lon-": "50.086584799999997",
            "city": "قم",
            "province": "قم"
        },
        {
            "lat": "34.770511652458701",
            "lon": "48.516055459466997",
            "lat+": "34.7709069",
            "lon+": "48.518331699999997",
            "lat-": "34.770359300000003",
            "lon-": "48.515619600000001",
            "city": "دلبران",
            "province": "کردستان"
        },
        {
            "lat": "35.336257474879197",
            "lon": "47.357060309279298",
            "lat+": "35.686031399999997",
            "lon+": "47.6164597",
            "lat-": "35.016500000000001",
            "lon-": "47.109888300000001",
            "city": "دهگلان",
            "province": "کردستان"
        },
        {
            "lat": "35.353373768704301",
            "lon": "46.887422096136198",
            "lat+": "35.651195100000002",
            "lon+": "47.3299102",
            "lat-": "35.049075100000003",
            "lon-": "46.4087593",
            "city": "سنندج",
            "province": "کردستان"
        },
        {
            "lat": "35.230208013939802",
            "lon": "46.400547405426003",
            "lat+": "35.405533200000001",
            "lon+": "46.722266900000001",
            "lat-": "35.028975199999998",
            "lon-": "46.076510800000001",
            "city": "سروآباد",
            "province": "کردستان"
        },
        {
            "lat": "37.946923010716198",
            "lon": "45.990194103301903",
            "lat+": "37.998256499999997",
            "lon+": "46.093597600000003",
            "lat-": "37.937869399999997",
            "lon-": "45.9649717",
            "city": "زرینه",
            "province": "کردستان"
        },
        {
            "lat": "35.925915126408803",
            "lon": "46.975725215880601",
            "lat+": "36.352558299999998",
            "lon+": "47.493245199999997",
            "lat-": "35.570711299999999",
            "lon-": "46.521095099999997",
            "city": "دیواندره",
            "province": "کردستان"
        },
        {
            "lat": "33.156538510010101",
            "lon": "50.089558958258003",
            "lat+": "33.359484999999999",
            "lon+": "50.328739300000002",
            "lat-": "32.971796699999999",
            "lon-": "49.868134599999998",
            "city": "بوئین سفلی",
            "province": "کردستان"
        },
        {
            "lat": "36.156413938858996",
            "lon": "46.3785628724318",
            "lat+": "36.462461099999999",
            "lon+": "46.9050449",
            "lat-": "35.779221",
            "lon-": "45.842354200000003",
            "city": "سقز",
            "province": "کردستان"
        },
        {
            "lat": "35.944518576422901",
            "lon": "47.6468133181124",
            "lat+": "36.435137900000001",
            "lon+": "48.249693499999999",
            "lat-": "35.495328700000002",
            "lon-": "47.083648699999998",
            "city": "بیجار",
            "province": "کردستان"
        },
        {
            "lat": "35.633504090498803",
            "lon": "51.311647921747898",
            "lat+": "35.633867000000002",
            "lon+": "51.311983499999997",
            "lat-": "35.633138899999999",
            "lon-": "51.311345099999997",
            "city": "بلبان آباد",
            "province": "کردستان"
        },
        {
            "lat": "34.955923791614303",
            "lon": "46.914433938352502",
            "lat+": "35.170331599999997",
            "lon+": "47.337613099999999",
            "lat-": "34.738477400000001",
            "lon-": "46.502353300000003",
            "city": "کامیاران",
            "province": "کردستان"
        },
        {
            "lat": "35.229385110257297",
            "lon": "47.826159269743201",
            "lat+": "35.5786236",
            "lon+": "48.1934282",
            "lat-": "34.9239642",
            "lon-": "47.420735399999998",
            "city": "قروه",
            "province": "کردستان"
        },
        {
            "lat": "36.249262501947698",
            "lon": "47.7865153522743",
            "lat+": "36.279913399999998",
            "lon+": "47.894117000000001",
            "lat-": "36.193248400000002",
            "lon-": "47.744520999999999",
            "city": "یاسوکند",
            "province": "کردستان"
        },
        {
            "lat": "35.229181107977404",
            "lon": "47.785456389842999",
            "lat+": "35.239829899999997",
            "lon+": "47.786616000000002",
            "lat-": "35.208755600000003",
            "lon-": "47.781368000000001",
            "city": "سریش آباد",
            "province": "کردستان"
        },
        {
            "lat": "35.572223325966497",
            "lon": "46.354618333465503",
            "lat+": "35.817246900000001",
            "lon+": "46.766667900000002",
            "lat-": "35.356374000000002",
            "lon-": "45.976744699999998",
            "city": "مریوان",
            "province": "کردستان"
        },
        {
            "lat": "35.316011340392997",
            "lon": "47.022143019875799",
            "lat+": "35.316050099999998",
            "lon+": "47.0221856",
            "lat-": "35.3158539",
            "lon-": "47.021943800000003",
            "city": "کانی دینار",
            "province": "کردستان"
        },
        {
            "lat": "28.430591361301701",
            "lon": "56.532237074259299",
            "lat+": "28.811287799999999",
            "lon+": "57.0829345",
            "lat-": "28.130088000000001",
            "lon-": "56.034866600000001",
            "city": "ارزوئیه",
            "province": "کرمان"
        },
        {
            "lat": "36.3069654822066",
            "lon": "59.6513758510375",
            "lat+": "36.311585000000001",
            "lon+": "59.658414399999998",
            "lat-": "36.302242300000003",
            "lon-": "59.644601299999998",
            "city": "صاحب",
            "province": "کردستان"
        },
        {
            "lat": "30.305968496023201",
            "lon": "56.291369408719397",
            "lat+": "30.348030900000001",
            "lon+": "56.8359205",
            "lat-": "30.1958354",
            "lon-": "56.139133899999997",
            "city": "باغین",
            "province": "کرمان"
        },
        {
            "lat": "35.316011340392997",
            "lon": "47.022143019875799",
            "lat+": "35.316050099999998",
            "lon+": "47.0221856",
            "lat-": "35.3158539",
            "lon-": "47.021943800000003",
            "city": "کانی سور",
            "province": "کردستان"
        },
        {
            "lat": "29.7737627255148",
            "lon": "56.693154712397003",
            "lat+": "30.1972855",
            "lon+": "57.314723600000001",
            "lat-": "29.386711999999999",
            "lon-": "55.998769799999998",
            "city": "بردسیر",
            "province": "کرمان"
        },
        {
            "lat": "29.012717343721501",
            "lon": "56.491276943010398",
            "lat+": "29.577840999999999",
            "lon+": "56.978734199999998",
            "lat-": "28.5333459",
            "lon-": "56.038505700000002",
            "city": "بافت",
            "province": "کرمان"
        },
        {
            "lat": "38.075005500477701",
            "lon": "46.295506170933102",
            "lat+": "38.075811799999997",
            "lon+": "46.296338200000001",
            "lat-": "38.074677899999998",
            "lon-": "46.295025699999997",
            "city": "بهرمان",
            "province": "کرمان"
        },
        {
            "lat": "30.3025927710977",
            "lon": "57.090513921558802",
            "lat+": "30.309053800000001",
            "lon+": "57.090711400000004",
            "lat-": "30.302003899999999",
            "lon-": "57.090511599999999",
            "city": "پاریز",
            "province": "کرمان"
        },
        {
            "lat": "29.614529285139501",
            "lon": "57.296329377407297",
            "lat+": "31.962196200000001",
            "lon+": "59.571862799999998",
            "lat-": "26.483251500000001",
            "lon-": "54.340259400000001",
            "city": "کرمان",
            "province": "کرمان"
        },
        {
            "lat": "30.8339730903892",
            "lon": "55.290924322653098",
            "lat+": "31.110711899999998",
            "lon+": "55.694910399999998",
            "lat-": "30.543514800000001",
            "lon-": "54.944035499999998",
            "city": "انار",
            "province": "کرمان"
        },
        {
            "lat": "31.871838473529898",
            "lon": "54.3079696888665",
            "lat+": "31.872158800000001",
            "lon+": "54.308346299999997",
            "lat-": "31.8715051",
            "lon-": "54.307574600000002",
            "city": "امین شهر",
            "province": "کرمان"
        },
        {
            "lat": "30.094968016801602",
            "lon": "57.02780791472",
            "lat+": "30.0971306",
            "lon+": "57.033505400000003",
            "lat-": "30.093309699999999",
            "lon-": "57.0218226",
            "city": "جوپار",
            "province": "کرمان"
        },
        {
            "lat": "29.115836224659901",
            "lon": "58.198511746674598",
            "lat+": "29.627055299999999",
            "lon+": "58.623561799999997",
            "lat-": "28.5333462",
            "lon-": "57.700186299999999",
            "city": "بم",
            "province": "کرمان"
        },
        {
            "lat": "30.315261799999998",
            "lon": "57.077160800000001",
            "lat+": "30.318292599999999",
            "lon+": "57.080127699999998",
            "lat-": "30.308521200000001",
            "lon-": "57.075430599999997",
            "city": "خانوک",
            "province": "کرمان"
        },
        {
            "lat": "28.778532269532999",
            "lon": "57.494950657940798",
            "lat+": "29.362388899999999",
            "lon+": "58.211551999999998",
            "lat-": "28.103457800000001",
            "lon-": "56.895207800000001",
            "city": "جیرفت",
            "province": "کرمان"
        },
        {
            "lat": "28.841740119234601",
            "lon": "57.727114398532798",
            "lat+": "29.0064913",
            "lon+": "57.759715499999999",
            "lat-": "28.745675299999998",
            "lon-": "57.595918500000003",
            "city": "راین",
            "province": "کرمان"
        },
        {
            "lat": "29.234072364188201",
            "lon": "56.988245975092802",
            "lat+": "29.4563314",
            "lon+": "57.272199100000002",
            "lat-": "28.892310800000001",
            "lon-": "56.742636500000003",
            "city": "رابر",
            "province": "کرمان"
        },
        {
            "lat": "31.321673840179901",
            "lon": "57.152348921574799",
            "lat+": "31.962196200000001",
            "lon+": "57.755136899999997",
            "lat-": "30.5614268",
            "lon-": "56.430699500000003",
            "city": "راور",
            "province": "کرمان"
        },
        {
            "lat": "33.9964609430832",
            "lon": "51.426091720656999",
            "lat+": "33.996519800000002",
            "lon+": "51.426152899999998",
            "lat-": "33.995796599999998",
            "lon-": "51.425432700000002",
            "city": "زیدآباد",
            "province": "کرمان"
        },
        {
            "lat": "33.908238619579699",
            "lon": "48.732238522471803",
            "lat+": "33.908499999999997",
            "lon+": "48.732553000000003",
            "lat-": "33.907987400000003",
            "lon-": "48.7319368",
            "city": "درب بهشت",
            "province": "کرمان"
        },
        {
            "lat": "32.660302970964999",
            "lon": "51.788080667679402",
            "lat+": "32.664088300000003",
            "lon+": "51.791607999999997",
            "lat-": "32.657000799999999",
            "lon-": "51.784925200000004",
            "city": "خاتون آباد",
            "province": "کرمان"
        },
        {
            "lat": "30.941134402652299",
            "lon": "56.288113304433999",
            "lat+": "31.286374500000001",
            "lon+": "56.961896400000001",
            "lat-": "30.550184399999999",
            "lon-": "55.579827600000002",
            "city": "زرند",
            "province": "کرمان"
        },
        {
            "lat": "30.541989616477299",
            "lon": "55.895431815315497",
            "lat+": "31.233201099999999",
            "lon+": "56.689382299999998",
            "lat-": "29.907900999999999",
            "lon-": "55.264350899999997",
            "city": "رفسنجان",
            "province": "کرمان"
        },
        {
            "lat": "30.317020838007799",
            "lon": "57.028039990414797",
            "lat+": "30.324103099999999",
            "lon+": "57.037057699999998",
            "lat-": "30.315151799999999",
            "lon-": "56.998487599999997",
            "city": "زنگی آباد",
            "province": "کرمان"
        },
        {
            "lat": "36.798154810871701",
            "lon": "49.6185652855143",
            "lat+": "37.093944299999997",
            "lon+": "50.160288399999999",
            "lat-": "36.562787899999996",
            "lon-": "49.116226300000001",
            "city": "رودبار",
            "province": "کرمان"
        },
        {
            "lat": "35.826620599999998",
            "lon": "50.988713250000004",
            "lat+": "35.826852500000001",
            "lon+": "50.989826299999997",
            "lat-": "35.826388700000003",
            "lon-": "50.987600200000003",
            "city": "شهداد",
            "province": "کرمان"
        },
        {
            "lat": "31.871838473529898",
            "lon": "54.3079696888665",
            "lat+": "31.872158800000001",
            "lon+": "54.308346299999997",
            "lat-": "31.8715051",
            "lon-": "54.307574600000002",
            "city": "ریحان شهر",
            "province": "کرمان"
        },
        {
            "lat": "30.238324173740899",
            "lon": "54.989345967021301",
            "lat+": "31.070420500000001",
            "lon+": "55.834535199999998",
            "lat-": "29.449929000000001",
            "lon-": "54.340259400000001",
            "city": "شهربابک",
            "province": "کرمان"
        },
        {
            "lat": "32.675341373690799",
            "lon": "51.680579484539201",
            "lat+": "32.678580500000002",
            "lon+": "51.688218999999997",
            "lat-": "32.671710900000001",
            "lon-": "51.671237900000001",
            "city": "سرچشمه",
            "province": "کرمان"
        },
        {
            "lat": "29.576343107401598",
            "lon": "55.779267391929203",
            "lat+": "29.7414196",
            "lon+": "55.978227699999998",
            "lat-": "29.518790299999999",
            "lon-": "55.7334459",
            "city": "سیرجان",
            "province": "کرمان"
        },
        {
            "lat": "28.404973434320802",
            "lon": "58.144205887530703",
            "lat+": "28.759172100000001",
            "lon+": "58.638048499999996",
            "lat-": "28.130929900000002",
            "lon-": "57.757701699999998",
            "city": "عنبرآباد",
            "province": "کرمان"
        },
        {
            "lat": "29.096302964498101",
            "lon": "59.178671154865398",
            "lat+": "29.6067438",
            "lon+": "59.571876199999998",
            "lat-": "28.7272979",
            "lon-": "58.7153116",
            "city": "فهرج",
            "province": "کرمان"
        },
        {
            "lat": "31.8396991612458",
            "lon": "54.378770860653603",
            "lat+": "31.850039200000001",
            "lon+": "54.393053000000002",
            "lat-": "31.828292099999999",
            "lon-": "54.362153999999997",
            "city": "صفائیه",
            "province": "کرمان"
        },
        {
            "lat": "28.160982278608799",
            "lon": "57.250666880699399",
            "lat+": "28.485565000000001",
            "lon+": "57.708306100000001",
            "lat-": "27.897956400000002",
            "lon-": "56.960855100000003",
            "city": "فاریاب",
            "province": "کرمان"
        },
        {
            "lat": "35.634858445551899",
            "lon": "51.449581709247497",
            "lat+": "35.6457111",
            "lon+": "51.466239399999999",
            "lat-": "35.623258399999997",
            "lon-": "51.4342641",
            "city": "کیانشهر",
            "province": "کرمان"
        },
        {
            "lat": "27.8466964658774",
            "lon": "57.636365591866401",
            "lat+": "28.239198300000002",
            "lon+": "57.921392400000002",
            "lat-": "27.475163200000001",
            "lon-": "57.192674099999998",
            "city": "کهنوج",
            "province": "کرمان"
        },
        {
            "lat": "31.3822868168591",
            "lon": "56.282772849725497",
            "lat+": "31.7113406",
            "lon+": "56.582627899999999",
            "lat-": "31.007166600000001",
            "lon-": "55.758836100000003",
            "city": "کوهبنان",
            "province": "کرمان"
        },
        {
            "lat": "35.7502371918157",
            "lon": "51.468800045921697",
            "lat+": "35.759079999999997",
            "lon+": "51.478965100000003",
            "lat-": "35.7402716",
            "lon-": "51.4607776",
            "city": "کاظم آباد",
            "province": "کرمان"
        },
        {
            "lat": "27.1696340355412",
            "lon": "58.399100096913202",
            "lat+": "27.883708899999998",
            "lon+": "59.038499999999999",
            "lat-": "26.483251599999999",
            "lon-": "57.743138399999999",
            "city": "قلعه گنج",
            "province": "کرمان"
        },
        {
            "lat": "31.9343243759822",
            "lon": "54.323657799025298",
            "lat+": "31.939185299999998",
            "lon+": "54.327319600000003",
            "lat-": "31.933465600000002",
            "lon-": "54.3230334",
            "city": "گلباف",
            "province": "کرمان"
        },
        {
            "lat": "29.260180234623199",
            "lon": "58.754135652932298",
            "lat+": "29.607054900000001",
            "lon+": "59.087434299999998",
            "lat-": "28.845379300000001",
            "lon-": "58.406925100000002",
            "city": "نرماشیر",
            "province": "کرمان"
        },
        {
            "lat": "27.3254126631548",
            "lon": "57.671212436529203",
            "lat+": "27.8061443",
            "lon+": "58.132895099999999",
            "lat-": "26.9349159",
            "lon-": "57.223185899999997",
            "city": "منوجان",
            "province": "کرمان"
        },
        {
            "lat": "32.658268740807799",
            "lon": "51.697359083817098",
            "lat+": "32.663769100000003",
            "lon+": "51.702378600000003",
            "lat-": "32.652388500000001",
            "lon-": "51.693666800000003",
            "city": "گلزار",
            "province": "کرمان"
        },
        {
            "lat": "35.640197242952397",
            "lon": "51.3684805461235",
            "lat+": "35.6407369",
            "lon+": "51.3687775",
            "lat-": "35.639628500000001",
            "lon-": "51.368116499999999",
            "city": "ماهان",
            "province": "کرمان"
        },
        {
            "lat": "38.060698443878998",
            "lon": "46.276789482266203",
            "lat+": "38.064551299999998",
            "lon+": "46.277337600000003",
            "lat-": "38.059231400000002",
            "lon-": "46.275288600000003",
            "city": "لاله زار",
            "province": "کرمان"
        },
        {
            "lat": "35.633504090498803",
            "lon": "51.311647921747898",
            "lat+": "35.633867000000002",
            "lon+": "51.311983499999997",
            "lat-": "35.633138899999999",
            "lon-": "51.311345099999997",
            "city": "محی آباد",
            "province": "کرمان"
        },
        {
            "lat": "31.3516139438231",
            "lon": "48.737507900392799",
            "lat+": "31.356183999999999",
            "lon+": "48.743569800000003",
            "lat-": "31.347057",
            "lon-": "48.731708900000001",
            "city": "نظام شهر",
            "province": "کرمان"
        },
        {
            "lat": "29.332666246619901",
            "lon": "55.777389855827899",
            "lat+": "29.385613200000002",
            "lon+": "55.828425899999999",
            "lat-": "29.277700800000002",
            "lon-": "55.723999300000003",
            "city": "نجف شهر",
            "province": "کرمان"
        },
        {
            "lat": "35.0631679597954",
            "lon": "46.258111610364601",
            "lat+": "35.281867800000001",
            "lon+": "46.514560600000003",
            "lat-": "34.906801100000003",
            "lon-": "45.963077499999997",
            "city": "پاوه",
            "province": "کرمانشاه"
        },
        {
            "lat": "35.816240986813703",
            "lon": "51.602308452469799",
            "lat+": "35.819357500000002",
            "lon+": "51.602603899999998",
            "lat-": "35.815855599999999",
            "lon-": "51.601157399999998",
            "city": "نگار",
            "province": "کرمان"
        },
        {
            "lat": "34.852806587228599",
            "lon": "46.283283658022199",
            "lat+": "35.093793499999997",
            "lon+": "46.592277000000003",
            "lat-": "34.628823199999999",
            "lon-": "45.920391700000003",
            "city": "جوانرود",
            "province": "کرمانشاه"
        },
        {
            "lat": "32.698595203528299",
            "lon": "51.494925771043",
            "lat+": "32.699838499999998",
            "lon+": "51.496500699999999",
            "lat-": "32.695134600000003",
            "lon-": "51.490814299999997",
            "city": "یزدان شهر",
            "province": "کرمان"
        },
        {
            "lat": "33.753134699999997",
            "lon": "46.681912199999999",
            "lat+": "33.780180299999998",
            "lon+": "46.683248399999997",
            "lat-": "33.742818300000003",
            "lon-": "46.675197400000002",
            "city": "حمیل",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.297916224290198",
            "lon": "47.013661502571601",
            "lat+": "34.8070381",
            "lon+": "47.514422400000001",
            "lat-": "33.789394199999997",
            "lon-": "46.427017800000002",
            "city": "کرمانشاه",
            "province": "کرمانشاه"
        },
        {
            "lat": "35.636763000000002",
            "lon": "51.489845500000001",
            "lat+": "35.640704399999997",
            "lon+": "51.490343899999999",
            "lat-": "35.6350433",
            "lon-": "51.489623199999997",
            "city": "اسلام آبادغرب",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.540009875880699",
            "lon": "45.885861765595699",
            "lat+": "34.846110799999998",
            "lon+": "46.149093700000002",
            "lat-": "34.212492500000003",
            "lon-": "45.653637500000002",
            "city": "سرپل ذهاب",
            "province": "کرمانشاه"
        },
        {
            "lat": "35.731103593459999",
            "lon": "51.404843774592401",
            "lat+": "35.734303300000001",
            "lon+": "51.405214800000003",
            "lat-": "35.719912899999997",
            "lon-": "51.4047555",
            "city": "بیستون",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.739704394947097",
            "lon": "46.589685061366197",
            "lat+": "35.008607599999998",
            "lon+": "46.825545499999997",
            "lat-": "34.524613700000003",
            "lon-": "46.357477500000002",
            "city": "روانسر",
            "province": "کرمانشاه"
        },
        {
            "lat": "32.698405865401703",
            "lon": "51.533278131262101",
            "lat+": "32.698560499999999",
            "lon+": "51.5334772",
            "lat-": "32.6976777",
            "lon-": "51.531116500000003",
            "city": "سرمست",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.382638354015398",
            "lon": "47.119000842985002",
            "lat+": "34.3841331",
            "lon+": "47.123262400000002",
            "lat-": "34.380166299999999",
            "lon-": "47.112555",
            "city": "تازه آباد",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.862578206968401",
            "lon": "47.543425758374902",
            "lat+": "35.071651099999997",
            "lon+": "47.925535799999999",
            "lat-": "34.629637700000004",
            "lon-": "47.069733300000003",
            "city": "سنقر",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.5705225067681",
            "lon": "47.505780950796698",
            "lat+": "34.801649400000002",
            "lon+": "47.854919600000002",
            "lat-": "34.329641700000003",
            "lon-": "47.114216599999999",
            "city": "صحنه",
            "province": "کرمانشاه"
        },
        {
            "lat": "35.496103483906502",
            "lon": "51.0523681639446",
            "lat+": "35.565002999999997",
            "lon+": "51.2104936",
            "lat-": "35.4101924",
            "lon-": "50.896840300000001",
            "city": "رباط",
            "province": "کرمانشاه"
        },
        {
            "lat": "33.597972337197596",
            "lon": "45.961488723109802",
            "lat+": "33.755835599999997",
            "lon+": "46.021251499999998",
            "lat-": "33.547148200000002",
            "lon-": "45.868826499999997",
            "city": "سومار",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.071398374980703",
            "lon": "45.978162282768103",
            "lat+": "34.420049599999999",
            "lon+": "46.669216499999997",
            "lat-": "33.685353300000003",
            "lon-": "45.603754199999997",
            "city": "گیلانغرب",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.477169560784397",
            "lon": "47.916085393931702",
            "lat+": "34.647388800000002",
            "lon+": "48.1046111",
            "lat-": "34.252447799999999",
            "lon-": "47.7110293",
            "city": "کنگاور",
            "province": "کرمانشاه"
        },
        {
            "lat": "35.104144442496498",
            "lon": "46.299602127797698",
            "lat+": "35.113447999999998",
            "lon+": "46.3553918",
            "lat-": "35.043423500000003",
            "lon-": "46.2781102",
            "city": "نودشه",
            "province": "کرمانشاه"
        },
        {
            "lat": "35.3182471317497",
            "lon": "47.026092214443999",
            "lat+": "35.318976399999997",
            "lon+": "47.030659800000002",
            "lat-": "35.312510400000001",
            "lon-": "47.025376000000001",
            "city": "شاهو",
            "province": "کرمانشاه"
        },
        {
            "lat": "32.548138546669499",
            "lon": "51.674062015873602",
            "lat+": "32.548497500000003",
            "lon+": "51.674993499999999",
            "lat-": "32.547981499999999",
            "lon-": "51.673658799999998",
            "city": "نوسود",
            "province": "کرمانشاه"
        },
        {
            "lat": "34.3473141692293",
            "lon": "47.455634257154003",
            "lat+": "34.578684199999998",
            "lon+": "47.699652",
            "lat-": "34.103624000000003",
            "lon-": "47.243482200000003",
            "city": "هرسین",
            "province": "کرمانشاه"
        },
        {
            "lat": "29.9410946445369",
            "lon": "52.214500899069201",
            "lat+": "30.020189999999999",
            "lon+": "52.396287399999999",
            "lat-": "29.8208494",
            "lon-": "52.143397899999997",
            "city": "یاسوج",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "30.460740910266399",
            "lon": "51.069474148622398",
            "lat+": "30.6839209",
            "lon+": "51.299427999999999",
            "lat-": "30.2114026",
            "lon-": "50.802785399999998",
            "city": "باشت",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "36.643103746274001",
            "lon": "53.292457663421303",
            "lat+": "36.643352299999997",
            "lon+": "53.295015900000003",
            "lat-": "36.640332800000003",
            "lon-": "53.292178100000001",
            "city": "دوگنبدان",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "30.772448307715599",
            "lon": "50.872866051038002",
            "lat+": "31.020283800000001",
            "lon+": "51.207640499999997",
            "lat-": "30.5900894",
            "lon-": "50.607842900000001",
            "city": "چرام",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "32.660763921900397",
            "lon": "51.668083555534601",
            "lat+": "32.660798999999997",
            "lon+": "51.668902899999999",
            "lat-": "32.660674700000001",
            "lon-": "51.667761400000003",
            "city": "دهدشت",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "32.658445436257701",
            "lon": "51.653039505558098",
            "lat+": "32.658627600000003",
            "lon+": "51.653262400000003",
            "lat-": "32.658265900000004",
            "lon-": "51.652826099999999",
            "city": "سوق",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "30.9880098166769",
            "lon": "50.355385033077702",
            "lat+": "31.128493299999999",
            "lon+": "50.538139200000003",
            "lat-": "30.830778899999999",
            "lon-": "50.164101799999997",
            "city": "لنده",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "36.851046264723998",
            "lon": "53.627477709027303",
            "lat+": "36.8575491",
            "lon+": "53.6487537",
            "lat-": "36.843473199999998",
            "lon-": "53.6046221",
            "city": "میان راهان",
            "province": "کرمانشاه"
        },
        {
            "lat": "37.203134366716199",
            "lon": "54.709168840919702",
            "lat+": "37.222925500000002",
            "lon+": "55.116282499999997",
            "lat-": "37.1161843",
            "lon-": "54.483234600000003",
            "city": "انبارآلوم",
            "province": "گلستان"
        },
        {
            "lat": "31.910871012348299",
            "lon": "54.3266107096781",
            "lat+": "31.916110700000001",
            "lon+": "54.327229000000003",
            "lat-": "31.9100359",
            "lon-": "54.3225634",
            "city": "سی سخت",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "36.690770626666101",
            "lon": "49.306248148221599",
            "lat+": "36.712405699999998",
            "lon+": "49.421557499999999",
            "lat-": "36.668348799999997",
            "lon-": "49.251732500000003",
            "city": "گراب سفلی",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "35.704055028149597",
            "lon": "51.113207935451904",
            "lat+": "35.7425067",
            "lon+": "51.197470299999999",
            "lat-": "35.662363300000003",
            "lon-": "51.020417600000002",
            "city": "قلعه رئیسی",
            "province": "کهکیلویه و بویراحمد"
        },
        {
            "lat": "36.921675436481998",
            "lon": "54.159151570682802",
            "lat+": "36.980810900000002",
            "lon+": "54.366364500000003",
            "lat-": "36.820401199999999",
            "lon-": "53.990532700000003",
            "city": "ترکمن",
            "province": "گلستان"
        },
        {
            "lat": "37.508212045681397",
            "lon": "54.845005014041597",
            "lat+": "37.559839599999997",
            "lon+": "54.897621100000002",
            "lat-": "37.456269200000001",
            "lon-": "54.7296561",
            "city": "اینچه برون",
            "province": "گلستان"
        },
        {
            "lat": "35.751156",
            "lon": "51.548164",
            "lat+": "35.751156",
            "lon+": "51.548164",
            "lat-": "35.751156",
            "lon-": "51.548164",
            "city": "جلین",
            "province": "گلستان"
        },
        {
            "lat": "36.7510061904824",
            "lon": "54.505414954301898",
            "lat+": "36.971757699999998",
            "lon+": "54.744922299999999",
            "lat-": "36.512805499999999",
            "lon-": "54.217473200000001",
            "city": "گرگان",
            "province": "گلستان"
        },
        {
            "lat": "36.988663137956799",
            "lon": "55.338714927770297",
            "lat+": "37.189686299999998",
            "lon+": "55.5997512",
            "lat-": "36.798657900000002",
            "lon-": "55.055320600000002",
            "city": "آزادشهر",
            "province": "گلستان"
        },
        {
            "lat": "36.955554289970998",
            "lon": "55.098331265853702",
            "lat+": "37.144430700000001",
            "lon+": "55.271421699999998",
            "lat-": "36.785429899999997",
            "lon-": "54.904702200000003",
            "city": "رامیان",
            "province": "گلستان"
        },
        {
            "lat": "36.890491",
            "lon": "54.568768",
            "lat+": "36.890491",
            "lon+": "54.568768",
            "lat-": "36.890491",
            "lon-": "54.568768",
            "city": "سرخنکلاته",
            "province": "گلستان"
        },
        {
            "lat": "37.163148924456102",
            "lon": "54.527407318548498",
            "lat+": "37.453629300000003",
            "lon+": "54.857736299999999",
            "lat-": "36.911400800000003",
            "lon-": "54.218188900000001",
            "city": "آق قلا",
            "province": "گلستان"
        },
        {
            "lat": "35.785019",
            "lon": "51.467529",
            "lat+": "35.785019",
            "lon+": "51.467529",
            "lat-": "35.785019",
            "lon-": "51.467529",
            "city": "دلند",
            "province": "گلستان"
        },
        {
            "lat": "37.014187",
            "lon": "54.229580",
            "lat+": "37.014187",
            "lon+": "54.229580",
            "lat-": "37.014187",
            "lon-": "54.229580",
            "city": "سیمین شهر",
            "province": "گلستان"
        },
        {
            "lat": "37.010899",
            "lon": "54.987572",
            "lat+": "37.010899",
            "lon+": "54.987572",
            "lat-": "37.010899",
            "lon-": "54.987572",
            "city": "خان ببین",
            "province": "گلستان"
        },
        {
            "lat": "36.898552",
            "lon": "54.748466",
            "lat+": "36.898552",
            "lon+": "54.748466",
            "lat-": "36.898552",
            "lon-": "54.748466",
            "city": "فاضل آباد",
            "province": "گلستان"
        },
        {
            "lat": "36.761889502802397",
            "lon": "53.932869272451597",
            "lat+": "36.7645561",
            "lon+": "53.936110599999999",
            "lat-": "36.751154800000002",
            "lon-": "53.919590200000002",
            "city": "بندر گز",
            "province": "گلستان"
        },
        {
            "lat": "36.6817000023172",
            "lon": "54.197997783606702",
            "lat+": "36.879503900000003",
            "lon+": "54.373156700000003",
            "lat-": "36.495617000000003",
            "lon-": "54.012172",
            "city": "کردکوی",
            "province": "گلستان"
        },
        {
            "lat": "37.070499",
            "lon": "54.075550",
            "lat+": "37.070499",
            "lon+": "54.075550",
            "lat-": "37.070499",
            "lon-": "54.075550",
            "city": "گمیش تپه",
            "province": "گلستان"
        },
        {
            "lat": "37.853749182291402",
            "lon": "55.917635367410703",
            "lat+": "38.124448600000001",
            "lon+": "56.313564100000001",
            "lat-": "37.502433400000001",
            "lon-": "55.543036200000003",
            "city": "مراوه تپه",
            "province": "گلستان"
        },
        {
            "lat": "37.139027",
            "lon": "55.165062",
            "lat+": "37.139027",
            "lon+": "55.165062",
            "lat-": "37.139027",
            "lon-": "55.165062",
            "city": "نگین شهر",
            "province": "گلستان"
        },
        {
            "lat": "37.562120802923801",
            "lon": "55.103035970077102",
            "lat+": "38.107040300000001",
            "lon+": "55.683181599999998",
            "lat-": "37.062661800000001",
            "lon-": "54.547344500000001",
            "city": "گنبد کاووس",
            "province": "گلستان"
        },
        {
            "lat": "36.738834",
            "lon": "53.911827",
            "lat+": "36.738834",
            "lon+": "53.911827",
            "lat-": "36.738834",
            "lon-": "53.911827",
            "city": "نوکنده",
            "province": "گلستان"
        },
        {
            "lat": "37.075359",
            "lon": "55.263779",
            "lat+": "37.075359",
            "lon+": "55.263779",
            "lat-": "37.075359",
            "lon-": "55.263779",
            "city": "نوده خاندوز",
            "province": "گلستان"
        },
        {
            "lat": "37.272569443150203",
            "lon": "49.682052025426103",
            "lat+": "37.457074400000003",
            "lon+": "49.9145386",
            "lat-": "37.0257115",
            "lon-": "49.474693500000001",
            "city": "رشت",
            "province": "گیلان"
        },
        {
            "lat": "37.324040723095898",
            "lon": "55.672765699921001",
            "lat+": "37.461758500000002",
            "lon+": "56.012494500000003",
            "lat-": "37.183078399999999",
            "lon-": "55.334367499999999",
            "city": "گالیکش",
            "province": "گلستان"
        },
        {
            "lat": "37.133053",
            "lon": "49.367573",
            "lat+": "37.133053",
            "lon+": "49.367573",
            "lat-": "37.133053",
            "lon-": "49.367573",
            "city": "احمدسرگوراب",
            "province": "گیلان"
        },
        {
            "lat": "37.286913264479203",
            "lon": "49.5653327504833",
            "lat+": "37.288274899999998",
            "lon+": "49.5745182",
            "lat-": "37.285184800000003",
            "lon-": "49.556729799999999",
            "city": "علی آباد",
            "province": "گلستان"
        },
        {
            "lat": "37.135544382734899",
            "lon": "55.4614225721118",
            "lat+": "37.275233900000003",
            "lon+": "55.712136000000001",
            "lat-": "37.0104981",
            "lon-": "55.230409000000002",
            "city": "مینودشت",
            "province": "گلستان"
        },
        {
            "lat": "36.963525984721102",
            "lon": "50.137627130238201",
            "lat+": "37.128182000000002",
            "lon+": "50.276690000000002",
            "lat-": "36.785650799999999",
            "lon-": "50.015126799999997",
            "city": "املش",
            "province": "گیلان"
        },
        {
            "lat": "37.734623",
            "lon": "48.949940",
            "lat+": "37.734623",
            "lon+": "48.949940",
            "lat-": "37.734623",
            "lon-": "48.949940",
            "city": "اسالم",
            "province": "گیلان"
        },
        {
            "lat": "37.555023129127697",
            "lon": "55.577328877450498",
            "lat+": "37.813100200000001",
            "lon+": "56.050275599999999",
            "lat-": "37.322684600000002",
            "lon-": "55.293808599999998",
            "city": "کلاله",
            "province": "گلستان"
        },
        {
            "lat": "38.351623377591302",
            "lon": "48.742389465644699",
            "lat+": "38.453352199999998",
            "lon+": "48.881436899999997",
            "lat-": "38.239992000000001",
            "lon-": "48.569752999999999",
            "city": "آستارا",
            "province": "گیلان"
        },
        {
            "lat": "37.3300557215005",
            "lon": "49.986000080754799",
            "lat+": "37.467646600000002",
            "lon+": "50.186060699999999",
            "lat-": "37.197256400000001",
            "lon-": "49.772830800000001",
            "city": "آستانه اشرفیه",
            "province": "گیلان"
        },
        {
            "lat": "37.112164",
            "lon": "50.115421",
            "lat+": "37.112164",
            "lon+": "50.115421",
            "lat-": "37.112164",
            "lon-": "50.115421",
            "city": "اطاقور",
            "province": "گیلان"
        },
        {
            "lat": "37.461486909208702",
            "lon": "49.410916984000899",
            "lat+": "37.570780800000001",
            "lon+": "49.680904900000002",
            "lat-": "37.387150300000002",
            "lon-": "49.195661000000001",
            "city": "بندر انزلی",
            "province": "گیلان"
        },
        {
            "lat": "37.602901",
            "lon": "49.066414",
            "lat+": "37.602901",
            "lon+": "49.066414",
            "lat-": "37.602901",
            "lon-": "49.066414",
            "city": "پره سر",
            "province": "گیلان"
        },
        {
            "lat": "36.776791",
            "lon": "49.752834",
            "lat+": "36.776791",
            "lon+": "49.752834",
            "lat-": "36.776791",
            "lon-": "49.752834",
            "city": "بره سر",
            "province": "گیلان"
        },
        {
            "lat": "36.703568",
            "lon": "49.792114",
            "lat+": "36.703568",
            "lon+": "49.792114",
            "lat-": "36.703568",
            "lon-": "49.792114",
            "city": "جیرنده",
            "province": "گیلان"
        },
        {
            "lat": "36.819500",
            "lon": "50.876301",
            "lat+": "36.819500",
            "lon+": "50.876301",
            "lat-": "36.819500",
            "lon-": "50.876301",
            "city": "تونکابن",
            "province": "گیلان"
        },
        {
            "lat": "37.157349",
            "lon": "50.278996",
            "lat+": "37.157349",
            "lon+": "50.278996",
            "lat-": "37.157349",
            "lon-": "50.278996",
            "city": "چاف وچمخاله",
            "province": "گیلان"
        },
        {
            "lat": "36.977505",
            "lon": "50.552940",
            "lat+": "36.977505",
            "lon+": "50.552940",
            "lat-": "36.977505",
            "lon-": "50.552940",
            "city": "چابکسر",
            "province": "گیلان"
        },
        {
            "lat": "38.149868",
            "lon": "48.892513",
            "lat+": "38.149868",
            "lon+": "48.892513",
            "lat-": "38.149868",
            "lon-": "48.892513",
            "city": "حویق",
            "province": "گیلان"
        },
        {
            "lat": "37.405560",
            "lon": "49.119831",
            "lat+": "37.405560",
            "lon+": "49.119831",
            "lat-": "37.405560",
            "lon-": "49.119831",
            "city": "بازارجمعه",
            "province": "گیلان"
        },
        {
            "lat": "37.386600",
            "lon": "49.668102",
            "lat+": "37.386600",
            "lon+": "49.668102",
            "lat-": "37.386600",
            "lon-": "49.668102",
            "city": "خشکبیجار",
            "province": "گیلان"
        },
        {
            "lat": "37.050926",
            "lon": "50.236252",
            "lat+": "37.050926",
            "lon+": "50.236252",
            "lat-": "37.050926",
            "lon-": "50.236252",
            "city": "رانکوه",
            "province": "گیلان"
        },
        {
            "lat": "37.256294",
            "lon": "50.007107",
            "lat+": "37.256294",
            "lon+": "50.007107",
            "lat-": "37.256294",
            "lon-": "50.007107",
            "city": "رودبنه",
            "province": "گیلان"
        },
        {
            "lat": "36.878251105273101",
            "lon": "50.318761704041201",
            "lat+": "37.209022500000003",
            "lon+": "50.603814499999999",
            "lat-": "36.632282199999999",
            "lon-": "50.086397499999997",
            "city": "رودسر",
            "province": "گیلان"
        },
        {
            "lat": "37.387722",
            "lon": "49.654930",
            "lat+": "37.387722",
            "lon+": "49.654930",
            "lat-": "37.387722",
            "lon-": "49.654930",
            "city": "خمام",
            "province": "گیلان"
        },
        {
            "lat": "35.820496",
            "lon": "51.435226",
            "lat+": "35.820496",
            "lon+": "51.435226",
            "lat-": "35.820496",
            "lon-": "51.435226",
            "city": "چوبر",
            "province": "گیلان"
        },
        {
            "lat": "35.714672",
            "lon": "51.470562",
            "lat+": "35.714672",
            "lon+": "51.470562",
            "lat-": "35.714672",
            "lon-": "51.470562",
            "city": "سنگر",
            "province": "گیلان"
        },
        {
            "lat": "35.795954309504701",
            "lon": "51.4716299151697",
            "lat+": "35.801360199999998",
            "lon+": "51.485576600000002",
            "lat-": "35.790203300000002",
            "lon-": "51.459931699999999",
            "city": "رستم آباد",
            "province": "گیلان"
        },
        {
            "lat": "35.603320650186298",
            "lon": "51.432577684013502",
            "lat+": "35.607874899999999",
            "lon+": "51.439045100000001",
            "lat-": "35.597893499999998",
            "lon-": "51.425281099999999",
            "city": "دیلمان",
            "province": "گیلان"
        },
        {
            "lat": "35.290791",
            "lon": "46.999699",
            "lat+": "35.290791",
            "lon+": "46.999699",
            "lat-": "35.290791",
            "lon-": "46.999699",
            "city": "شلمان",
            "province": "گیلان"
        },
        {
            "lat": "32.719502650649602",
            "lon": "51.675725954587598",
            "lat+": "32.724362900000003",
            "lon+": "51.678785900000001",
            "lat-": "32.712050599999998",
            "lon-": "51.670095600000003",
            "city": "رحیم آباد",
            "province": "گیلان"
        },
        {
            "lat": "37.179258594550902",
            "lon": "49.134484884003797",
            "lat+": "37.344705400000002",
            "lon+": "49.424881300000003",
            "lat-": "36.998081300000003",
            "lon-": "48.869852199999997",
            "city": "فومن",
            "province": "گیلان"
        },
        {
            "lat": "37.074883",
            "lon": "50.396954",
            "lat+": "37.074883",
            "lon+": "50.396954",
            "lat-": "37.074883",
            "lon-": "50.396954",
            "city": "کلاچای",
            "province": "گیلان"
        },
        {
            "lat": "37.279072",
            "lon": "49.769432",
            "lat+": "37.279072",
            "lon+": "49.769432",
            "lat-": "37.279072",
            "lon-": "49.769432",
            "city": "کوچصفهان",
            "province": "گیلان"
        },
        {
            "lat": "37.421761",
            "lon": "49.932884",
            "lat+": "37.421761",
            "lon+": "49.932884",
            "lat-": "37.421761",
            "lon-": "49.932884",
            "city": "کیاشهر",
            "province": "گیلان"
        },
        {
            "lat": "37.359669",
            "lon": "49.861176",
            "lat+": "37.359669",
            "lon+": "49.861176",
            "lat-": "37.359669",
            "lon-": "49.861176",
            "city": "لشت نشاء",
            "province": "گیلان"
        },
        {
            "lat": "37.086766452457802",
            "lon": "49.374199645450297",
            "lat+": "37.308574999999998",
            "lon+": "49.5398493",
            "lat-": "36.962116299999998",
            "lon-": "49.0976602",
            "city": "شفت",
            "province": "گیلان"
        },
        {
            "lat": "37.120764226171502",
            "lon": "50.108928317161201",
            "lat+": "37.296217400000003",
            "lon+": "50.276541399999999",
            "lat-": "36.957376199999999",
            "lon-": "49.935589800000002",
            "city": "لنگرود",
            "province": "گیلان"
        },
        {
            "lat": "37.220033768864397",
            "lon": "50.036120777636498",
            "lat+": "37.390491699999998",
            "lon+": "50.228177100000003",
            "lat-": "37.0868994",
            "lon-": "49.773422199999999",
            "city": "لاهیجان",
            "province": "گیلان"
        },
        {
            "lat": "37.304077",
            "lon": "49.217831",
            "lat+": "37.304077",
            "lon+": "49.217831",
            "lat-": "37.304077",
            "lon-": "49.217831",
            "city": "گوراب زرمیخ",
            "province": "گیلان"
        },
        {
            "lat": "36.631454",
            "lon": "49.514496",
            "lat+": "36.631454",
            "lon+": "49.514496",
            "lat-": "36.631454",
            "lon-": "49.514496",
            "city": "لوشان",
            "province": "گیلان"
        },
        {
            "lat": "37.150688",
            "lon": "50.179974",
            "lat+": "37.150688",
            "lon+": "50.179974",
            "lat-": "37.150688",
            "lon-": "50.179974",
            "city": "کومله",
            "province": "گیلان"
        },
        {
            "lat": "36.943135492463",
            "lon": "49.900384158455402",
            "lat+": "37.191842399999999",
            "lon+": "50.1299481",
            "lat-": "36.686082300000002",
            "lon-": "49.709085600000002",
            "city": "سیاهکل",
            "province": "گیلان"
        },
        {
            "lat": "37.951294",
            "lon": "48.913368",
            "lat+": "37.951294",
            "lon+": "48.913368",
            "lat-": "37.951294",
            "lon-": "48.913368",
            "city": "لیسار",
            "province": "گیلان"
        },
        {
            "lat": "38.309280",
            "lon": "48.866001",
            "lat+": "38.309280",
            "lon+": "48.866001",
            "lat-": "38.309280",
            "lon-": "48.866001",
            "city": "لوندویل",
            "province": "گیلان"
        },
        {
            "lat": "37.155052",
            "lon": "48.989758",
            "lat+": "37.155052",
            "lon+": "48.989758",
            "lat-": "37.155052",
            "lon-": "48.989758",
            "city": "ماسوله",
            "province": "گیلان"
        },
        {
            "lat": "37.279716",
            "lon": "49.380527",
            "lat+": "37.279716",
            "lon+": "49.380527",
            "lat-": "37.279716",
            "lon-": "49.380527",
            "city": "مرجقل",
            "province": "گیلان"
        },
        {
            "lat": "35.543649900515298",
            "lon": "51.060308117374902",
            "lat+": "35.547687400000001",
            "lon+": "51.065311399999999",
            "lat-": "35.539424799999999",
            "lon-": "51.054936599999998",
            "city": "منجیل",
            "province": "گیلان"
        },
        {
            "lat": "37.796333",
            "lon": "48.907986",
            "lat+": "37.796333",
            "lon+": "48.907986",
            "lat-": "37.796333",
            "lon-": "48.907986",
            "city": "هشتپر",
            "province": "گیلان"
        },
        {
            "lat": "37.045204",
            "lon": "50.411091",
            "lat+": "37.045204",
            "lon+": "50.411091",
            "lat-": "37.045204",
            "lon-": "50.411091",
            "city": "واجارگاه",
            "province": "گیلان"
        },
        {
            "lat": "37.353136432695699",
            "lon": "49.296703303239603",
            "lat+": "37.498677800000003",
            "lon+": "49.549983699999999",
            "lat-": "37.251230499999998",
            "lon-": "49.040166499999998",
            "city": "صومعه سرا",
            "province": "گیلان"
        },
        {
            "lat": "37.3993870967521",
            "lon": "49.028091421330501",
            "lat+": "37.5774562",
            "lon+": "49.216413500000002",
            "lat-": "37.309683800000002",
            "lon-": "48.799384000000003",
            "city": "ماسال",
            "province": "گیلان"
        },
        {
            "lat": "37.259579",
            "lon": "49.827061",
            "lat+": "37.259579",
            "lon+": "49.827061",
            "lat-": "37.259579",
            "lon-": "49.827061",
            "city": "لولمان",
            "province": "گیلان"
        },
        {
            "lat": "33.384778548506603",
            "lon": "48.570693352891197",
            "lat+": "33.894415000000002",
            "lon+": "49.000734899999998",
            "lat-": "32.890200100000001",
            "lon-": "48.0486589",
            "city": "خرم آباد",
            "province": "لرستان"
        },
        {
            "lat": "33.1220986559509",
            "lon": "49.416101245998803",
            "lat+": "33.565483",
            "lon+": "50.019260299999999",
            "lat-": "32.724060399999999",
            "lon-": "48.828549299999999",
            "city": "الیگودرز",
            "province": "لرستان"
        },
        {
            "lat": "33.865051",
            "lon": "48.262753",
            "lat+": "33.865051",
            "lon+": "48.262753",
            "lat-": "33.865051",
            "lon-": "48.262753",
            "city": "الشتر",
            "province": "لرستان"
        },
        {
            "lat": "33.648647",
            "lon": "48.561142",
            "lat+": "33.648647",
            "lon+": "48.561142",
            "lat-": "33.648647",
            "lon-": "48.561142",
            "city": "چغلوندی",
            "province": "لرستان"
        },
        {
            "lat": "33.889816859292303",
            "lon": "48.756186084255603",
            "lat+": "34.123515400000002",
            "lon+": "49.077173100000003",
            "lat-": "33.603362599999997",
            "lon-": "48.465931300000001",
            "city": "بروجرد",
            "province": "لرستان"
        },
        {
            "lat": "34.015678",
            "lon": "48.641941",
            "lat+": "34.015678",
            "lon+": "48.641941",
            "lat-": "34.015678",
            "lon-": "48.641941",
            "city": "اشترینان",
            "province": "لرستان"
        },
        {
            "lat": "33.282188",
            "lon": "47.507523",
            "lat+": "33.282188",
            "lon+": "47.507523",
            "lat-": "33.282188",
            "lon-": "47.507523",
            "city": "چقابل",
            "province": "لرستان"
        },
        {
            "lat": "33.500845886997098",
            "lon": "49.443276616366298",
            "lat+": "33.742377500000003",
            "lon+": "49.716387300000001",
            "lat-": "33.222714000000003",
            "lon-": "49.225116700000001",
            "city": "ازنا",
            "province": "لرستان"
        },
        {
            "lat": "33.126447620754597",
            "lon": "47.975576521345701",
            "lat+": "33.465425000000003",
            "lon+": "48.412545000000001",
            "lat-": "32.651518099999997",
            "lon-": "47.471276199999998",
            "city": "پلدختر",
            "province": "لرستان"
        },
        {
            "lat": "33.492184",
            "lon": "48.688732",
            "lat+": "33.492184",
            "lon+": "48.688732",
            "lat-": "33.492184",
            "lon-": "48.688732",
            "city": "زاغه",
            "province": "لرستان"
        },
        {
            "lat": "33.520120614856801",
            "lon": "49.071813987824399",
            "lat+": "33.743562099999998",
            "lon+": "49.326173400000002",
            "lat-": "33.277884200000003",
            "lon-": "48.785317599999999",
            "city": "دورود",
            "province": "لرستان"
        },
        {
            "lat": "35.711605",
            "lon": "51.373760",
            "lat+": "35.711605",
            "lon+": "51.373760",
            "lat-": "35.711605",
            "lon-": "51.373760",
            "city": "درب گنبد",
            "province": "لرستان"
        },
        {
            "lat": "33.665894",
            "lon": "48.906517",
            "lat+": "33.665894",
            "lon+": "48.906517",
            "lat-": "33.665894",
            "lon-": "48.906517",
            "city": "چالانچولان",
            "province": "لرستان"
        },
        {
            "lat": "33.402039",
            "lon": "47.323853",
            "lat+": "33.402039",
            "lon+": "47.323853",
            "lat-": "33.402039",
            "lon-": "47.323853",
            "city": "کونانی",
            "province": "لرستان"
        },
        {
            "lat": "33.218487",
            "lon": "48.884140",
            "lat+": "33.218487",
            "lon+": "48.884140",
            "lat-": "33.218487",
            "lon-": "48.884140",
            "city": "سپیددشت",
            "province": "لرستان"
        },
        {
            "lat": "33.188641",
            "lon": "49.187637",
            "lat+": "33.188641",
            "lon+": "49.187637",
            "lat-": "33.188641",
            "lon-": "49.187637",
            "city": "شول آباد",
            "province": "لرستان"
        },
        {
            "lat": "33.474236",
            "lon": "47.236397",
            "lat+": "33.474236",
            "lon+": "47.236397",
            "lat-": "33.474236",
            "lon-": "47.236397",
            "city": "گراب",
            "province": "لرستان"
        },
        {
            "lat": "33.377865",
            "lon": "47.961750",
            "lat+": "33.377865",
            "lon+": "47.961750",
            "lat-": "33.377865",
            "lon-": "47.961750",
            "city": "معمولان",
            "province": "لرستان"
        },
        {
            "lat": "33.588943",
            "lon": "49.519741",
            "lat+": "33.588943",
            "lon+": "49.519741",
            "lat-": "33.588943",
            "lon-": "49.519741",
            "city": "مؤمن آباد",
            "province": "لرستان"
        },
        {
            "lat": "36.926571",
            "lon": "45.380089",
            "lat+": "36.926571",
            "lon+": "45.380089",
            "lat-": "36.926571",
            "lon-": "45.380089",
            "city": "هفت چشمه",
            "province": "لرستان"
        },
        {
            "lat": "33.486874",
            "lon": "48.030537",
            "lat+": "33.486874",
            "lon+": "48.030537",
            "lat-": "33.486874",
            "lon-": "48.030537",
            "city": "ویسیان",
            "province": "لرستان"
        },
        {
            "lat": "36.592510",
            "lon": "52.668846",
            "lat+": "36.592510",
            "lon+": "52.668846",
            "lat-": "36.592510",
            "lon-": "52.668846",
            "city": "امیرکلا",
            "province": "مازندران"
        },
        {
            "lat": "36.322725417462699",
            "lon": "53.357268581317399",
            "lat+": "36.8240579",
            "lon+": "53.951687",
            "lat-": "35.960875999999999",
            "lon-": "52.926371199999998",
            "city": "ساری",
            "province": "مازندران"
        },
        {
            "lat": "36.600006",
            "lon": "52.141945",
            "lat+": "36.600006",
            "lon+": "52.141945",
            "lat-": "36.600006",
            "lon-": "52.141945",
            "city": "ایزدشهر",
            "province": "مازندران"
        },
        {
            "lat": "35.664017",
            "lon": "51.324074",
            "lat+": "35.664017",
            "lon+": "51.324074",
            "lat-": "35.664017",
            "lon-": "51.324074",
            "city": "آلاشت",
            "province": "مازندران"
        },
        {
            "lat": "36.113032848662499",
            "lon": "52.244969013926003",
            "lat+": "36.626707400000001",
            "lon+": "52.5314142",
            "lat-": "35.763757499999997",
            "lon-": "51.732559299999998",
            "city": "آمل",
            "province": "مازندران"
        },
        {
            "lat": "36.667313538083",
            "lon": "52.700790864547898",
            "lat+": "36.743519999999997",
            "lon+": "52.845316500000003",
            "lat-": "36.5934016",
            "lon-": "52.552154399999999",
            "city": "بابلسر",
            "province": "مازندران"
        },
        {
            "lat": "36.302073690759102",
            "lon": "52.623489133774697",
            "lat+": "36.617009500000002",
            "lon+": "52.798914799999999",
            "lat-": "35.930948600000001",
            "lon-": "52.469889299999998",
            "city": "بابل",
            "province": "مازندران"
        },
        {
            "lat": "34.043186619485098",
            "lon": "58.220273719092702",
            "lat+": "34.049083199999998",
            "lon+": "58.227987400000004",
            "lat-": "34.0419853",
            "lon-": "58.2188698",
            "city": "بلده",
            "province": "مازندران"
        },
        {
            "lat": "36.654698569189399",
            "lon": "52.7726078931071",
            "lat+": "36.663251199999998",
            "lon+": "52.774989400000003",
            "lat-": "36.651936900000003",
            "lon-": "52.765355200000002",
            "city": "بهنمیر",
            "province": "مازندران"
        },
        {
            "lat": "36.670716689834101",
            "lon": "53.688620606002701",
            "lat+": "36.943568200000001",
            "lon+": "54.132152099999999",
            "lat-": "36.451466199999999",
            "lon-": "53.261431899999998",
            "city": "بهشهر",
            "province": "مازندران"
        },
        {
            "lat": "33.5442259418802",
            "lon": "47.390153463891302",
            "lat+": "33.876797699999997",
            "lon+": "47.8555742",
            "lat-": "33.301982000000002",
            "lon-": "46.8384924",
            "city": "کوهدشت",
            "province": "لرستان"
        },
        {
            "lat": "36.601908192812303",
            "lon": "50.832944799909598",
            "lat+": "36.8702872",
            "lon+": "51.128914299999998",
            "lat-": "36.2660032",
            "lon-": "50.512060499999997",
            "city": "تنکابن",
            "province": "مازندران"
        },
        {
            "lat": "36.4919557026357",
            "lon": "52.189426940741697",
            "lat+": "36.492026799999998",
            "lon+": "52.225110999999998",
            "lat-": "36.4774028",
            "lon-": "52.181154499999998",
            "city": "چمستان",
            "province": "مازندران"
        },
        {
            "lat": "36.741115950000001",
            "lon": "45.719285800000002",
            "lat+": "36.741133300000001",
            "lon+": "45.719797800000002",
            "lat-": "36.741098600000001",
            "lon-": "45.718773800000001",
            "city": "پول",
            "province": "مازندران"
        },
        {
            "lat": "31.323464103316098",
            "lon": "48.677526975797697",
            "lat+": "31.324882599999999",
            "lon+": "48.679067600000003",
            "lat-": "31.3230942",
            "lon-": "48.6719376",
            "city": "پل سفید",
            "province": "مازندران"
        },
        {
            "lat": "36.778313295820503",
            "lon": "50.554182054357597",
            "lat+": "36.961835600000001",
            "lon+": "50.779516999999998",
            "lat-": "36.575437700000002",
            "lon-": "50.351557499999998",
            "city": "رامسر",
            "province": "مازندران"
        },
        {
            "lat": "32.677180148097001",
            "lon": "51.7791496612777",
            "lat+": "32.679448899999997",
            "lon+": "51.782361700000003",
            "lat-": "32.666691",
            "lon-": "51.764522800000002",
            "city": "رویان",
            "province": "مازندران"
        },
        {
            "lat": "35.871729683643203",
            "lon": "52.081279676971597",
            "lat+": "35.883850299999999",
            "lon+": "52.161786200000002",
            "lat-": "35.850421900000001",
            "lon-": "52.069630600000004",
            "city": "رینه",
            "province": "مازندران"
        },
        {
            "lat": "36.4027680889929",
            "lon": "51.258192179322897",
            "lat+": "36.696910000000003",
            "lon+": "51.481856999999998",
            "lat-": "36.153262599999998",
            "lon-": "50.999178800000003",
            "city": "چالوس",
            "province": "مازندران"
        },
        {
            "lat": "36.572624151402401",
            "lon": "52.963756076383099",
            "lat+": "36.5929845",
            "lon+": "53.033361900000003",
            "lat-": "36.562805400000002",
            "lon-": "52.946143200000002",
            "city": "جویبار",
            "province": "مازندران"
        },
        {
            "lat": "35.640217223216801",
            "lon": "51.336217986671699",
            "lat+": "35.642058900000002",
            "lon+": "51.341138000000001",
            "lat-": "35.639940899999999",
            "lon-": "51.335467899999998",
            "city": "خوش رودپی",
            "province": "مازندران"
        },
        {
            "lat": "31.871838473529898",
            "lon": "54.3079696888665",
            "lat+": "31.872158800000001",
            "lon+": "54.308346299999997",
            "lat-": "31.8715051",
            "lon-": "54.307574600000002",
            "city": "خلیل شهر",
            "province": "مازندران"
        },
        {
            "lat": "32.361195290870398",
            "lon": "51.443391617459703",
            "lat+": "32.370711499999999",
            "lon+": "51.453851800000002",
            "lat-": "32.361156399999999",
            "lon-": "51.436609799999999",
            "city": "زیرآب",
            "province": "مازندران"
        },
        {
            "lat": "36.531541433708902",
            "lon": "52.432512800575701",
            "lat+": "36.531987800000003",
            "lon+": "52.468208099999998",
            "lat-": "36.527728799999998",
            "lon-": "52.430640400000001",
            "city": "سورک",
            "province": "مازندران"
        },
        {
            "lat": "36.673299541266204",
            "lon": "52.459096454329398",
            "lat+": "36.673317300000001",
            "lon+": "52.459443200000003",
            "lat-": "36.672410300000003",
            "lon-": "52.454383200000002",
            "city": "سرخرود",
            "province": "مازندران"
        },
        {
            "lat": "36.6439804507663",
            "lon": "52.528873253509303",
            "lat+": "36.698692999999999",
            "lon+": "52.602409799999997",
            "lat-": "36.577086600000001",
            "lon-": "52.470306999999998",
            "city": "فریدونکنار",
            "province": "مازندران"
        },
        {
            "lat": "36.698913910908701",
            "lon": "51.267486680303499",
            "lat+": "36.699222800000001",
            "lon+": "51.2680942",
            "lat-": "36.698629199999999",
            "lon-": "51.266889900000002",
            "city": "کلارآباد",
            "province": "مازندران"
        },
        {
            "lat": "35.694132166614096",
            "lon": "59.881092649965701",
            "lat+": "36.018065",
            "lon+": "60.583976200000002",
            "lat-": "35.4352929",
            "lon-": "59.487825299999997",
            "city": "فریم",
            "province": "مازندران"
        },
        {
            "lat": "32.488719198065098",
            "lon": "51.409870271592197",
            "lat+": "32.489675200000001",
            "lon+": "51.412420400000002",
            "lat-": "32.486333199999997",
            "lon-": "51.409299400000002",
            "city": "زرگر محله",
            "province": "مازندران"
        },
        {
            "lat": "36.427345045295802",
            "lon": "51.079908830079901",
            "lat+": "36.597602100000003",
            "lon+": "51.273192999999999",
            "lat-": "36.236701600000004",
            "lon-": "50.916009500000001",
            "city": "کلاردشت",
            "province": "مازندران"
        },
        {
            "lat": "32.900452369329599",
            "lon": "51.528115747193198",
            "lat+": "32.900660199999997",
            "lon+": "51.528370500000001",
            "lat-": "32.900288000000003",
            "lon-": "51.527925699999997",
            "city": "سلمان شهر",
            "province": "مازندران"
        },
        {
            "lat": "36.646507135814502",
            "lon": "51.159003353817901",
            "lat+": "36.737690100000002",
            "lon+": "51.297775600000001",
            "lat-": "36.533797300000003",
            "lon-": "51.033096100000002",
            "city": "عباس آباد",
            "province": "مازندران"
        },
        {
            "lat": "35.700995787258101",
            "lon": "51.455036470925499",
            "lat+": "35.702331899999997",
            "lon+": "51.455095100000001",
            "lat-": "35.700826200000002",
            "lon-": "51.4550336",
            "city": "کیاسر",
            "province": "مازندران"
        },
        {
            "lat": "35.727259576287302",
            "lon": "51.535709011785002",
            "lat+": "35.728290999999999",
            "lon+": "51.535935600000002",
            "lat-": "35.724854800000003",
            "lon-": "51.535611799999998",
            "city": "شیرود",
            "province": "مازندران"
        },
        {
            "lat": "36.456255204873003",
            "lon": "52.882468826040999",
            "lat+": "36.573490399999997",
            "lon+": "53.048584699999999",
            "lat-": "36.367501500000003",
            "lon-": "52.722863199999999",
            "city": "قائم شهر",
            "province": "مازندران"
        },
        {
            "lat": "36.693881129381403",
            "lon": "53.803060306897898",
            "lat+": "36.796430999999998",
            "lon+": "54.069554099999998",
            "lat-": "36.594929999999998",
            "lon-": "53.640292500000001",
            "city": "گلوگاه",
            "province": "مازندران"
        },
        {
            "lat": "36.583122473131802",
            "lon": "52.816776519541698",
            "lat+": "36.583289600000001",
            "lon+": "52.821242699999999",
            "lat-": "36.582721900000003",
            "lon-": "52.811627399999999",
            "city": "کیاکلا",
            "province": "مازندران"
        },
        {
            "lat": "35.842250207373702",
            "lon": "50.974692398202599",
            "lat+": "35.842366599999998",
            "lon+": "50.975109699999997",
            "lat-": "35.842097600000002",
            "lon-": "50.974374099999999",
            "city": "کله بست",
            "province": "مازندران"
        },
        {
            "lat": "31.871838473529898",
            "lon": "54.3079696888665",
            "lat+": "31.872158800000001",
            "lon+": "54.308346299999997",
            "lat-": "31.8715051",
            "lon-": "54.307574600000002",
            "city": "کتالم وسادات شهر",
            "province": "مازندران"
        },
        {
            "lat": "35.629421140082002",
            "lon": "51.3910397579914",
            "lat+": "35.6295",
            "lon+": "51.393310700000001",
            "lat-": "35.629418700000002",
            "lon-": "51.387668400000003",
            "city": "کوهی خیل",
            "province": "مازندران"
        },
        {
            "lat": "35.511944474075101",
            "lon": "51.052529666845302",
            "lat+": "35.512128500000003",
            "lon+": "51.052765600000001",
            "lat-": "35.5118686",
            "lon-": "51.052451599999998",
            "city": "پرندک",
            "province": "مرکزی"
        },
        {
            "lat": "36.513711175250599",
            "lon": "53.5562560170167",
            "lat+": "36.8466953",
            "lon+": "54.028780500000003",
            "lat-": "36.332239299999998",
            "lon-": "53.231380700000003",
            "city": "نکا",
            "province": "مازندران"
        },
        {
            "lat": "36.434717744866099",
            "lon": "51.605577660966802",
            "lat+": "36.672509099999999",
            "lon+": "51.939446199999999",
            "lat-": "36.255097300000003",
            "lon-": "51.3182689",
            "city": "نوشهر",
            "province": "مازندران"
        },
        {
            "lat": "32.692960304259501",
            "lon": "51.5266788528617",
            "lat+": "32.693025400000003",
            "lon+": "51.526758200000003",
            "lat-": "32.691194600000003",
            "lon-": "51.525060400000001",
            "city": "توره",
            "province": "مرکزی"
        },
        {
            "lat": "37.3300557215005",
            "lon": "49.986000080754799",
            "lat+": "37.467646600000002",
            "lon+": "50.186060699999999",
            "lat-": "37.197256400000001",
            "lon-": "49.772830800000001",
            "city": "آستانه",
            "province": "مرکزی"
        },
        {
            "lat": "36.453992693728601",
            "lon": "51.3006112202754",
            "lat+": "36.454189100000001",
            "lon+": "51.300852800000001",
            "lat-": "36.4537719",
            "lon-": "51.3003353",
            "city": "مرزن آباد",
            "province": "مازندران"
        },
        {
            "lat": "36.2739296081633",
            "lon": "51.893410761863798",
            "lat+": "36.615960299999998",
            "lon+": "52.287574999999997",
            "lat-": "36.022574800000001",
            "lon-": "51.326545199999998",
            "city": "نور",
            "province": "مازندران"
        },
        {
            "lat": "34.141017148430898",
            "lon": "49.805616302799798",
            "lat+": "34.534503700000002",
            "lon+": "50.312171499999998",
            "lat-": "33.750049199999999",
            "lon-": "49.263108099999997",
            "city": "اراک",
            "province": "مرکزی"
        },
        {
            "lat": "34.431273640159702",
            "lon": "50.052376219391299",
            "lat+": "34.620798100000002",
            "lon+": "50.365993699999997",
            "lat-": "34.256662400000003",
            "lon-": "49.755929600000002",
            "city": "آشتیان",
            "province": "مرکزی"
        },
        {
            "lat": "35.672975185810998",
            "lon": "51.325891151672401",
            "lat+": "35.6731567",
            "lon+": "51.326554600000001",
            "lat-": "35.6729512",
            "lon-": "51.3229696",
            "city": "رازقان",
            "province": "مرکزی"
        },
        {
            "lat": "34.346399474485501",
            "lon": "49.221518379332601",
            "lat+": "34.6317083",
            "lon+": "49.5394705",
            "lat-": "34.123463399999999",
            "lon-": "48.949050499999998",
            "city": "خنداب",
            "province": "مرکزی"
        },
        {
            "lat": "34.811706325861302",
            "lon": "49.863031067658703",
            "lat+": "35.058897299999998",
            "lon+": "50.166078400000004",
            "lat-": "34.521539599999997",
            "lon-": "49.568994000000004",
            "city": "تفرش",
            "province": "مرکزی"
        },
        {
            "lat": "34.017134339843999",
            "lon": "50.750698902715101",
            "lat+": "34.342132499999998",
            "lon+": "51.053177300000002",
            "lat-": "33.7005725",
            "lon-": "50.257732699999998",
            "city": "دلیجان",
            "province": "مرکزی"
        },
        {
            "lat": "34.104178629619398",
            "lon": "49.683674987453898",
            "lat+": "34.104799999999997",
            "lon+": "49.687015100000004",
            "lat-": "34.103623399999996",
            "lon-": "49.682304899999998",
            "city": "داودآباد",
            "province": "مرکزی"
        },
        {
            "lat": "34.433366333945301",
            "lon": "49.3841298979576",
            "lat+": "34.477419599999998",
            "lon+": "49.417393500000003",
            "lat-": "34.4324552",
            "lon-": "49.228437100000001",
            "city": "ساروق",
            "province": "مرکزی"
        },
        {
            "lat": "33.891474511412397",
            "lon": "49.3036415788741",
            "lat+": "34.2119328",
            "lon+": "49.687435299999997",
            "lat-": "33.595260400000001",
            "lon-": "48.9546536",
            "city": "شازند",
            "province": "مرکزی"
        },
        {
            "lat": "34.049968654975402",
            "lon": "49.623178106770403",
            "lat+": "34.051719400000003",
            "lon+": "49.625082399999997",
            "lat-": "34.049951800000002",
            "lon-": "49.623137999999997",
            "city": "سنجان",
            "province": "مرکزی"
        },
        {
            "lat": "34.623584110200099",
            "lon": "50.911680367866097",
            "lat+": "34.626215999999999",
            "lon+": "50.916480999999997",
            "lat-": "34.621051100000003",
            "lon-": "50.907610099999999",
            "city": "زاویه",
            "province": "مرکزی"
        },
        {
            "lat": "34.475863429572499",
            "lon": "49.678375720443398",
            "lat+": "34.487630000000003",
            "lon+": "49.685966100000002",
            "lat-": "34.247420499999997",
            "lon-": "49.667480300000001",
            "city": "فرمهین",
            "province": "مرکزی"
        },
        {
            "lat": "34.063163943911803",
            "lon": "49.647022334720198",
            "lat+": "34.06935",
            "lon+": "49.658005600000003",
            "lat-": "34.060138600000002",
            "lon-": "49.641548499999999",
            "city": "کرهرود",
            "province": "مرکزی"
        },
        {
            "lat": "33.666881931046802",
            "lon": "49.997613194449499",
            "lat+": "33.941443100000001",
            "lon+": "50.455080899999999",
            "lat-": "33.383440899999997",
            "lon-": "49.595826199999998",
            "city": "خمین",
            "province": "مرکزی"
        },
        {
            "lat": "35.272724207546297",
            "lon": "50.537865177286697",
            "lat+": "35.287229799999999",
            "lon+": "50.563589100000002",
            "lat-": "35.257341599999997",
            "lon-": "50.533255500000003",
            "city": "مأمونیه",
            "province": "مرکزی"
        },
        {
            "lat": "34.7255631741263",
            "lon": "49.306010108686699",
            "lat+": "34.961627",
            "lon+": "49.507827599999999",
            "lat-": "34.524796600000002",
            "lon-": "49.105394199999999",
            "city": "کمیجان",
            "province": "مرکزی"
        },
        {
            "lat": "35.282503949262299",
            "lon": "49.490299349367703",
            "lat+": "35.314940499999999",
            "lon+": "49.698116400000004",
            "lat-": "35.146346999999999",
            "lon-": "49.175786199999997",
            "city": "نوبران",
            "province": "مرکزی"
        },
        {
            "lat": "35.074591180614497",
            "lon": "50.032896465916998",
            "lat+": "35.417881000000001",
            "lon+": "50.748572600000003",
            "lat-": "34.748089100000001",
            "lon-": "49.261668800000002",
            "city": "ساوه",
            "province": "مرکزی"
        },
        {
            "lat": "34.096075845863197",
            "lon": "49.6772878521951",
            "lat+": "34.096268100000003",
            "lon+": "49.679555100000002",
            "lat-": "34.095977099999999",
            "lon-": "49.677172900000002",
            "city": "هندودر",
            "province": "مرکزی"
        },
        {
            "lat": "35.633504090498803",
            "lon": "51.311647921747898",
            "lat+": "35.633867000000002",
            "lon+": "51.311983499999997",
            "lat-": "35.633138899999999",
            "lon-": "51.311345099999997",
            "city": "غرق آباد",
            "province": "مرکزی"
        },
        {
            "lat": "27.194710970077999",
            "lon": "54.488948575747202",
            "lat+": "27.466990200000001",
            "lon+": "55.388498499999997",
            "lat-": "26.912646500000001",
            "lon-": "53.828064099999999",
            "city": "بستک",
            "province": "هرمزگان"
        },
        {
            "lat": "37.5474699589764",
            "lon": "45.074464855728401",
            "lat+": "37.549348000000002",
            "lon+": "45.0748277",
            "lat-": "37.546087999999997",
            "lon-": "45.073574299999997",
            "city": "قورچی باشی",
            "province": "مرکزی"
        },
        {
            "lat": "25.875535577366801",
            "lon": "55.032352627127999",
            "lat+": "25.904714899999998",
            "lon+": "55.056760599999997",
            "lat-": "25.845555999999998",
            "lon-": "55.004522899999998",
            "city": "ابوموسی",
            "province": "هرمزگان"
        },
        {
            "lat": "34.003135856675399",
            "lon": "50.846454421058297",
            "lat+": "34.034132100000001",
            "lon+": "50.874831399999998",
            "lat-": "34.001852100000001",
            "lon-": "50.8213613",
            "city": "نراق",
            "province": "مرکزی"
        },
        {
            "lat": "35.714709004266197",
            "lon": "51.335645551815801",
            "lat+": "35.7218272",
            "lon+": "51.337491200000002",
            "lat-": "35.701840400000002",
            "lon-": "51.335002699999997",
            "city": "جناح",
            "province": "هرمزگان"
        },
        {
            "lat": "33.882955289093204",
            "lon": "50.450797855474697",
            "lat+": "34.154173999999998",
            "lon+": "50.762340999999999",
            "lat-": "33.626026799999998",
            "lon-": "50.151504299999999",
            "city": "محلات",
            "province": "مرکزی"
        },
        {
            "lat": "26.947482567718801",
            "lon": "56.069078831941702",
            "lat+": "26.949003699999999",
            "lon+": "56.0717979",
            "lat-": "26.945965699999999",
            "lon-": "56.066347200000003",
            "city": "درگهان",
            "province": "هرمزگان"
        },
        {
            "lat": "27.281502290436801",
            "lon": "55.4963521843286",
            "lat+": "27.525715300000002",
            "lon+": "56.057645200000003",
            "lat-": "26.900324699999999",
            "lon-": "54.893221699999998",
            "city": "خمیر",
            "province": "هرمزگان"
        },
        {
            "lat": "28.990492197278499",
            "lon": "53.630262942527899",
            "lat+": "29.011430000000001",
            "lon+": "53.639537599999997",
            "lat-": "28.956415700000001",
            "lon-": "53.625515",
            "city": "بندر عباس",
            "province": "هرمزگان"
        },
        {
            "lat": "26.838356776006901",
            "lon": "57.066699436167298",
            "lat+": "26.930020899999999",
            "lon+": "57.1228123",
            "lat-": "26.8038861",
            "lon-": "57.050071600000003",
            "city": "بندر جاسک",
            "province": "هرمزگان"
        },
        {
            "lat": "36.743429718644599",
            "lon": "53.879697762101998",
            "lat+": "36.7483006",
            "lon+": "53.905227600000003",
            "lat-": "36.732675499999999",
            "lon-": "53.797355799999998",
            "city": "بندر چارک",
            "province": "هرمزگان"
        },
        {
            "lat": "26.839491363789499",
            "lon": "54.624788961891198",
            "lat+": "27.1324291",
            "lon+": "55.5747255",
            "lat-": "26.493633899999999",
            "lon-": "53.421462300000002",
            "city": "بندر لنگه",
            "province": "هرمزگان"
        },
        {
            "lat": "35.776505194121597",
            "lon": "51.415734448539801",
            "lat+": "35.776570800000002",
            "lon+": "51.415829899999999",
            "lat-": "35.7764995",
            "lon-": "51.415202899999997",
            "city": "سوزا",
            "province": "هرمزگان"
        },
        {
            "lat": "26.490340527966602",
            "lon": "57.229312770246501",
            "lat+": "26.967111899999999",
            "lon+": "57.527903299999998",
            "lat-": "26.091001899999998",
            "lon-": "56.9552312",
            "city": "سیریک",
            "province": "هرمزگان"
        },
        {
            "lat": "27.135284634425201",
            "lon": "53.261813885667898",
            "lat+": "27.334167900000001",
            "lon+": "53.832503799999998",
            "lat-": "26.945173499999999",
            "lon-": "52.736308200000003",
            "city": "پارسیان",
            "province": "هرمزگان"
        },
        {
            "lat": "32.627003351880298",
            "lon": "51.683970378106402",
            "lat+": "32.630949100000002",
            "lon+": "51.694267600000003",
            "lat-": "32.621759400000002",
            "lon-": "51.6750677",
            "city": "تخت",
            "province": "هرمزگان"
        },
        {
            "lat": "36.375487700000001",
            "lon": "59.495144199999999",
            "lat+": "36.376027299999997",
            "lon+": "59.496012499999999",
            "lat-": "36.374948099999997",
            "lon-": "59.494275899999998",
            "city": "سرگز",
            "province": "هرمزگان"
        },
        {
            "lat": "26.783832158828901",
            "lon": "55.811451092632801",
            "lat+": "26.9952182",
            "lon+": "56.280695399999999",
            "lat-": "26.538111300000001",
            "lon-": "55.262024799999999",
            "city": "قشم",
            "province": "هرمزگان"
        },
        {
            "lat": "35.786814175796103",
            "lon": "51.469234379483702",
            "lat+": "35.787122699999998",
            "lon+": "51.469830600000002",
            "lat-": "35.786406399999997",
            "lon-": "51.468756499999998",
            "city": "فین",
            "province": "هرمزگان"
        },
        {
            "lat": "26.9398793557862",
            "lon": "57.330235764016699",
            "lat+": "27.453397899999999",
            "lon+": "57.815901199999999",
            "lat-": "26.473777800000001",
            "lon-": "56.800125800000004",
            "city": "میناب",
            "province": "هرمزگان"
        },
        {
            "lat": "35.272605041581897",
            "lon": "59.437095856447698",
            "lat+": "35.305871799999998",
            "lon+": "59.441596699999998",
            "lat-": "35.260403799999999",
            "lon-": "59.4269344",
            "city": "کنگ",
            "province": "هرمزگان"
        },
        {
            "lat": "36.230435545706399",
            "lon": "45.460908031167499",
            "lat+": "36.476326999999998",
            "lon+": "45.7021072",
            "lat-": "35.968154499999997",
            "lon-": "45.237242199999997",
            "city": "سردشت بشاگرد",
            "province": "هرمزگان"
        },
        {
            "lat": "26.5345657578569",
            "lon": "53.972132639206301",
            "lat+": "26.5776401",
            "lon+": "54.048752499999999",
            "lat-": "26.4948604",
            "lon-": "53.897762999999998",
            "city": "کیش",
            "province": "هرمزگان"
        },
        {
            "lat": "35.704055028149597",
            "lon": "51.113207935451904",
            "lat+": "35.7425067",
            "lon+": "51.197470299999999",
            "lat-": "35.662363300000003",
            "lon-": "51.020417600000002",
            "city": "قلعه قاضی",
            "province": "هرمزگان"
        },
        {
            "lat": "27.162892589892301",
            "lon": "56.232479970780197",
            "lat+": "27.1630869",
            "lon+": "56.233342999999998",
            "lat-": "27.162585100000001",
            "lon-": "56.231113899999997",
            "city": "گوهران",
            "province": "هرمزگان"
        },
        {
            "lat": "34.808490477021103",
            "lon": "48.501871737174",
            "lat+": "34.808745899999998",
            "lon+": "48.503098999999999",
            "lat-": "34.8084822",
            "lon-": "48.501849",
            "city": "دمق",
            "province": "همدان"
        },
        {
            "lat": "34.542852998511698",
            "lon": "48.332148097061499",
            "lat+": "34.765898399999998",
            "lon+": "48.585453200000003",
            "lat-": "34.336356299999998",
            "lon-": "48.071108799999998",
            "city": "تویسرکان",
            "province": "همدان"
        },
        {
            "lat": "34.885229291427102",
            "lon": "48.610567155438503",
            "lat+": "35.733034600000003",
            "lon+": "49.470902199999998",
            "lat-": "34.000752400000003",
            "lon-": "47.795561399999997",
            "city": "همدان",
            "province": "همدان"
        },
        {
            "lat": "27.061431104910898",
            "lon": "56.4604961550735",
            "lat+": "27.1013436",
            "lon+": "56.502194699999997",
            "lat-": "27.030041300000001",
            "lon-": "56.419136199999997",
            "city": "هرمز",
            "province": "هرمزگان"
        },
        {
            "lat": "35.432574314264102",
            "lon": "48.973312466791697",
            "lat+": "35.733034600000003",
            "lon+": "49.434517499999998",
            "lat-": "35.182508599999998",
            "lon-": "48.5504915",
            "city": "رزن",
            "province": "همدان"
        },
        {
            "lat": "34.983579934789702",
            "lon": "48.362648545513103",
            "lat+": "35.161233699999997",
            "lon+": "48.688210400000003",
            "lat-": "34.750332899999997",
            "lon-": "48.136734500000003",
            "city": "بهار",
            "province": "همدان"
        },
        {
            "lat": "34.778978310198099",
            "lon": "48.028469970762998",
            "lat+": "34.984865300000003",
            "lon+": "48.269670400000003",
            "lat-": "34.5864598",
            "lon-": "47.795561399999997",
            "city": "اسدآباد",
            "province": "همدان"
        },
        {
            "lat": "35.717615550482599",
            "lon": "51.111839019183499",
            "lat+": "35.719495100000003",
            "lon+": "51.112239799999998",
            "lat-": "35.7174038",
            "lon-": "51.108712099999998",
            "city": "سرکان",
            "province": "همدان"
        },
        {
            "lat": "36.673595499999998",
            "lon": "59.098837899999999",
            "lat+": "36.676694900000001",
            "lon+": "59.107894000000002",
            "lat-": "36.656320800000003",
            "lon-": "59.0928112",
            "city": "جوکار",
            "province": "همدان"
        },
        {
            "lat": "34.460693831235098",
            "lon": "48.260132383304502",
            "lat+": "34.484738499999999",
            "lon+": "48.299199999999999",
            "lat-": "34.362889799999998",
            "lon-": "48.109986599999999",
            "city": "فرسفج",
            "province": "همدان"
        },
        {
            "lat": "35.090729946929102",
            "lon": "49.186968527259701",
            "lat+": "35.244457199999999",
            "lon+": "49.470902199999998",
            "lat-": "34.8412668",
            "lon-": "48.832559799999999",
            "city": "فامنین",
            "province": "همدان"
        },
        {
            "lat": "34.460693831235098",
            "lon": "48.260132383304502",
            "lat+": "34.484738499999999",
            "lon+": "48.299199999999999",
            "lat-": "34.362889799999998",
            "lon-": "48.109986599999999",
            "city": "فیروزان",
            "province": "همدان"
        },
        {
            "lat": "35.6342403964263",
            "lon": "51.434798693233702",
            "lat+": "35.634270800000003",
            "lon+": "51.435446499999998",
            "lat-": "35.6342353",
            "lon-": "51.4294577",
            "city": "زنگنه",
            "province": "همدان"
        },
        {
            "lat": "35.365738054665201",
            "lon": "48.380748977847901",
            "lat+": "35.718671200000003",
            "lon+": "48.918855000000001",
            "lat-": "34.956071700000003",
            "lon-": "47.864371499999997",
            "city": "کبودرآهنگ",
            "province": "همدان"
        },
        {
            "lat": "34.832860011487703",
            "lon": "48.466766692357503",
            "lat+": "34.844690100000001",
            "lon+": "48.483673199999998",
            "lat-": "34.823096900000003",
            "lon-": "48.449576899999997",
            "city": "مریانج",
            "province": "همدان"
        },
        {
            "lat": "35.663544899999998",
            "lon": "51.307847049999999",
            "lat+": "35.663648299999998",
            "lon+": "51.308602800000003",
            "lat-": "35.663441499999998",
            "lon-": "51.307091300000003",
            "city": "شیرین سو",
            "province": "همدان"
        },
        {
            "lat": "31.093275958155399",
            "lon": "53.383017792997599",
            "lat+": "31.5957203",
            "lon+": "54.002648100000002",
            "lat-": "30.658297600000001",
            "lon-": "52.8028081",
            "city": "ابرکوه",
            "province": "یزد"
        },
        {
            "lat": "34.221539319391901",
            "lon": "48.243189618959399",
            "lat+": "34.431840800000003",
            "lon+": "48.538993300000001",
            "lat-": "34.000752400000003",
            "lon-": "47.883946399999999",
            "city": "نهاوند",
            "province": "همدان"
        },
        {
            "lat": "36.291315581092803",
            "lon": "59.568850854662699",
            "lat+": "36.300144199999998",
            "lon+": "59.5859655",
            "lat-": "36.283335399999999",
            "lon-": "59.556992299999997",
            "city": "احمدآباد",
            "province": "یزد"
        },
        {
            "lat": "34.322821463032099",
            "lon": "48.793777956196799",
            "lat+": "34.672463899999997",
            "lon+": "49.174908500000001",
            "lat-": "34.001485600000002",
            "lon-": "48.377865999999997",
            "city": "ملایر",
            "province": "همدان"
        },
        {
            "lat": "35.229385110257297",
            "lon": "47.826159269743201",
            "lat+": "35.5786236",
            "lon+": "48.1934282",
            "lat-": "34.9239642",
            "lon-": "47.420735399999998",
            "city": "قروه در جزین",
            "province": "همدان"
        },
        {
            "lat": "35.756626068547298",
            "lon": "51.325805326505701",
            "lat+": "35.756989099999998",
            "lon+": "51.325881699999996",
            "lat-": "35.756605700000001",
            "lon-": "51.324220199999999",
            "city": "گل تپه",
            "province": "همدان"
        },
        {
            "lat": "32.011812601356702",
            "lon": "56.143799977328797",
            "lat+": "32.479118900000003",
            "lon+": "56.6559308",
            "lat-": "31.548750999999999",
            "lon-": "55.504782499999997",
            "city": "بهاباد",
            "province": "یزد"
        },
        {
            "lat": "31.871366015326799",
            "lon": "54.043090742545601",
            "lat+": "31.875696300000001",
            "lon+": "54.262217499999998",
            "lat-": "31.859324300000001",
            "lon-": "53.959780799999997",
            "city": "خضرآباد",
            "province": "یزد"
        },
        {
            "lat": "31.990862080673701",
            "lon": "54.043176362606303",
            "lat+": "32.213243499999997",
            "lon+": "54.440623799999997",
            "lat-": "31.758129",
            "lon-": "53.692245300000003",
            "city": "اشکذر",
            "province": "یزد"
        },
        {
            "lat": "31.937077853795401",
            "lon": "54.271494406371197",
            "lat+": "31.9581339",
            "lon+": "54.294047300000003",
            "lat-": "31.918801699999999",
            "lon-": "54.250316499999997",
            "city": "شاهدیه",
            "province": "یزد"
        },
        {
            "lat": "31.814858592765699",
            "lon": "54.408812037658201",
            "lat+": "31.833888900000002",
            "lon+": "54.422407100000001",
            "lat-": "31.796400299999998",
            "lon-": "54.393860099999998",
            "city": "حمیدیا",
            "province": "یزد"
        },
        {
            "lat": "32.032055234862099",
            "lon": "54.256796247568197",
            "lat+": "32.073201500000003",
            "lon+": "54.2766777",
            "lat-": "32.005007399999997",
            "lon-": "54.238172300000002",
            "city": "زارچ",
            "province": "یزد"
        },
        {
            "lat": "35.687227053743101",
            "lon": "50.794055102419499",
            "lat+": "35.702355699999998",
            "lon+": "50.8158411",
            "lat-": "35.668349200000002",
            "lon-": "50.773143699999999",
            "city": "مهردشت",
            "province": "یزد"
        },
        {
            "lat": "31.359533912916302",
            "lon": "54.289134316469699",
            "lat+": "31.369624099999999",
            "lon+": "54.291300300000003",
            "lat-": "31.3566027",
            "lon-": "54.288181799999997",
            "city": "مروست",
            "province": "یزد"
        },
        {
            "lat": "31.668010354273999",
            "lon": "55.400603451107102",
            "lat+": "32.178696000000002",
            "lon+": "56.064157899999998",
            "lat-": "31.113684599999999",
            "lon-": "54.7195702",
            "city": "بافق",
            "province": "یزد"
        },
        {
            "lat": "32.262879577499902",
            "lon": "53.492341583842503",
            "lat+": "32.309571400000003",
            "lon+": "53.4982398",
            "lat-": "32.243589100000001",
            "lon-": "53.467942299999997",
            "city": "عقدا",
            "province": "یزد"
        },
        {
            "lat": "31.806780554950699",
            "lon": "54.609748576743797",
            "lat+": "33.362711300000001",
            "lon+": "56.6559308",
            "lat-": "29.595357700000001",
            "lon-": "52.8028081",
            "city": "یزد",
            "province": "یزد"
        },
        {
            "lat": "33.306436604321497",
            "lon": "56.820601035511601",
            "lat+": "35.0943404",
            "lon+": "58.350374000000002",
            "lat-": "31.680605",
            "lon-": "55.381466600000003",
            "city": "طبس",
            "province": "یزد"
        },
        {
            "lat": "32.100396865121297",
            "lon": "53.856641811708997",
            "lat+": "32.202778199999997",
            "lon+": "53.972429699999999",
            "lat-": "32.090178600000002",
            "lon-": "53.842649100000003",
            "city": "ندوشن",
            "province": "یزد"
        },
        {
            "lat": "31.4544159879411",
            "lon": "53.814270168926001",
            "lat+": "31.886145899999999",
            "lon+": "54.305177899999997",
            "lat-": "31.0009333",
            "lon-": "53.2038212",
            "city": "تفت",
            "province": "یزد"
        },
        {
            "lat": "31.346708640439399",
            "lon": "54.644753219239902",
            "lat+": "31.755988200000001",
            "lon+": "55.278092100000002",
            "lat-": "31.005061300000001",
            "lon-": "54.125152700000001",
            "city": "مهریز",
            "province": "یزد"
        },
        {
            "lat": "32.010006140649502",
            "lon": "53.527279691193897",
            "lat+": "32.3194442",
            "lon+": "54.420460499999997",
            "lat-": "31.593025099999998",
            "lon-": "53.007540300000002",
            "city": "میبد",
            "province": "یزد"
        },
        {
            "lat": "34.735325357523998",
            "lon": "60.801172446245097",
            "lat+": "34.735650300000003",
            "lon+": "60.801558800000002",
            "lat-": "34.7349666",
            "lon-": "60.800726900000001",
            "city": "هرات",
            "province": "یزد"
        }
    ]

    # advertisement_type_ids
    deal_type_list = [
        {'id': 1, 'title': 'فروش'},
        {'id': 2, 'title': 'اجاره'}
    ]

    # application_ids => estate_type_ids
    category_list = [
        {'id': 1, 'title': 'مسکونی',
         'sub': [
             {'id': 1, 'title': 'آپارتمان'},
             {'id': 5, 'title': 'آپارتمان'},
             {'id': 2, 'title': 'خانه و ویلا'},
             {'id': 3, 'title': 'خانه و ویلا'},
             {'id': 6, 'title': 'زمین و کلنگی'}
         ]
         },
        {'id': 2, 'title': 'اداری و تجاری',
         'sub': [
             {'id': 1, 'title': 'دفتر کار اتاق اداری و مطب'},
             {'id': 6, 'title': 'صنعتی کشاورزی و تجاری'},
             {'id': 4, 'title': 'مغازه و غرفه'}
         ]
         },

        {'id': 4, 'title': 'اداری و تجاری',
         'sub': [
             {'id': 1, 'title': 'دفتر کار اتاق اداری و مطب'},
             {'id': 6, 'title': 'صنعتی کشاورزی و تجاری'},
             {'id': 4, 'title': 'مغازه و غرفه'}
         ]
         },
        {'id': 12, 'title': 'سایر املاک'},
        {'id': 9, 'title': 'سایر املاک'},
        {'id': 5, 'title': 'سایر املاک'},
    ]
